{
  "id": "69bed761-dd2f-4193-974f-81d7921c4ba3",
  "external_id": "roylkpzfgeM",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-10-04T04:31:03+00:00",
  "created_at": "2025-10-10T02:15:00.767251+00:00",
  "updated_at": "2025-10-10T02:59:55.678015+00:00",
  "reading_time_seconds": 1343,
  "category": {
    "category": "HEALTH",
    "shelf_life": "MONTH",
    "geography": null
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "Yoga and Science: Regulating the Nervous System"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "Eddie Stern discusses the intersection of classical yoga and modern science, focusing on how yoga practices like asanas and pranayama regulate the autonomic nervous system. He explains that these practices help reduce fear and stress by calming brain stem functions, which in turn supports emotional and mental well-being. Stern shares insights from scientific studies on yoga's benefits for blood pressure and academic performance, emphasizing that yoga is an experiential science aimed at self-knowledge and nervous system balance, ultimately aiding spiritual growth and health."
    },
    "MEDIUM": {
      "markdown_string": "# Yoga and Science: Regulating the Nervous System\n\n## An Evening with Eddie Stern at the Vedanta Society of New York\n\n[Music]  \n[Laughter]  \n[Music]\n\nThe Vedanta Society of New York opened its fall season with a special visit from Eddie Stern, founder of Broome Street Ganesha Temple, Broome Street Yoga, the Breathing App, and the Yoga Education Collective. The evening began with warm welcomes and a sense of anticipation for what would become a deep exploration of yoga's intersection with modern science.\n\nEddie Stern, who has been practicing yoga since 1987 with extensive training in South India, brings a multidisciplinary approach that bridges traditional texts with scientific research, healthcare, technology, and collaboration. For the first part of the session, Eddie spoke for approximately 30 minutes on \"Classical Yoga and Modern Science,\" followed by a conversation with Swami Sarvapriyananda and a Q&A session.\n\n### A Personal Connection to the Vedanta Tradition\n\nBefore diving into the science, Eddie shared a heartfelt personal connection to the Ramakrishna Mission that few knew about. \"I have to admit I'm terrified to speak in front of Swami G and all of you,\" he began with characteristic humility, \"but that's how it goes.\"\n\nHe revealed that one of his early teachers, Lex Hixon, was a direct disciple of Swami Nikhilananda. \"I had received initiation in the Ramakrishna and Divine Mother mantras from Lex Hixon many, many, many years ago,\" Eddie shared. When he first traveled to India in 1988, Hixon advised him: \"When you reach India, the first thing you have to do is go to the Ramakrishna Mission wherever you are, and then go to every other single one that you can find along your travels, and you will be guided and protected.\"\n\nEddie followed this advice meticulously. \"I did exactly as he said, and I've been going to the missions ever since.\" He first visited the Vedanta Center in 1994, around the same time of year as this talk, and purchased a copy of the Devi Mahatmyam that he had been searching for. \"I have been reading that copy of the Devi Mahatmyam that I bought here right before the Navaratri festival started every year since 1994,\" he revealed, making this location particularly dear to his heart.\n\nHis connections deepened through studying Vedic chanting under Swami Yuktatmananda at the Ramakrishna Mission on 94th Street and learning from Swami Nityasthananda in Bangalore. \"My heart is very close to the Ramakrishna Mission and to Sri Ramakrishna and the Divine Mother and Vivekananda Ji,\" he expressed. \"So it's really a pleasure to be here.\"\n\n### The Intersection of Yoga and Science\n\nEddie began his formal talk by addressing the common tension between yoga traditionalists and scientific inquiry. \"We hear a lot these days about the scientific effects of yoga and the scientific benefits of yoga,\" he noted. \"People who are very diehard yoga enthusiasts say we don't need science to prove yoga. We already know that it works. And that's absolutely true. And then the people who are diehard yoga enthusiasts and also are scientists say it's true. We don't need it to prove that it works. We already know that it works. We're curious about why it might work and on what level does it work.\"\n\nHe emphasized that yoga has always been considered a science—\"yoga vidya,\" where vidya means a system of learning. \"It's a protoscience and it's an experiential science. One of the most important things about yoga is your direct perception of truth and clarifying your fields of perception so that you can see clearly and understand hopefully eventually who is the seer and what is being seen.\"\n\n### From Blood Pressure to GPA: Unexpected Research Findings\n\nEddie's entry into scientific research came unexpectedly about 12-14 years ago when researcher Marshall Hagins from Columbia University approached him. \"He wanted to do a study on if yoga could help African-Americans with prehypertensive conditions lower their blood pressure.\" At that time, Eddie knew \"zero about science\"—he had never attended college, going straight from high school to India.\n\nDespite this, he designed a protocol that seemed \"kind of relaxing for people.\" The two-year NIH-funded study involved about 120 participants and yielded significant results: \"Sleeping blood pressure lowered and the waking blood pressure also lowered especially for the diastolic blood pressure. In fact, it was statistically significant to the same level of statins.\"\n\nFrom there, they conducted another study with high school students on Manhattan's Lower East Side at a Title I school where 95% of students received free lunch and breakfast. Comparing 40 yoga classes against 40 physical education classes, they found that \"the youngsters who had 40 yoga classes their grade point average went up 2.7% in comparison to the gym class. This brings you from a D to a C. It brings you from a C to a B if you're in the right threshold.\"\n\n### The Nervous System Connection\n\nWhat struck Eddie was that the protocols for these radically different groups weren't substantially different. \"I was basically using the same poses, basically using the same breathing, basically using the same relaxation. There wasn't all that much that was different.\" This led him to a crucial insight: \"My intuition was that it was basically because of the nervous system and that the nervous system when it becomes regulated knows what it needs to fix and knows what needs to come into place.\"\n\nThis realization launched him into deeper studies of physiology and the nervous system, exploring how yogis might have been using these practices specifically for nervous system regulation.\n\n### The Five Kleshas: Why We Suffer\n\nEddie focused particularly on Patanjali's concept of the kleshas—the five obstacles to self-knowledge discussed primarily in the second chapter of the Yoga Sutras. He guided the audience through each klesha with remarkable clarity:\n\n**1. Avidya** - \"An absence of a true knowledge of who we are.\" Eddie explained that while we have partial knowledge of our relative identity (\"My name is Eddie. I seem to be a yoga teacher although that's questionable. And I seem to not have hair\"), we lack knowledge of our absolute nature as consciousness, awareness, and infinite being.\n\nHe referenced the opening hymn from the Taittiriya Upanishad: \"The self exists within the cave of the heart is the expanse of the infinite.\" The experience of this is \"satyam (truth), jnanam (knowledge), and anantam (infinite unlimited being).\"\n\n**2. Asmita** - When we don't know who we truly are, \"we create some narratives, we create some stories.\" Our relative identity—name, form, occupation, family, genealogy, history, traumas, successes—\"become the narrative of my personality and I start to identify with them.\" This narrative construction begins almost immediately after birth and is based on two fundamental things.\n\n**3. Raga and Dvesha** - Attachment to things we like and aversion to things we dislike. \"I like vegetarian food. I like to listen to punk rock music. I like modern art. I love yoga. I love studying Vedanta. I love studying Sankhya,\" Eddie offered as examples. \"I don't like right-wing fundamentalism. I don't like suffering and sickness and pain and injustice.\" Even simpler preferences: \"I like coffee. I don't like matcha. I like pasta with spicy tomato sauce but I don't really like pasta with lemon on top of it so don't feed me that.\"\n\n**4. Abhinivesha** - The clinging to life and fear of death. \"If all of my likes and dislikes and all of my narrative were pulled out from underneath me like a rug, who would I be? And that's a terrifying proposition... The fear that comes along with that is a fear of extinction, a fear of not existing. And that is also called the fear of death.\"\n\n### The Yogic Solution: Kriya Yoga\n\nPatanjali prescribes kriya yoga—the yoga of action—consisting of three components:\n\n**Tapas** - Often translated as austerity, but Eddie preferred Sri Krishnamacharya's definition as \"ripening.\" \"If you think of a fruit on a tree, it needs the heat of the sun and it needs the soil and of course the tree and the wind and the rain and the change of seasons and all of these things to slowly slowly slowly ripen this fruit until it's ready to just fall from the tree or be easily plucked from the tree to be enjoyed.\" Overdoing practices can cause harm, while the right amount of effort leads to natural ripening.\n\n**Svadhyaya** - The repetition of mantras and self-study. \"The Vedic mantras are all related to the idea of svaha of self. Who am I? What am I doing here? What is my purpose? How do I engage in the world?\" This practice turns our awareness inward for self-examination.\n\n**Ishvara Pranidhana** - Surrender to the divine or to the unknown. \"A letting go of the narratives that we have in order to experience something expanded or beyond ourselves.\"\n\nThese three practices \"weaken the kleshas and prepare us for samadhi,\" the eighth limb of yoga involving cognitive absorption.\n\n### The Physiological Mechanism: Regulating the Brain Stem\n\nThe crucial question Eddie posed: \"How is it that standing on our head or doing a sun salutation or doing a triangle pose or breathing in through one nostril, how is this going to begin to diminish any of these kleshas?\"\n\nThe answer lies in the physiological perspective, particularly regarding abhinivesha—the clinging to life. \"Where in our body do we cling to life? It is the absolute job of our brain stem to cling to life.\" He detailed the brain stem's survival functions: breathing, heartbeat, blood pressure regulation, sleep, digestion, reproduction, and body temperature adjustment.\n\n\"The yogis did asanas, they did pranayama, they did mitahara (regulation of food), they did regulation of sleep, they did regulation of sexuality, and they did regulation of temperature by different types of tapas.\" Essentially, all the primary brain stem functions correspond to yogic practices designed to control these autonomic nervous system processes.\n\n\"When you start to willfully and consciously regulate your blood pressure, stop your breathing for a little while, slow the heart rate, go without food for periods of time without suffering, what happens is you're overriding signals in your brain stem.\" The first time you try to hold your breath, your body panics, but with practice, \"the operations of the brain stem begin to shift and they stop trying to run the show, but they start to adapt to what the yogi is doing in a very conscious and deliberate and slow manner to shift autonomic nervous system function.\"\n\n### The Domino Effect: From Brain Stem to Emotional Centers\n\nAs breathing comes under conscious control and slows, \"this idea of clinging to life through breathing begins to diminish. You stop losing the fear of holding on to breath of holding on to these things.\" This directly affects abhinivesha, which is \"associated with the brain stem functions and brain stem information flows.\"\n\nThe changes then ripple through other brain regions: \"As our fear begins to lessen, it changes things that are happening in the fear structures of our brain, the amygdalas, which are in the limbic system, the emotional centers.\" Signals of safety, calm, and equilibrium spread through the brain networks.\n\nThis emotional regulation enables deeper self-reflection. \"It's very difficult to self-reflect on an intellectual level because when we do self-reflection on the intellectual level, we usually think we're pretty good.\" True self-honesty happens at the limbic level: \"Am I being honest with myself? Am I being really true about how I behave in the world? About how I treat other people? About how I'm attending to my spiritual life? You know, is it just lip service or am I really really doing it?\"\n\n### The Path to Humility and Devotion\n\nThis emotional honesty expands to the prefrontal cortex, enabling surrender, devotion, and humility. \"Humility comes along with acknowledging where our flaws are. Humility doesn't come from bowing down in front of a god or bowing down in front of the saints or in a temple. It comes from feeling these are the places where I've really gone awry and here are the things I need to work on and I can't do it on my own.\"\n\nThis humility leads to \"devotion to this idea of I can't do it all on my own steam. I need to let go. I need to merge my mind into the source.\"\n\n### Science's Role in Understanding Relative Reality\n\nEddie concluded by clarifying science's proper domain: \"Modern science can look at all of these different levels\"—referring to the pancha koshas (five sheaths) of the Taittiriya Upanishad: \"the physical body, the pranamayakosha (the nervous system body), the manomayakosha (the mind body), and the vijnyanamayakosha (the intellectual body).\"\n\n\"Modern science is very good at studying our relative existence. It's not good at studying the absolute reality because that can't be studied. But it's extremely good and getting better at studying the relative reality.\" The purpose of modern science in yoga is \"to help us be healthy, to understand mechanisms, and apply those mechanisms for the best possible outcomes.\"\n\n## Conversation with Swami Sarvapriyananda\n\nSwami Sarvapriyananda began by expressing profound gratitude to Eddie for inaugurating their fall session. He highlighted Eddie's central role in New York's yoga scene: \"Today if you want to know yoga, New York is a hot hot spot for yoga in the world today and in New York you want to know more about yoga you google it Eddie's name will come up. So he's central to yoga in the 21st century and here especially in New York.\"\n\nHe placed Eddie within the influential \"Mysore school\" lineage of Krishnamacharya, B.K.S. Iyengar, Pattabhi Jois, while also connecting him to Swami Vivekananda, who wrote the first Vedanta Society publication—a commentary on Patanjali's Yoga Sutras—in 1895.\n\n### The Practical Journey Through the Five Koshas\n\nFollowing Eddie's framework of the Taittiriya Upanishad's pancha kosha (five sheaths), Swami Sarvapriyananda guided a practical exploration of what yoga does at each level.\n\n#### Annamaya Kosha: The Physical Body\n\nStarting with the physical body, Swami Sarvapriyananda quoted Swami Pavitrananda: \"Don't abuse the horse you cannot dismount from.\" While we are not the body, \"as long as it seems quite obvious to me that the body is there and I am the body,\" we must care for it properly.\n\nHe asked Eddie about posture's spiritual significance. Eddie explained: \"One nice definition of posture is the attitude of your body. If you're sitting up straight and you're calm, there's an attitude within your body which is calm and straight and attentive. If you're slouching... the attitude of your body is don't call on me.\"\n\nHe referenced Patanjali's definition of asana: \"Sthira sukham asanam\"—steady and comfortable. \"Sthira means to be stable and steady. Sukha comes from ka which means space and su which means to easily enter into... So physically you're stable mentally expanded space of the mind.\"\n\nThis is achieved through \"shaithilya—a relaxed effort. You make effort but it's relaxed.\" The outcome is \"the transcendence of the pairs of opposites or the ability to withstand the ups and downs of life.\"\n\nMost importantly, asana develops \"awareness of the body. Many of us are not aware that we have bodies. We go through the day not thinking about our bodies all that much... It's only when our bodies start to cause us problems do we pay attention to them.\"\n\nSwami Sarvapriyananda added a crucial insight about this awareness: \"What you are aware of, that you are not... When I become aware of the body I also subtly the mind begins to grasp this idea that I am not this.\" This begins the process of disidentification while still caring for the instrument.\n\n#### Pranamaya Kosha: The Vital Body\n\nMoving to the breath, Swami Sarvapriyananda recommended Eddie's 12-class pranayama series available on Deepak Chopra's YouTube channel.\n\nEddie explained prana as \"bioelectricity—the electricity generated within our body within our physiology.\" He described the sinoatrial node in the heart where \"pacemaker cells propagate their own electrical impulse. If you take some of these cells out from your heart, put them in a petri dish, these cells will continue to beat because that's what they do.\"\n\nPrana flows through nadis (energy channels), which can develop blockages from mental disturbances. \"When there's a disturbance in the mind it disturbs the prana nadis. When the prana nadis are disturbed then it disturbs the flow of the breath. When it disturbs the flow of the breath then it disturbs the state of the body.\"\n\nPranayama directly accesses the nervous system: \"Slow breathing is going to turn those sympathetic hyperarousal signals. It's going to dampen them. And as they get dampened, then the parasympathetic or healing response naturally begins to arise.\" The resulting feelings of \"safety, equilibrium, calm, evenness, presence\" are essential for meditation.\n\n##### A Brief Pranayama Practice\n\nEddie led the audience through a simple practice:\n\n1. Sitting comfortably with backs against chairs\n2. Bringing awareness to the nostrils, feeling breath movement\n3. Deepening awareness into the nasal cavity near the sense of smell\n4. Imagining smelling a rose, lavender, or coffee\n5. \"As you inhale, you're savoring the scent of the rose. The breath naturally lengthens.\"\n6. \"As you exhale, keep your awareness right at the sense of smell in the nose.\"\n\nHe explained that this naturally leads to \"sukshma—fine, subtle, thin\" breathing rather than deep breathing. \"It's not deep breathing. It's slow regulated breathing.\"\n\nWhen Swami Sarvapriyananda asked why yogis practice breath retention, Eddie explained multiple benefits: controlling autonomic nervous system function, changing carbon dioxide tolerance, and potentially lengthening life (\"if we slow and reduce the amount of breathing that we actually do, we can lengthen and expand our life\"). He also noted scientific evidence that \"holding the breath out has a strong impact on the production of red blood cells in the spleen.\"\n\n#### Manomaya Kosha: The Mental Body\n\nMoving to the mind, Eddie discussed meditation from a Patanjalian perspective, referencing the sutra about abhyasa (practice) as \"the effort of remaining present.\" While fixed meditation times are helpful, \"from a Patanjalian point of view one of the hows of or when you meditate is continually always try to practice presence.\"\n\nHe offered a crucial reframing of how we understand mind and thoughts: \"Often when we think of the mind... someone's meditating and they might say I try to meditate but I have so many thoughts in my mind and how do I get these thoughts out of my mind... From a Patanjalian perspective... the idea of chitta is not that there are thoughts inside of the mind but the entire moving of the mind is where thoughts are coming from.\"\n\nUsing Swami Sarvapriyananda's ocean and waves analogy, he explained: \"The wave is non-different from the body of the ocean... A thought is not something happening in chitta. A thought is happening because of the movement of chitta.\" Therefore, \"in meditation you're working directly with chitta and not with thoughts happening in something but you're working with the whole field.\"\n\nThis understanding prevents giving \"primacy to thoughts because normally in meditation thoughts come up we give primacy to them thinking here's the problem. Thoughts aren't the problem. The problem is the movement of chitta. Why is it moving so much?\"\n\nEddie also shared the Sankhya/Yoga concept of cosmic mind: \"There is one mind and this one mind is the cosmic mind... This one cosmic mind is reflecting into all of the individuated minds. That's us... Meditation from this Patanjalian sense is to link our individual mind with the cosmic mind so that our chitta becomes calm from knowing that it's just a disturbance in the field and nothing that we need to really take personally.\"\n\n#### Vijnyanamaya Kosha: The Intellectual Body\n\nAt the level of philosophy and worldview, Eddie discussed the role of vikalpa (imagination or conceptualization) in spiritual practice. When we hear teachings like \"satyam jnanam anantam brahma\" (truth, knowledge, infinite is Brahman), \"we don't really know fully on an experiential level what is truth, what is consciousness, what is infinity. But the words give us this idea of something transcendent.\"\n\nThis creates \"aspiration—the flame behind our enthusiasm to seek to know to learn to expand.\" The yogic lifestyle requires \"courage... to face the demons that we have within us,\" good company, and practical disciplines like waking early and eating properly.\n\n##### The Gut-Brain Connection\n\nEddie highlighted the importance of diet for spiritual practice through the lens of modern science: \"In our gut we have about 100 million neurons... This nervous system contains the microbiome in it. And the microbiome is also a big regulator of mood.\" With \"20% of the serotonin in our body... produced in the enteric nervous system,\" what we eat directly affects our chemical composition and therefore our capacity for \"enthusiasm, aspiration, motivation, fearlessness in seeking.\"\n\nThe key is eating \"foods that are going to stimulate the right digestive capacities within you are going to strengthen the health of your gut microbiome and help to produce serotonin, signal to the brain to release dopamine... So this is a very important reason why we should eat well, eat whole foods as much as possible, eat at the right times and not overeat and avoid processed foods.\"\n\n## Audience Q&A\n\nThe conversation opened to audience questions, covering diverse topics from practical techniques to philosophical inquiries.\n\n### So Hum vs. Ham Sah\n\nOne practitioner noted conflicting instructions about the So Hum mantra—whether to mentally repeat \"So\" on inhalation and \"Hum\" on exhalation or vice versa. Swami Sarvapriyananda clarified that both come from authentic traditions—the former from Kashmir Shaivism's Vigyan Bhairav Tantra, the latter from certain Tantric traditions. \"The points of inflection are the same... But the hamsa is the natural one.\"\n\n### Yoga for Blood Pressure\n\nFor managing blood pressure, Eddie recommended:\n- **Sleep:** \"Getting enough sleep\"\n- **Diet:** \"Foods that are going to be easy to digest and low in salt... avoiding processed foods and too much sugar\"\n- **Aerobic exercise** to stimulate cardiovascular and respiratory systems\n- **Resonance breathing:** \"Breathing at a ratio where you're inhaling for 4 seconds and exhaling for six or inhaling for 5 seconds exhaling for five... breathing between five to six breaths per minute\"\n\nHe explained the physiological mechanism: \"The whole cycle from the heart to the baroreceptors to the brain and back down to the heart takes 10 seconds roughly. So if you're breathing along with that signaling, what happens is you line your respiratory pattern along with the cardiac cycle. And this supports homeostasis.\"\n\nEqually important is \"changing stress perception... Instead of getting stressed out, you think I can do this. I can handle this one by one. This is a growth opportunity... And you look at challenge as a growth opportunity.\"\n\n### When Do We Ask Life's Big Questions?\n\nA questioner wondered if profound suffering is necessary to prompt spiritual questioning. Eddie strongly disagreed, sharing how his high school English teacher, Jane Benditson, introduced him to Siddhartha and \"the three most important questions you can ask yourself in your life: who am I, what am I doing here, and what do I do next?\" when he was just 15-16.\n\n\"At that moment, bells went off in my head. And I was like, 'Finally, someone who's talking about something that matters.'\" This early questioning prevented midlife crises because \"we've actually been asking these questions for a long time and trying to live in adherence with them.\" He lamented that standard education often suppresses this innate curiosity rather than nurturing it.\n\n### Modern Medicine and Yogic Principles\n\nRegarding hormone replacement therapy and other medical interventions, Eddie took a balanced view: \"From a perspective of Patanjali, everything in this created universe is nature... All these things are created things and they can all be used in positive ways and they can be used in negative ways.\"\n\nWhile emphasizing lifestyle factors, he acknowledged: \"Medicine has a lot to offer to the world... I am very open to all the interventions that work that restore health and happiness and functionality to people and I don't discount them.\"\n\n### Transcendence and Personal Narrative\n\nA philosophy student questioned whether we simply exchange one narrative for another when pursuing transcendence. Eddie explained that in deep samadhi, \"the meditator disappears and all there is is that beingness or that consciousness.\" However, \"when you come out from the transcendent and you enter back into your personalized mind field, all of the samskaras that have not been evaporated will still be there.\"\n\nThe solution is progressive practice through different samadhis that gradually weed out samskaras until \"your only mental impression is of the non-rising of thought.\" He led a simple experiment: \"Breathe in a slow breath in and out. And then say to yourself, I wonder what my next thought will be.\" For most people, thought temporarily stops—demonstrating the possibility of thought-free awareness.\n\nSwami Sarvapriyananda added Ramana Maharshi's example: when asked what he was thinking about during long silences, another devotee correctly answered \"the Maharshi is not thinking about anything.\" He compared this to using instruments only when needed: \"Just because we have feet does it mean we'll continuously walk around? That's crazy... Similarly, just because we have a mind doesn't mean that we have to continuously think... The mind is a great servant and a terrible master.\"\n\n### Navigating Overwhelm in Modern Life\n\nA visitor from India struggling with New York's intensity received practical advice from both teachers. Eddie, a Manhattan native, suggested: \"Start off your day slowly... Make sure you have a little bit of a meditative beginning to the day... Something physical is good to do... Then during the day when you start to feel that things are going too quickly, take a moment to retreat... At the end of the day, try to do something to slow yourself down as well.\"\n\nSwami Sarvapriyananda offered \"Manhattan measures for not being overwhelmed\":\n1. **Slow down dramatically:** \"Instead of slamming that door, close that door for 5 minutes. Take five whole minutes to close that door. So slowly.\"\n2. **Breathe:** \"Do a whole set, maybe two, three minutes also, just one pranayama.\"\n\n## Conclusion: The End as a Beginning\n\nThe evening closed with Swami Sarvapriyananda expressing hope that \"this end is also a beginning\" for ongoing collaboration with Eddie Stern. Eddie invited everyone to continue the conversation at Broome Street Ganesha Temple, where Swami Sarvapriyananda would speak the following Thursday, with roles reversed.\n\nThe session concluded with a peace chant, leaving participants with both theoretical understanding and practical tools for integrating yoga's ancient wisdom with modern scientific understanding—particularly for regulating the nervous system in our overwhelming world.\n\nAs Eddie noted about New York's reputation as \"the city that never sleeps\": \"I noticed when I come back from Kolkata or Mumbai how quiet New York is.\" Perspective, awareness, and practice transform our experience of reality—from the cellular level to cosmic consciousness.\n\n---\n**Tags**: yoga, nervous system, stress reduction, wellness  \n**Category**: HEALTH",
      "string": "# Yoga and Science: Regulating the Nervous System\n\n## An Evening with Eddie Stern at the Vedanta Society of New York\n\n[Music]  \n[Laughter]  \n[Music]\n\nThe Vedanta Society of New York opened its fall season with a special visit from Eddie Stern, founder of Broome Street Ganesha Temple, Broome Street Yoga, the Breathing App, and the Yoga Education Collective. The evening began with warm welcomes and a sense of anticipation for what would become a deep exploration of yoga's intersection with modern science.\n\nEddie Stern, who has been practicing yoga since 1987 with extensive training in South India, brings a multidisciplinary approach that bridges traditional texts with scientific research, healthcare, technology, and collaboration. For the first part of the session, Eddie spoke for approximately 30 minutes on \"Classical Yoga and Modern Science,\" followed by a conversation with Swami Sarvapriyananda and a Q&A session.\n\n### A Personal Connection to the Vedanta Tradition\n\nBefore diving into the science, Eddie shared a heartfelt personal connection to the Ramakrishna Mission that few knew about. \"I have to admit I'm terrified to speak in front of Swami G and all of you,\" he began with characteristic humility, \"but that's how it goes.\"\n\nHe revealed that one of his early teachers, Lex Hixon, was a direct disciple of Swami Nikhilananda. \"I had received initiation in the Ramakrishna and Divine Mother mantras from Lex Hixon many, many, many years ago,\" Eddie shared. When he first traveled to India in 1988, Hixon advised him: \"When you reach India, the first thing you have to do is go to the Ramakrishna Mission wherever you are, and then go to every other single one that you can find along your travels, and you will be guided and protected.\"\n\nEddie followed this advice meticulously. \"I did exactly as he said, and I've been going to the missions ever since.\" He first visited the Vedanta Center in 1994, around the same time of year as this talk, and purchased a copy of the Devi Mahatmyam that he had been searching for. \"I have been reading that copy of the Devi Mahatmyam that I bought here right before the Navaratri festival started every year since 1994,\" he revealed, making this location particularly dear to his heart.\n\nHis connections deepened through studying Vedic chanting under Swami Yuktatmananda at the Ramakrishna Mission on 94th Street and learning from Swami Nityasthananda in Bangalore. \"My heart is very close to the Ramakrishna Mission and to Sri Ramakrishna and the Divine Mother and Vivekananda Ji,\" he expressed. \"So it's really a pleasure to be here.\"\n\n### The Intersection of Yoga and Science\n\nEddie began his formal talk by addressing the common tension between yoga traditionalists and scientific inquiry. \"We hear a lot these days about the scientific effects of yoga and the scientific benefits of yoga,\" he noted. \"People who are very diehard yoga enthusiasts say we don't need science to prove yoga. We already know that it works. And that's absolutely true. And then the people who are diehard yoga enthusiasts and also are scientists say it's true. We don't need it to prove that it works. We already know that it works. We're curious about why it might work and on what level does it work.\"\n\nHe emphasized that yoga has always been considered a science—\"yoga vidya,\" where vidya means a system of learning. \"It's a protoscience and it's an experiential science. One of the most important things about yoga is your direct perception of truth and clarifying your fields of perception so that you can see clearly and understand hopefully eventually who is the seer and what is being seen.\"\n\n### From Blood Pressure to GPA: Unexpected Research Findings\n\nEddie's entry into scientific research came unexpectedly about 12-14 years ago when researcher Marshall Hagins from Columbia University approached him. \"He wanted to do a study on if yoga could help African-Americans with prehypertensive conditions lower their blood pressure.\" At that time, Eddie knew \"zero about science\"—he had never attended college, going straight from high school to India.\n\nDespite this, he designed a protocol that seemed \"kind of relaxing for people.\" The two-year NIH-funded study involved about 120 participants and yielded significant results: \"Sleeping blood pressure lowered and the waking blood pressure also lowered especially for the diastolic blood pressure. In fact, it was statistically significant to the same level of statins.\"\n\nFrom there, they conducted another study with high school students on Manhattan's Lower East Side at a Title I school where 95% of students received free lunch and breakfast. Comparing 40 yoga classes against 40 physical education classes, they found that \"the youngsters who had 40 yoga classes their grade point average went up 2.7% in comparison to the gym class. This brings you from a D to a C. It brings you from a C to a B if you're in the right threshold.\"\n\n### The Nervous System Connection\n\nWhat struck Eddie was that the protocols for these radically different groups weren't substantially different. \"I was basically using the same poses, basically using the same breathing, basically using the same relaxation. There wasn't all that much that was different.\" This led him to a crucial insight: \"My intuition was that it was basically because of the nervous system and that the nervous system when it becomes regulated knows what it needs to fix and knows what needs to come into place.\"\n\nThis realization launched him into deeper studies of physiology and the nervous system, exploring how yogis might have been using these practices specifically for nervous system regulation.\n\n### The Five Kleshas: Why We Suffer\n\nEddie focused particularly on Patanjali's concept of the kleshas—the five obstacles to self-knowledge discussed primarily in the second chapter of the Yoga Sutras. He guided the audience through each klesha with remarkable clarity:\n\n**1. Avidya** - \"An absence of a true knowledge of who we are.\" Eddie explained that while we have partial knowledge of our relative identity (\"My name is Eddie. I seem to be a yoga teacher although that's questionable. And I seem to not have hair\"), we lack knowledge of our absolute nature as consciousness, awareness, and infinite being.\n\nHe referenced the opening hymn from the Taittiriya Upanishad: \"The self exists within the cave of the heart is the expanse of the infinite.\" The experience of this is \"satyam (truth), jnanam (knowledge), and anantam (infinite unlimited being).\"\n\n**2. Asmita** - When we don't know who we truly are, \"we create some narratives, we create some stories.\" Our relative identity—name, form, occupation, family, genealogy, history, traumas, successes—\"become the narrative of my personality and I start to identify with them.\" This narrative construction begins almost immediately after birth and is based on two fundamental things.\n\n**3. Raga and Dvesha** - Attachment to things we like and aversion to things we dislike. \"I like vegetarian food. I like to listen to punk rock music. I like modern art. I love yoga. I love studying Vedanta. I love studying Sankhya,\" Eddie offered as examples. \"I don't like right-wing fundamentalism. I don't like suffering and sickness and pain and injustice.\" Even simpler preferences: \"I like coffee. I don't like matcha. I like pasta with spicy tomato sauce but I don't really like pasta with lemon on top of it so don't feed me that.\"\n\n**4. Abhinivesha** - The clinging to life and fear of death. \"If all of my likes and dislikes and all of my narrative were pulled out from underneath me like a rug, who would I be? And that's a terrifying proposition... The fear that comes along with that is a fear of extinction, a fear of not existing. And that is also called the fear of death.\"\n\n### The Yogic Solution: Kriya Yoga\n\nPatanjali prescribes kriya yoga—the yoga of action—consisting of three components:\n\n**Tapas** - Often translated as austerity, but Eddie preferred Sri Krishnamacharya's definition as \"ripening.\" \"If you think of a fruit on a tree, it needs the heat of the sun and it needs the soil and of course the tree and the wind and the rain and the change of seasons and all of these things to slowly slowly slowly ripen this fruit until it's ready to just fall from the tree or be easily plucked from the tree to be enjoyed.\" Overdoing practices can cause harm, while the right amount of effort leads to natural ripening.\n\n**Svadhyaya** - The repetition of mantras and self-study. \"The Vedic mantras are all related to the idea of svaha of self. Who am I? What am I doing here? What is my purpose? How do I engage in the world?\" This practice turns our awareness inward for self-examination.\n\n**Ishvara Pranidhana** - Surrender to the divine or to the unknown. \"A letting go of the narratives that we have in order to experience something expanded or beyond ourselves.\"\n\nThese three practices \"weaken the kleshas and prepare us for samadhi,\" the eighth limb of yoga involving cognitive absorption.\n\n### The Physiological Mechanism: Regulating the Brain Stem\n\nThe crucial question Eddie posed: \"How is it that standing on our head or doing a sun salutation or doing a triangle pose or breathing in through one nostril, how is this going to begin to diminish any of these kleshas?\"\n\nThe answer lies in the physiological perspective, particularly regarding abhinivesha—the clinging to life. \"Where in our body do we cling to life? It is the absolute job of our brain stem to cling to life.\" He detailed the brain stem's survival functions: breathing, heartbeat, blood pressure regulation, sleep, digestion, reproduction, and body temperature adjustment.\n\n\"The yogis did asanas, they did pranayama, they did mitahara (regulation of food), they did regulation of sleep, they did regulation of sexuality, and they did regulation of temperature by different types of tapas.\" Essentially, all the primary brain stem functions correspond to yogic practices designed to control these autonomic nervous system processes.\n\n\"When you start to willfully and consciously regulate your blood pressure, stop your breathing for a little while, slow the heart rate, go without food for periods of time without suffering, what happens is you're overriding signals in your brain stem.\" The first time you try to hold your breath, your body panics, but with practice, \"the operations of the brain stem begin to shift and they stop trying to run the show, but they start to adapt to what the yogi is doing in a very conscious and deliberate and slow manner to shift autonomic nervous system function.\"\n\n### The Domino Effect: From Brain Stem to Emotional Centers\n\nAs breathing comes under conscious control and slows, \"this idea of clinging to life through breathing begins to diminish. You stop losing the fear of holding on to breath of holding on to these things.\" This directly affects abhinivesha, which is \"associated with the brain stem functions and brain stem information flows.\"\n\nThe changes then ripple through other brain regions: \"As our fear begins to lessen, it changes things that are happening in the fear structures of our brain, the amygdalas, which are in the limbic system, the emotional centers.\" Signals of safety, calm, and equilibrium spread through the brain networks.\n\nThis emotional regulation enables deeper self-reflection. \"It's very difficult to self-reflect on an intellectual level because when we do self-reflection on the intellectual level, we usually think we're pretty good.\" True self-honesty happens at the limbic level: \"Am I being honest with myself? Am I being really true about how I behave in the world? About how I treat other people? About how I'm attending to my spiritual life? You know, is it just lip service or am I really really doing it?\"\n\n### The Path to Humility and Devotion\n\nThis emotional honesty expands to the prefrontal cortex, enabling surrender, devotion, and humility. \"Humility comes along with acknowledging where our flaws are. Humility doesn't come from bowing down in front of a god or bowing down in front of the saints or in a temple. It comes from feeling these are the places where I've really gone awry and here are the things I need to work on and I can't do it on my own.\"\n\nThis humility leads to \"devotion to this idea of I can't do it all on my own steam. I need to let go. I need to merge my mind into the source.\"\n\n### Science's Role in Understanding Relative Reality\n\nEddie concluded by clarifying science's proper domain: \"Modern science can look at all of these different levels\"—referring to the pancha koshas (five sheaths) of the Taittiriya Upanishad: \"the physical body, the pranamayakosha (the nervous system body), the manomayakosha (the mind body), and the vijnyanamayakosha (the intellectual body).\"\n\n\"Modern science is very good at studying our relative existence. It's not good at studying the absolute reality because that can't be studied. But it's extremely good and getting better at studying the relative reality.\" The purpose of modern science in yoga is \"to help us be healthy, to understand mechanisms, and apply those mechanisms for the best possible outcomes.\"\n\n## Conversation with Swami Sarvapriyananda\n\nSwami Sarvapriyananda began by expressing profound gratitude to Eddie for inaugurating their fall session. He highlighted Eddie's central role in New York's yoga scene: \"Today if you want to know yoga, New York is a hot hot spot for yoga in the world today and in New York you want to know more about yoga you google it Eddie's name will come up. So he's central to yoga in the 21st century and here especially in New York.\"\n\nHe placed Eddie within the influential \"Mysore school\" lineage of Krishnamacharya, B.K.S. Iyengar, Pattabhi Jois, while also connecting him to Swami Vivekananda, who wrote the first Vedanta Society publication—a commentary on Patanjali's Yoga Sutras—in 1895.\n\n### The Practical Journey Through the Five Koshas\n\nFollowing Eddie's framework of the Taittiriya Upanishad's pancha kosha (five sheaths), Swami Sarvapriyananda guided a practical exploration of what yoga does at each level.\n\n#### Annamaya Kosha: The Physical Body\n\nStarting with the physical body, Swami Sarvapriyananda quoted Swami Pavitrananda: \"Don't abuse the horse you cannot dismount from.\" While we are not the body, \"as long as it seems quite obvious to me that the body is there and I am the body,\" we must care for it properly.\n\nHe asked Eddie about posture's spiritual significance. Eddie explained: \"One nice definition of posture is the attitude of your body. If you're sitting up straight and you're calm, there's an attitude within your body which is calm and straight and attentive. If you're slouching... the attitude of your body is don't call on me.\"\n\nHe referenced Patanjali's definition of asana: \"Sthira sukham asanam\"—steady and comfortable. \"Sthira means to be stable and steady. Sukha comes from ka which means space and su which means to easily enter into... So physically you're stable mentally expanded space of the mind.\"\n\nThis is achieved through \"shaithilya—a relaxed effort. You make effort but it's relaxed.\" The outcome is \"the transcendence of the pairs of opposites or the ability to withstand the ups and downs of life.\"\n\nMost importantly, asana develops \"awareness of the body. Many of us are not aware that we have bodies. We go through the day not thinking about our bodies all that much... It's only when our bodies start to cause us problems do we pay attention to them.\"\n\nSwami Sarvapriyananda added a crucial insight about this awareness: \"What you are aware of, that you are not... When I become aware of the body I also subtly the mind begins to grasp this idea that I am not this.\" This begins the process of disidentification while still caring for the instrument.\n\n#### Pranamaya Kosha: The Vital Body\n\nMoving to the breath, Swami Sarvapriyananda recommended Eddie's 12-class pranayama series available on Deepak Chopra's YouTube channel.\n\nEddie explained prana as \"bioelectricity—the electricity generated within our body within our physiology.\" He described the sinoatrial node in the heart where \"pacemaker cells propagate their own electrical impulse. If you take some of these cells out from your heart, put them in a petri dish, these cells will continue to beat because that's what they do.\"\n\nPrana flows through nadis (energy channels), which can develop blockages from mental disturbances. \"When there's a disturbance in the mind it disturbs the prana nadis. When the prana nadis are disturbed then it disturbs the flow of the breath. When it disturbs the flow of the breath then it disturbs the state of the body.\"\n\nPranayama directly accesses the nervous system: \"Slow breathing is going to turn those sympathetic hyperarousal signals. It's going to dampen them. And as they get dampened, then the parasympathetic or healing response naturally begins to arise.\" The resulting feelings of \"safety, equilibrium, calm, evenness, presence\" are essential for meditation.\n\n##### A Brief Pranayama Practice\n\nEddie led the audience through a simple practice:\n\n1. Sitting comfortably with backs against chairs\n2. Bringing awareness to the nostrils, feeling breath movement\n3. Deepening awareness into the nasal cavity near the sense of smell\n4. Imagining smelling a rose, lavender, or coffee\n5. \"As you inhale, you're savoring the scent of the rose. The breath naturally lengthens.\"\n6. \"As you exhale, keep your awareness right at the sense of smell in the nose.\"\n\nHe explained that this naturally leads to \"sukshma—fine, subtle, thin\" breathing rather than deep breathing. \"It's not deep breathing. It's slow regulated breathing.\"\n\nWhen Swami Sarvapriyananda asked why yogis practice breath retention, Eddie explained multiple benefits: controlling autonomic nervous system function, changing carbon dioxide tolerance, and potentially lengthening life (\"if we slow and reduce the amount of breathing that we actually do, we can lengthen and expand our life\"). He also noted scientific evidence that \"holding the breath out has a strong impact on the production of red blood cells in the spleen.\"\n\n#### Manomaya Kosha: The Mental Body\n\nMoving to the mind, Eddie discussed meditation from a Patanjalian perspective, referencing the sutra about abhyasa (practice) as \"the effort of remaining present.\" While fixed meditation times are helpful, \"from a Patanjalian point of view one of the hows of or when you meditate is continually always try to practice presence.\"\n\nHe offered a crucial reframing of how we understand mind and thoughts: \"Often when we think of the mind... someone's meditating and they might say I try to meditate but I have so many thoughts in my mind and how do I get these thoughts out of my mind... From a Patanjalian perspective... the idea of chitta is not that there are thoughts inside of the mind but the entire moving of the mind is where thoughts are coming from.\"\n\nUsing Swami Sarvapriyananda's ocean and waves analogy, he explained: \"The wave is non-different from the body of the ocean... A thought is not something happening in chitta. A thought is happening because of the movement of chitta.\" Therefore, \"in meditation you're working directly with chitta and not with thoughts happening in something but you're working with the whole field.\"\n\nThis understanding prevents giving \"primacy to thoughts because normally in meditation thoughts come up we give primacy to them thinking here's the problem. Thoughts aren't the problem. The problem is the movement of chitta. Why is it moving so much?\"\n\nEddie also shared the Sankhya/Yoga concept of cosmic mind: \"There is one mind and this one mind is the cosmic mind... This one cosmic mind is reflecting into all of the individuated minds. That's us... Meditation from this Patanjalian sense is to link our individual mind with the cosmic mind so that our chitta becomes calm from knowing that it's just a disturbance in the field and nothing that we need to really take personally.\"\n\n#### Vijnyanamaya Kosha: The Intellectual Body\n\nAt the level of philosophy and worldview, Eddie discussed the role of vikalpa (imagination or conceptualization) in spiritual practice. When we hear teachings like \"satyam jnanam anantam brahma\" (truth, knowledge, infinite is Brahman), \"we don't really know fully on an experiential level what is truth, what is consciousness, what is infinity. But the words give us this idea of something transcendent.\"\n\nThis creates \"aspiration—the flame behind our enthusiasm to seek to know to learn to expand.\" The yogic lifestyle requires \"courage... to face the demons that we have within us,\" good company, and practical disciplines like waking early and eating properly.\n\n##### The Gut-Brain Connection\n\nEddie highlighted the importance of diet for spiritual practice through the lens of modern science: \"In our gut we have about 100 million neurons... This nervous system contains the microbiome in it. And the microbiome is also a big regulator of mood.\" With \"20% of the serotonin in our body... produced in the enteric nervous system,\" what we eat directly affects our chemical composition and therefore our capacity for \"enthusiasm, aspiration, motivation, fearlessness in seeking.\"\n\nThe key is eating \"foods that are going to stimulate the right digestive capacities within you are going to strengthen the health of your gut microbiome and help to produce serotonin, signal to the brain to release dopamine... So this is a very important reason why we should eat well, eat whole foods as much as possible, eat at the right times and not overeat and avoid processed foods.\"\n\n## Audience Q&A\n\nThe conversation opened to audience questions, covering diverse topics from practical techniques to philosophical inquiries.\n\n### So Hum vs. Ham Sah\n\nOne practitioner noted conflicting instructions about the So Hum mantra—whether to mentally repeat \"So\" on inhalation and \"Hum\" on exhalation or vice versa. Swami Sarvapriyananda clarified that both come from authentic traditions—the former from Kashmir Shaivism's Vigyan Bhairav Tantra, the latter from certain Tantric traditions. \"The points of inflection are the same... But the hamsa is the natural one.\"\n\n### Yoga for Blood Pressure\n\nFor managing blood pressure, Eddie recommended:\n- **Sleep:** \"Getting enough sleep\"\n- **Diet:** \"Foods that are going to be easy to digest and low in salt... avoiding processed foods and too much sugar\"\n- **Aerobic exercise** to stimulate cardiovascular and respiratory systems\n- **Resonance breathing:** \"Breathing at a ratio where you're inhaling for 4 seconds and exhaling for six or inhaling for 5 seconds exhaling for five... breathing between five to six breaths per minute\"\n\nHe explained the physiological mechanism: \"The whole cycle from the heart to the baroreceptors to the brain and back down to the heart takes 10 seconds roughly. So if you're breathing along with that signaling, what happens is you line your respiratory pattern along with the cardiac cycle. And this supports homeostasis.\"\n\nEqually important is \"changing stress perception... Instead of getting stressed out, you think I can do this. I can handle this one by one. This is a growth opportunity... And you look at challenge as a growth opportunity.\"\n\n### When Do We Ask Life's Big Questions?\n\nA questioner wondered if profound suffering is necessary to prompt spiritual questioning. Eddie strongly disagreed, sharing how his high school English teacher, Jane Benditson, introduced him to Siddhartha and \"the three most important questions you can ask yourself in your life: who am I, what am I doing here, and what do I do next?\" when he was just 15-16.\n\n\"At that moment, bells went off in my head. And I was like, 'Finally, someone who's talking about something that matters.'\" This early questioning prevented midlife crises because \"we've actually been asking these questions for a long time and trying to live in adherence with them.\" He lamented that standard education often suppresses this innate curiosity rather than nurturing it.\n\n### Modern Medicine and Yogic Principles\n\nRegarding hormone replacement therapy and other medical interventions, Eddie took a balanced view: \"From a perspective of Patanjali, everything in this created universe is nature... All these things are created things and they can all be used in positive ways and they can be used in negative ways.\"\n\nWhile emphasizing lifestyle factors, he acknowledged: \"Medicine has a lot to offer to the world... I am very open to all the interventions that work that restore health and happiness and functionality to people and I don't discount them.\"\n\n### Transcendence and Personal Narrative\n\nA philosophy student questioned whether we simply exchange one narrative for another when pursuing transcendence. Eddie explained that in deep samadhi, \"the meditator disappears and all there is is that beingness or that consciousness.\" However, \"when you come out from the transcendent and you enter back into your personalized mind field, all of the samskaras that have not been evaporated will still be there.\"\n\nThe solution is progressive practice through different samadhis that gradually weed out samskaras until \"your only mental impression is of the non-rising of thought.\" He led a simple experiment: \"Breathe in a slow breath in and out. And then say to yourself, I wonder what my next thought will be.\" For most people, thought temporarily stops—demonstrating the possibility of thought-free awareness.\n\nSwami Sarvapriyananda added Ramana Maharshi's example: when asked what he was thinking about during long silences, another devotee correctly answered \"the Maharshi is not thinking about anything.\" He compared this to using instruments only when needed: \"Just because we have feet does it mean we'll continuously walk around? That's crazy... Similarly, just because we have a mind doesn't mean that we have to continuously think... The mind is a great servant and a terrible master.\"\n\n### Navigating Overwhelm in Modern Life\n\nA visitor from India struggling with New York's intensity received practical advice from both teachers. Eddie, a Manhattan native, suggested: \"Start off your day slowly... Make sure you have a little bit of a meditative beginning to the day... Something physical is good to do... Then during the day when you start to feel that things are going too quickly, take a moment to retreat... At the end of the day, try to do something to slow yourself down as well.\"\n\nSwami Sarvapriyananda offered \"Manhattan measures for not being overwhelmed\":\n1. **Slow down dramatically:** \"Instead of slamming that door, close that door for 5 minutes. Take five whole minutes to close that door. So slowly.\"\n2. **Breathe:** \"Do a whole set, maybe two, three minutes also, just one pranayama.\"\n\n## Conclusion: The End as a Beginning\n\nThe evening closed with Swami Sarvapriyananda expressing hope that \"this end is also a beginning\" for ongoing collaboration with Eddie Stern. Eddie invited everyone to continue the conversation at Broome Street Ganesha Temple, where Swami Sarvapriyananda would speak the following Thursday, with roles reversed.\n\nThe session concluded with a peace chant, leaving participants with both theoretical understanding and practical tools for integrating yoga's ancient wisdom with modern scientific understanding—particularly for regulating the nervous system in our overwhelming world.\n\nAs Eddie noted about New York's reputation as \"the city that never sleeps\": \"I noticed when I come back from Kolkata or Mumbai how quiet New York is.\" Perspective, awareness, and practice transform our experience of reality—from the cellular level to cosmic consciousness.\n\n---\n**Tags**: yoga, nervous system, stress reduction, wellness  \n**Category**: HEALTH"
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-10-10T02:15:00.767243+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-10-10T02:18:12.959920+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-10-10T02:59:55.678011+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}