{
  "id": "310cd964-2519-40c5-b408-91594243cb08",
  "external_id": "q0aFOxT6TNw",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-09-26T21:00:43+00:00",
  "created_at": "2025-09-27T05:48:48.606211+00:00",
  "updated_at": "2025-09-27T06:05:34.157319+00:00",
  "reading_time_seconds": 645,
  "category": {
    "category": "TECHNOLOGY",
    "shelf_life": "MONTH",
    "geography": null
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "iPhone 17 Pro Review: A Thicker, More Capable Powerhouse"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "The iPhone 17 Pro embraces a thicker, all-metal unibody design, allowing for significant internal upgrades. It features a larger battery, a vapor chamber for improved cooling, and a more capable camera system, including a new 48MP telephoto lens. The A19 Pro chip and enhanced thermal management deliver sustained performance for gaming and video recording. While the design is a departure, it enables features that benefit both professionals and general users, making it the most powerful and mainstream iPhone yet. The review also notes the absence of a black color option and discusses the durability of the new anodized aluminum finish."
    },
    "MEDIUM": {
      "markdown_string": "# iPhone 17 Pro Review: A Thicker, More Capable Powerhouse\n\nThe best thing about the iPhone Air is that it gave Apple the freedom to make the Pro phone even more of a Pro phone. And with the iPhone 17 Pro, they’ve done exactly that.\n\n## A Noticeably Thicker, More \"Maximalist\" iPhone\n\nHave you noticed these new Pro phones are thicker than last year's models? That extra girth isn't for show. Inside, there's room for a larger battery, a vapor chamber for cooling, and bigger camera hardware. It's not quite at the level of an \"Ultra\" phone, but this is the most maximalist iPhone to date—and I love it.\n\nBut here's a not-so-secret secret: the Pro phone is always the best-selling phone. This year, the iPhone Air is the most interesting, garnering the most YouTube clicks and views, but the base iPhone 17 is what most people should buy—it's the best deal. Yet, when it comes to sales numbers, the Pro Max is by far the most popular product.\n\nHow do we know? Take channel sponsor dbrand, for example. They make accessories for every single iPhone model, and their sales distribution mirrors Apple's. This year, over half of their sales are for the Pro Max. And between both Pro models, they account for about 90% of orders. So yes, it's fascinating to watch Apple walk the line between making the Pro phone more \"Pro\" than ever with this extreme new design, while it simultaneously remains the most mainstream phone of all time.\n\n## The Cameras: More Pro Than Ever\n\nLet's start with the cameras, as they are the most \"Pro\" aspect of the Pro iPhone every year. On one hand, no professional is saying, \"Oh thank god, my smartphone now has eight lenses,\" which is the vibe Apple sometimes seems to want us to believe. It clearly has three cameras, but the three cameras you get are more similar than ever before.\n\nThe primary and ultra-wide cameras are basically unchanged from last year, but the telephoto camera gets a big update. It now features a 48-megapixel sensor with a 4x telephoto lens. Last year's had a 5x lens, but only at 12 megapixels. This new camera feels like a more natural portrait focal length (equivalent to about 100mm), and your zoom shots will have much more detail and far less noise thanks to the larger, higher-resolution sensor.\n\nI also have to give them credit for the specific 2x zoom enhancement. While it's not a new lens, they specially process every image shot in the 2x crop to look a bit sharper and better than a pure digital crop from the center of the sensor. It's not the level of pure optical zoom, but it's better than nothing. Honestly, I don't know why they only do this for these specific focal lengths. Regardless, it's now a really good overall package.\n\nYou have three reliable 48-megapixel cameras that are just as good for casual shooters as they are for people who rely on their iPhone for work—or for those with an entire YouTube channel about cars that they shoot on a smartphone. (Yes, an Electric G-Wagon review shot on autofocus with the iPhone 17 Pro is coming very soon.)\n\nThat said, I still wish they had made some other improvements, like fixing the point-light flare issue when shooting in the dark, which they haven't addressed at all. Or adding 8K video support. With a 2TB iPhone model now available, 8K video feels like it's just a switch away, but it's not happening this year. But compared to older Pro phones like the 13 Pro and 14 Pro, the changes over the last few years have been significant. It's not a massive leap from last year, but it's good.\n\nPlus, what you're seeing right now is iPhone 17 Pro ProRes RAW footage, which I was particularly excited about because it means I can go into the new Final Cut Pro 11.2 and literally change the ISO and white balance after shooting, which is incredibly useful (even if the file sizes are enormous).\n\nAnother pro feature they've added, which they can't really brand because \"Pro\" is already taken, is Genlock support. This basically lets devices talk to each other to stay in sync on large multi-device shoots. Very slick. And the selfie cameras are more Pro than ever, too (more on that in the base 17 review). There's a lot going on with the cameras.\n\nBut the truth is, 95% of the people buying these phones just want to point and shoot, and these phones are more capable and reliable at that task than ever. If you want a more in-depth look at shooting professionally with this camera, check out Tyler Stalman's review (linked below)—it's incredibly thorough and he shot the entire film on an iPhone.\n\n## The Design: Embracing Thickness\n\nHowever, my favorite thing about this new Pro iPhone is actually its new design. It's not often that the latest iPhone gets noticeably thicker and heavier. But as I said, I think the best thing they did was introduce a separate phone, the Air, that's super thin. So if you want a thin phone, get the Air. But if you don't care, if it's not one of your top priorities, then here's the new Pro, which goes in the other direction and isn't afraid of a few extra fractions of an inch.\n\nI love that it's a full unibody metal jacket. This is not a glass sandwich. Literally, the entire body of the phone is now metal, with glass cutouts on the back for wireless charging and millimeter-wave antennae up top. This makes it more durable and creates more room inside for a bigger battery (more on that shortly) and, for the first time in an iPhone, enough space for a vapor chamber.\n\nAnd then there's the new plateau on top. I actually think this is awesome. It's where I've been resting my index finger on Android phones for years; it's a natural resting place for holding the phone. It's the same with this. Also, if you haven't heard, Corning's Ceramic Shield on the front glass is apparently great for preventing scratches.\n\nThere are a couple of small nitpicks, though. No black color. *Pro phone*. You're crazy. This feels like one of those weird things Apple does just to mess with me, where they make a bunch of products that should have a black version but don't. Like the new MacBook Air comes in Silver, Starlight, Sky Blue, and Deep Blue, but not black. And the AirPods Max refresh comes in a bunch of colors and Deep Blue, but not black. We need that deep, neutral color, especially because the color you choose is actually visible around the front bezel of the phone, so you see the color you picked all the time. This makes the Orange and Silver colors even more annoying to me. I told you it was a small thing.\n\nYou've also probably heard about the \"scratch gate\" discussion, regarding how easily the anodization layer on the aluminum scratches through to reveal the raw silver aluminum underneath. I don't yet know what to make of it; it feels like a problem that has existed with many dark-anodized aluminum phones before. As someone who uses a phone without a case, I haven't had an issue with the unit I've been using—I've been throwing it around. But the JerryRigEverything test showed that the weakest spot where you might get a scuff or scratch is around the tightest corner radii, like around the camera plateau. We'll see how many phones this affects.\n\n## The Internals: Power and Cooling\n\nBut we have to talk about what's inside this phone because the new design is one thing, but there's a lot more going on under the surface. The A19 Pro chip is, shockingly, great. It's about 20% faster than the previous generation. And now paired with iOS 26 and 12GB of RAM, these phones feel incredibly fast and snappy, which is great.\n\nBut the extra thickness has also made room for a vapor chamber for the first time, and it has made a real difference in this phone's thermal behavior and performance. A huge thanks to HDX Studios on YouTube, who was able to put thermal cameras on these phones under load and actually visualize it. But especially compared to the Air, these phones rarely even felt warm to the touch for me. As a result, they were able to sustain higher frame rates for longer during gaming and maintain display brightness for longer when recording video.\n\nBy the way, watch the rest of his video; it's incredibly well done. But it also reminded me why gaming phones in the Android world have a similar effect. The things that make a gaming phone really good—like better speakers, better performance, a better screen, and a bigger battery—are also awesome for regular use. And that's the same deal with the Pro iPhone. The things that make a Pro iPhone really good—like a better display, better cameras, a thicker, better build with better cooling for longer video shoots and better sustained performance—turns out, people buying the iPhone 17 Pro Max also enjoy a really good screen, camera, and battery. Go figure.\n\n## The Battery: Finally, Bigger is Better\n\nWe've all been saying for years: just make a thicker phone and put a bigger battery in it. I really feel like this is another place where, by focusing on making the iPhone Air super thin, they feel free to go completely in the other direction with the other phones. Because if they're claiming the iPhone Air's battery lasts all day, that's great. Every other phone in this lineup is getting thicker with bigger batteries.\n\nThus, the 17 Pro has a 20% larger battery than last year's model. And the Pro Max has actually crossed the 5,000 mAh threshold for the first time, which is a big deal in the iPhone world. And now there's 40-watt charging, too. So, half the battery in 20 minutes. This is a huge deal for Apple. We'll take a 20% improvement year over year.\n\nNow, in the Android world, obviously, this looks like nothing. It's not even close to the ultra phones with 6,000 mAh silicon-carbon batteries and 100-watt charging, etc. But for a phone that comes in the same volume as an iPhone, it's great to see this kind of improvement, especially when last year's phone already had very good battery life. The iPhone is also very efficient. I'm getting over five hours of screen-on time every day on the Pro Max, and it ends the day with over 30% left. I love it.\n\n## The Little Things\n\nThere are a bunch of other small things, too. With this screen, I believe this is the first generation of iPhone with a toggle for PWM dimming. It's buried in the accessibility settings, but you can search for it and find it—a very welcome addition for many people. It also has a slightly noticeable, but better-than-nothing, anti-reflective coating. More importantly, the display is now a bit brighter; I've seen it peak at up to 3,000 nits. And satellite connectivity has been expanded to include sending messages and sharing location, which is useful.\n\n## The Paradox: More Pro is Better for Everyone\n\nSo, the paradox is that making the Pro iPhone more Pro actually makes it better for the general public. And this is the best one yet. It's the most unshackled it's ever been. And I think, you know, when they eventually make an iPhone Ultra at some point, I'll probably still want all of this. But for now, this is good.\n\n***\n\n*If you're thinking of picking up an iPhone 17 but are worried about the scratches, channel sponsor dbrand has some options for you, like this Grip case (I have it in matte black), which also does a great job of hiding that plateau—the weakest spot for the anodization to chip, if you've seen Zack's durability test. Alternatively, if you're a clear case person, you can grab one of their Ghost cases, which comes with a lifetime zero-yellowing guarantee and features full camera protection. Fun fact: these are now also available at Best Buy in the US. Both cases have all the features you want in an iPhone case, like strong MagSafe and a camera control button, but most importantly, they're both extremely protective. And whichever route you go, if you want to complete your protection with a screen protector, you can also choose one of dbrand's Prism protectors. They're very easy to install. And if you bundle it with a Grip or Ghost case, you can use code MKBHD at checkout to save 42% on the Prism. Great deal. I'm leaving a link below so you can check them all out.*\n\n*Thanks for watching. Catch you guys very soon. Next up, still in TechTember. Peace.*",
      "string": "# iPhone 17 Pro Review: A Thicker, More Capable Powerhouse\n\nThe best thing about the iPhone Air is that it gave Apple the freedom to make the Pro phone even more of a Pro phone. And with the iPhone 17 Pro, they’ve done exactly that.\n\n## A Noticeably Thicker, More \"Maximalist\" iPhone\n\nHave you noticed these new Pro phones are thicker than last year's models? That extra girth isn't for show. Inside, there's room for a larger battery, a vapor chamber for cooling, and bigger camera hardware. It's not quite at the level of an \"Ultra\" phone, but this is the most maximalist iPhone to date—and I love it.\n\nBut here's a not-so-secret secret: the Pro phone is always the best-selling phone. This year, the iPhone Air is the most interesting, garnering the most YouTube clicks and views, but the base iPhone 17 is what most people should buy—it's the best deal. Yet, when it comes to sales numbers, the Pro Max is by far the most popular product.\n\nHow do we know? Take channel sponsor dbrand, for example. They make accessories for every single iPhone model, and their sales distribution mirrors Apple's. This year, over half of their sales are for the Pro Max. And between both Pro models, they account for about 90% of orders. So yes, it's fascinating to watch Apple walk the line between making the Pro phone more \"Pro\" than ever with this extreme new design, while it simultaneously remains the most mainstream phone of all time.\n\n## The Cameras: More Pro Than Ever\n\nLet's start with the cameras, as they are the most \"Pro\" aspect of the Pro iPhone every year. On one hand, no professional is saying, \"Oh thank god, my smartphone now has eight lenses,\" which is the vibe Apple sometimes seems to want us to believe. It clearly has three cameras, but the three cameras you get are more similar than ever before.\n\nThe primary and ultra-wide cameras are basically unchanged from last year, but the telephoto camera gets a big update. It now features a 48-megapixel sensor with a 4x telephoto lens. Last year's had a 5x lens, but only at 12 megapixels. This new camera feels like a more natural portrait focal length (equivalent to about 100mm), and your zoom shots will have much more detail and far less noise thanks to the larger, higher-resolution sensor.\n\nI also have to give them credit for the specific 2x zoom enhancement. While it's not a new lens, they specially process every image shot in the 2x crop to look a bit sharper and better than a pure digital crop from the center of the sensor. It's not the level of pure optical zoom, but it's better than nothing. Honestly, I don't know why they only do this for these specific focal lengths. Regardless, it's now a really good overall package.\n\nYou have three reliable 48-megapixel cameras that are just as good for casual shooters as they are for people who rely on their iPhone for work—or for those with an entire YouTube channel about cars that they shoot on a smartphone. (Yes, an Electric G-Wagon review shot on autofocus with the iPhone 17 Pro is coming very soon.)\n\nThat said, I still wish they had made some other improvements, like fixing the point-light flare issue when shooting in the dark, which they haven't addressed at all. Or adding 8K video support. With a 2TB iPhone model now available, 8K video feels like it's just a switch away, but it's not happening this year. But compared to older Pro phones like the 13 Pro and 14 Pro, the changes over the last few years have been significant. It's not a massive leap from last year, but it's good.\n\nPlus, what you're seeing right now is iPhone 17 Pro ProRes RAW footage, which I was particularly excited about because it means I can go into the new Final Cut Pro 11.2 and literally change the ISO and white balance after shooting, which is incredibly useful (even if the file sizes are enormous).\n\nAnother pro feature they've added, which they can't really brand because \"Pro\" is already taken, is Genlock support. This basically lets devices talk to each other to stay in sync on large multi-device shoots. Very slick. And the selfie cameras are more Pro than ever, too (more on that in the base 17 review). There's a lot going on with the cameras.\n\nBut the truth is, 95% of the people buying these phones just want to point and shoot, and these phones are more capable and reliable at that task than ever. If you want a more in-depth look at shooting professionally with this camera, check out Tyler Stalman's review (linked below)—it's incredibly thorough and he shot the entire film on an iPhone.\n\n## The Design: Embracing Thickness\n\nHowever, my favorite thing about this new Pro iPhone is actually its new design. It's not often that the latest iPhone gets noticeably thicker and heavier. But as I said, I think the best thing they did was introduce a separate phone, the Air, that's super thin. So if you want a thin phone, get the Air. But if you don't care, if it's not one of your top priorities, then here's the new Pro, which goes in the other direction and isn't afraid of a few extra fractions of an inch.\n\nI love that it's a full unibody metal jacket. This is not a glass sandwich. Literally, the entire body of the phone is now metal, with glass cutouts on the back for wireless charging and millimeter-wave antennae up top. This makes it more durable and creates more room inside for a bigger battery (more on that shortly) and, for the first time in an iPhone, enough space for a vapor chamber.\n\nAnd then there's the new plateau on top. I actually think this is awesome. It's where I've been resting my index finger on Android phones for years; it's a natural resting place for holding the phone. It's the same with this. Also, if you haven't heard, Corning's Ceramic Shield on the front glass is apparently great for preventing scratches.\n\nThere are a couple of small nitpicks, though. No black color. *Pro phone*. You're crazy. This feels like one of those weird things Apple does just to mess with me, where they make a bunch of products that should have a black version but don't. Like the new MacBook Air comes in Silver, Starlight, Sky Blue, and Deep Blue, but not black. And the AirPods Max refresh comes in a bunch of colors and Deep Blue, but not black. We need that deep, neutral color, especially because the color you choose is actually visible around the front bezel of the phone, so you see the color you picked all the time. This makes the Orange and Silver colors even more annoying to me. I told you it was a small thing.\n\nYou've also probably heard about the \"scratch gate\" discussion, regarding how easily the anodization layer on the aluminum scratches through to reveal the raw silver aluminum underneath. I don't yet know what to make of it; it feels like a problem that has existed with many dark-anodized aluminum phones before. As someone who uses a phone without a case, I haven't had an issue with the unit I've been using—I've been throwing it around. But the JerryRigEverything test showed that the weakest spot where you might get a scuff or scratch is around the tightest corner radii, like around the camera plateau. We'll see how many phones this affects.\n\n## The Internals: Power and Cooling\n\nBut we have to talk about what's inside this phone because the new design is one thing, but there's a lot more going on under the surface. The A19 Pro chip is, shockingly, great. It's about 20% faster than the previous generation. And now paired with iOS 26 and 12GB of RAM, these phones feel incredibly fast and snappy, which is great.\n\nBut the extra thickness has also made room for a vapor chamber for the first time, and it has made a real difference in this phone's thermal behavior and performance. A huge thanks to HDX Studios on YouTube, who was able to put thermal cameras on these phones under load and actually visualize it. But especially compared to the Air, these phones rarely even felt warm to the touch for me. As a result, they were able to sustain higher frame rates for longer during gaming and maintain display brightness for longer when recording video.\n\nBy the way, watch the rest of his video; it's incredibly well done. But it also reminded me why gaming phones in the Android world have a similar effect. The things that make a gaming phone really good—like better speakers, better performance, a better screen, and a bigger battery—are also awesome for regular use. And that's the same deal with the Pro iPhone. The things that make a Pro iPhone really good—like a better display, better cameras, a thicker, better build with better cooling for longer video shoots and better sustained performance—turns out, people buying the iPhone 17 Pro Max also enjoy a really good screen, camera, and battery. Go figure.\n\n## The Battery: Finally, Bigger is Better\n\nWe've all been saying for years: just make a thicker phone and put a bigger battery in it. I really feel like this is another place where, by focusing on making the iPhone Air super thin, they feel free to go completely in the other direction with the other phones. Because if they're claiming the iPhone Air's battery lasts all day, that's great. Every other phone in this lineup is getting thicker with bigger batteries.\n\nThus, the 17 Pro has a 20% larger battery than last year's model. And the Pro Max has actually crossed the 5,000 mAh threshold for the first time, which is a big deal in the iPhone world. And now there's 40-watt charging, too. So, half the battery in 20 minutes. This is a huge deal for Apple. We'll take a 20% improvement year over year.\n\nNow, in the Android world, obviously, this looks like nothing. It's not even close to the ultra phones with 6,000 mAh silicon-carbon batteries and 100-watt charging, etc. But for a phone that comes in the same volume as an iPhone, it's great to see this kind of improvement, especially when last year's phone already had very good battery life. The iPhone is also very efficient. I'm getting over five hours of screen-on time every day on the Pro Max, and it ends the day with over 30% left. I love it.\n\n## The Little Things\n\nThere are a bunch of other small things, too. With this screen, I believe this is the first generation of iPhone with a toggle for PWM dimming. It's buried in the accessibility settings, but you can search for it and find it—a very welcome addition for many people. It also has a slightly noticeable, but better-than-nothing, anti-reflective coating. More importantly, the display is now a bit brighter; I've seen it peak at up to 3,000 nits. And satellite connectivity has been expanded to include sending messages and sharing location, which is useful.\n\n## The Paradox: More Pro is Better for Everyone\n\nSo, the paradox is that making the Pro iPhone more Pro actually makes it better for the general public. And this is the best one yet. It's the most unshackled it's ever been. And I think, you know, when they eventually make an iPhone Ultra at some point, I'll probably still want all of this. But for now, this is good.\n\n***\n\n*If you're thinking of picking up an iPhone 17 but are worried about the scratches, channel sponsor dbrand has some options for you, like this Grip case (I have it in matte black), which also does a great job of hiding that plateau—the weakest spot for the anodization to chip, if you've seen Zack's durability test. Alternatively, if you're a clear case person, you can grab one of their Ghost cases, which comes with a lifetime zero-yellowing guarantee and features full camera protection. Fun fact: these are now also available at Best Buy in the US. Both cases have all the features you want in an iPhone case, like strong MagSafe and a camera control button, but most importantly, they're both extremely protective. And whichever route you go, if you want to complete your protection with a screen protector, you can also choose one of dbrand's Prism protectors. They're very easy to install. And if you bundle it with a Grip or Ghost case, you can use code MKBHD at checkout to save 42% on the Prism. Great deal. I'm leaving a link below so you can check them all out.*\n\n*Thanks for watching. Catch you guys very soon. Next up, still in TechTember. Peace.*"
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-09-27T05:48:48.606203+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-09-27T05:49:43.165519+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-09-27T06:05:34.157315+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}