{
  "id": "adee89c1-7567-4778-a9d5-a35ae35eeddd",
  "external_id": "83_pJv95rjs",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-11-10T06:57:10+00:00",
  "created_at": "2025-11-10T11:53:20.118476+00:00",
  "updated_at": "2025-11-10T12:00:19.678121+00:00",
  "reading_time_seconds": 1913,
  "category": {
    "category": "SPIRITUALITY",
    "shelf_life": "PERMANENT",
    "geography": null
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "The Yoga of Necessity: Involuntary Union with the Divine"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "Swami Nishpapananda explains the 'yoga of necessity' as the involuntary spiritual connection we experience daily, especially during deep sleep, where the ego subsides and we commune unconsciously with the divine ground (Atman). This state provides joy and sustenance, yet remains unillumined. He contrasts this with conscious spiritual practices like karma yoga, where actions are performed selflessly, offering one's best to God or maintaining equanimity. Through personal anecdotes, he illustrates how karma yoga transforms work into a path of liberation, bridging ordinary life and spiritual awakening by purifying the mind and reducing egoistic attachments."
    },
    "MEDIUM": {
      "markdown_string": "# The Yoga of Necessity: Involuntary Union with the Divine\n\n## Introduction\n\nGood morning. My name is Prahep Bose, and I serve as the secretary of the Vidanta Society of New York. This morning, we are very happy to welcome Swami Nish Papanandha not just as our guest speaker today, but we are blessed and grateful to have him as our guest at our center for the next ten days.\n\nThe Swami is a monk of the Ramakrishna Order of India and serves as the assistant minister at the Vedanta Society of St. Louis, where he has resided since 1974. He became interested in Vedanta through college coursework, joined the order in 1981, and received final monastic vows in India in 1995. A graduate of Washington University, Swami Nish Papanandha currently manages the book and multimedia publications of the St. Louis Vedanta Society and is very active in interfaith work in the St. Louis area. He is also a well-known and popular speaker at many of our Vedanta centers throughout the United States and at universities across the country.\n\nThe subject of his talk today is **The Yoga of Necessity**.\n\n## Opening Invocation\n\n*Om shanti, shanti, shanti.*  \nLead us from the ever-changing to the unchanging.  \nLead us from darkness to light.  \nLead us from death to immortality.  \nLight us through and through and guide us ever more with thy loving presence.  \nPeace. Peace. Peace.\n\n## The Spiritual Dichotomy\n\nGood morning. I'm very happy to be back here again after almost two years at your very warm and inviting center in this very busy city. It's just nice to be here.\n\nThe topic this morning is **the yoga of necessity**. How many of you have ever heard of the yoga of necessity other than the title of this talk? Good.\n\nI'll begin with a verse from the Katha Upanishad:\n\n> \"The self-existent one so created living creatures with senses looking outward. Rare is that wise person who, desirous of immortality, looks inward and realizes the spiritual self and becomes free forever.\"\n\nIn a very succinct way, this verse covers a lot of territory in spiritual life. We're manufactured in such a way that we're not aware of the divine ground. Our senses lead us outward into an objective world, and that's where we seek fulfillment.\n\nAccording to the Vedantic teachers, it's not just in this life or just in human life, but through all life. In a progression, the jiva—the embodied being—moves upward on a phylogenetic scale, finally becomes a human being, and then has many, many lives as a human being seeking fulfillment externally. We're just kind of programmed that way.\n\n## The Parable of the Musk Deer\n\nThere's another parable—the parable of the musk deer who spends its life running and running (except in this case, it's many, many lives) and finally, exhausted and unable to find the source of the wonderful smell it's seeking, falls down in a heap on the ground only to find that smell has been coming all this time from its own navel.\n\nThis is the analogy: in search of fulfillment externally, we finally and perhaps accidentally realize that perhaps this fulfillment is something very close to us, and we begin to look inside. This is what's called *pravritti* and *nivritti* in Sanskrit—looking for fulfillment externally and then looking for fulfillment internally.\n\n## The Involuntary Yoga of Deep Sleep\n\nYet juxtaposed to this outward tendency of the mind is the fact that every day we rest in that spiritual self. We rest in the divine ground every day during deep, dreamless sleep. The ego subsides. In deep sleep, there is an awareness of unspecified joy. It's the first stage of sleep that rebounds after sleep deprivation.\n\nOur Vedantic teachers tell us that what's happening is this: the waking experience of each of us is quite different from one another, and the dream experience of each of us is similarly quite different. The ego is present in both waking and dream experiences. But the experience of profound dreamless sleep is similar for all of us.\n\nThe ego idea, the \"I\" consciousness, is the yoke that drives us forward in this world. All our physical and mental activities proceed from it. The economy of life is such that every day it's ordained that once a day we have to throw off this yoke of the ego, let it go, and have complete rest in deep sleep. We withdraw in a state of ignorance—we're not aware of it—but we withdraw, our teachers tell us, to that spiritual center. And there's joy there. We feel that joy when we come out of deep sleep.\n\nSo there's this dichotomy: our senses direct us outward for fulfillment in the external world—we're frantically trying to find fulfillment outside—and yet every day, in spite of ourselves, we withdraw in deep sleep to this spiritual state and draw our sustenance from within, from that divine ground, whether we like it or not.\n\n## What is the Yoga of Necessity?\n\nSo withdrawing in deep sleep to the divine ground is kind of an **involuntary yoga**. Yoga is union with God. For the seeker of God along the path of divine love, yoga is union with God. For the follower of the path of knowledge, yoga is identification with that divine ground.\n\nSo unconsciously and involuntarily, we have this yoga every night in deep sleep. It doesn't illumine us, but it sustains us. We're expending our will trying to find fulfillment outside, but every night when we sleep (or if we sleep during the daytime), we find fulfillment in deep sleep.\n\nSo what is necessity? Something necessary or indispensable—in other words, something we can't do without. What we can't do without is deep sleep. We can't do without the sustenance that comes from that joy we get there. So it's a yoga of necessity. We can't get away from it, but it doesn't illumine us. We come out of deep sleep the same person who went in.\n\n## Consciousness in Waking and Dream States\n\nOn the other hand, in the waking and dream states where the ego is active, every thought, every feeling, every experience is illumined by the light of consciousness. The Atman, which is the source of our relative consciousness, is part of each and every experience in the waking state and the dream state.\n\nWe withdraw from the ego and draw our sustenance directly from the Atman in deep sleep, and this goes on every day, all the time—but we're unaware of it. So these are yogas of necessity. Whether we like it or not, whether we're aware of it or not, these things are happening according to our Hindu teachers.\n\nThe problem is that we're not aware. This is the problem. We're aware of the objects of consciousness, but we're not aware of consciousness in and of itself. We're aware of the unspecified happiness and the ignorance of deep sleep, but we're not aware of the Atman. Although we're communing with that Atman by force, as it were, during deep sleep, we're not aware of it per se.\n\nThat involuntary communion with Atman in deep sleep is the source of the joy we feel coming out of deep sleep. Then the rest of the time, the Atman is present in every experience as the knower, the objectifier, as consciousness—but we don't know that we're the knower. In fact, we think that we are what the knower objectifies. This is a mistake that we pay dearly for.\n\n## Nirvikalpa Samadhi vs. Deep Sleep\n\n*Nirvikalpa samadhi* is pretty much the opposite of deep sleep. It's unspecified infinite awareness, and it illumines us.\n\nYears ago, we had a brahmachari in St. Louis (not me). When you get into monastic life, you realize after a while that no matter what happens during the day, you have to get up the next morning very early every day, no matter what time you go to bed. Most of us eventually get into the habit of taking a little nap in the afternoon. This brahmachari would sometimes say after lunch, \"Well, I'm feeling the need for a little nirvikalpa samadhi,\" and he'd disappear for a while.\n\nSo we have these two things in the yoga of necessity: we've got the deep sleep state where we throw off the yoke of the ego and commune, though unconsciously, with the divine ground; and the waking and dream states where we're objectifying every experience as the knower, but we don't know we're the knower.\n\n## Summary: The Constant Involuntary Yoga\n\nTo summarize: we can't get away from Reality with a capital R. It's what is. Whether we're in deep sleep, the waking state, or the dream state, it's always there. We're always in this involuntary yoga. The problem is we're not illumined by it.\n\n## Karma Yoga: The Second Meaning of Yoga of Necessity\n\nI've got another meaning of the yoga of necessity that we're going to spend the rest of our time discussing. For that, I'll tell you a story.\n\nYears ago in the 70s, I started living at the center as a lay devotee in 1974, as was just mentioned in the introduction. I had a job outside, and on weekends, on Saturday mornings, I would join in and help with what needed to be done at the center—mowing the lawn, trimming the bushes, cleaning the house, whatever needed to be done.\n\nSwami Satprakashananda was there at that time. He'd founded the center in 1938, but he was in his late 80s and was withdrawing from the practical aspect of the work. He was confined at some point to the second floor of the center because of physical disabilities.\n\nBut I looked forward every week to going upstairs on Saturday morning and getting instructions from him on what needed to be done. It was a point of contact that I could depend on. I was his total focus of attention for a short time, and it always lifted me up, even though it was quite mundane.\n\nBut he became less and less aware of what actually needed to be done because he couldn't get around and see what was going on. So at a certain point, it became obvious that it couldn't continue. He said, \"Well, do this,\" and I said, \"Well, actually, this is the state of things right now.\" Then he said, \"Okay, well then do that,\" and I said, \"Well, actually, you know, this is what's going on.\" We went back and forth for a while—not too long; he was very sharp—and he said, \"Well,\" kind of scratching his head a little bit, \"I don't get around anymore, and I really can't direct your work specifically.\"\n\nI thought, \"Oh gee, what have I done to myself? I could have, should have kept my mouth shut.\"\n\nAnd then he said: **\"Do what is necessary.\"**\n\nOn one hand, I lost dependable contact with my spiritual teacher, and I was not happy about that. But those four words have served me all these years as a shorthand for karma yoga—how to decide what to do and how to act, taking the ego out of the equation.\n\n\"Do what is necessary\" doesn't say \"do what you like and avoid what you dislike.\" It's: do what you need to do when you need to do it. It's been useful, and it can be used either on the path of bhakti or on the path of knowledge. I tend to think, because of the practical use of that phrase, of karma yoga as the yoga of necessity.\n\n## The Compulsion to Act\n\nIn the chapter on karma yoga in the Bhagavad Gita, Sri Krishna says: \"Because no one ever remains for even a moment without activity, for all are made to work under compulsion by prakriti, by primordial nature.\"\n\nIt is the nature of existence to move and change. The advice is: \"You perform the obligatory duties, for action is superior to inaction.\" Again, this is the Gita: \"Without action, even the maintenance of your body will not be possible.\"\n\nSo we're forced to act. Whether we like it or not, we're living and we're acting. So in that sense, karma is a necessity, and karma yoga is the yoga involved in that necessity.\n\n## What is Karma?\n\nKarma is sometimes translated as \"work,\" but karma and work aren't quite the same. Karma means **volitional action**—the work that is done deliberately, consciously, with self-determination. Karma covers a range of activity of both the body and the mind.\n\nWhat we do with the body is karma. What is perceived by the senses is karma. We see and smell a flower and hear a bee buzzing around the flower—this is all karma. All these sensory perceptions create lasting impressions in the mind depending upon how much attention we give to them.\n\nIf you deliberately decide to sit quietly, that sitting quietly is not work, but it is karma. If you lie down deliberately with the intention of avoiding work, that's not work, but it is karma. It's done intentionally, and it makes an impression on the mind, and that impression will have a slight tendency to push us toward similar karma.\n\nWe think with the mind, or deeply feel for a person, or will something—these functions of the mind are all considered karma.\n\nBut the autonomic functions of the body, like digestion and blood circulation, are not considered karma. They're involuntary. The will is not involved, and they aren't karma. We don't decide, \"Well, I'm going to circulate my blood this morning.\" That happens on its own.\n\nInstinctive or reflex actions are also not karma. Sneezing or closing the eyes when something is brought very close to them suddenly are not karma—they're reflex actions. Seeing your kneejerk in the doctor's office is a reflex; it's not your karma (might be the doctor's karma, but it's not yours).\n\nThe more interest we take and the more attention we pay to an action, the deeper is the impression on the mind.\n\n## The Effects of Karma\n\nThis karma produces two effects:\n\n1. **There's a tangible and immediate effect.** If you feed a person, her stomach is filled, and you get the immediate satisfaction of having fed her.\n\n2. **But in addition to the immediate effect, karma produces an impression on the mind.** We're constantly gathering impressions from our various activities, including our perceptions, thoughts, and intentions.\n\nOut of those impressions, our dispositions are created. Out of these impressions, we develop talents like playing a musical instrument or hitting a baseball. In this way, our memories, talents, dispositions, and inclinations come out of these karmic impressions, called *samskaras* in Sanskrit.\n\nAnother effect of karmic impressions is more subtle—it's not so obvious, and we have to kind of take it on faith for a while. These karmic impressions are stored within the mind as very subtle moral forces that become, in the course of time, retributive forces.\n\n### The Pond Analogy\n\nThrow a pebble in a pond (this is Vivekananda's illustration). There's a splash, and then these ripples in concentric circles go out toward the periphery of the pond. While that's going on, obviously, the pebble is slowly dropping to the bottom of the pond, where it will stay.\n\nAt some time in the future, these forces—these subtle moral forces—become activated and create favorable or unfavorable situations. They're moral forces. If the intention motivating a particular karma is benign and loving, that comes back to us in the course of time (and it may be a very long time) as a favorable situation. The opposite is true if the motive associated with karma is negative, arising from malicious feelings, anger, jealousy, pride, and so forth. We're all familiar with those. Those come back to us eventually as unfavorable situations.\n\nSo apart from the impressions that create our dispositions, character, talents, and memories, there's this set of moral forces created through karma which become retributive forces eventually. The pebbles lie waiting at the bottom of the pond of the mind, waiting for some situation to call them forth.\n\n### The Durability of Karma\n\nWhen the body dies, the mind with all its contents—with every karmic impression—goes with the departing soul. Those karmas eventually create favorable or unfavorable situations for us according to their nature: good, bad, or mixed (and most karma is mixed; it's very rare that a motivation is completely good or completely bad).\n\nThese karmic impressions reach fruition in this life or future lives. Death can't nullify them. Distance can't avert them. Wherever a person will go, these impressions go with him or her. Time can't erase them. Time may pass, but these karmic impressions won't lose their force or potency.\n\nIt sounds a bit draconian, doesn't it? It gets worse.\n\nThese karmic impressions can be more durable than the physical universe. In Vedantic cosmology, the universe is created and destroyed cyclically. It rolls on for billions and billions of years, and then at a certain point—that's the day of Brahma—and then the night of Brahma comes, and everything slows down, goes into cold storage. Well, what happens to all the jivas that aren't illumined? They go into cold storage with the rest of the universe. And when things start up again billions and billions of years later, these unredeemed souls come out to reach their destiny, which is the realization of God.\n\nThink about it. We all learn (well, we don't all learn, but I think most of us here learn) that it's not a good idea to eat junk food, and we avoid it. Well, what about the junk samskaras that are going to stay with us through the next kalpa? Yeah, we got to avoid those too.\n\nThis aspect of karma makes everything we do, think, feel, see, hear, or imagine important. Nothing is irrelevant because we carry the samskara until we're liberated.\n\n## The Escape Hatch: Karma Yoga\n\nSo now we get to the escape hatch. We've made this terrible situation by going through the meaning of karma and how long samskaras stay with us.\n\nKarma yoga is a spiritual discipline which converts ordinary work into a means for one's own liberation and the welfare of others.\n\nNow, at what point does one step on that path of karma yoga? What's the transition point between karma which binds us and karma which frees us?\n\nIn order to become a karma yogi, a person has to realize the limitations of our ordinary experience. The limitations of good and evil have to be understood not as a theory but as a fact of deepest concern. One should feel the limitations of relative existence and strive to get free from those limitations. There has to be a consciousness of bondage.\n\nThis limitation of finite existence has to become in some way a matter of experience and something that's of deep personal concern. The desire for freedom—not political freedom or all these smaller freedoms, but the desire for the infinite, the unlimited—can't come without a personal, existential experience at the deepest level of bondage in some form. This demarcates the spiritual from the secular.\n\nA karma yogi is not simply ethical but spiritually oriented. To the karma yogi, the world appears as a mass of contraries, as pairs of opposites. Light and darkness, growth and decay, life and death, health and disease are bound up together inextricably.\n\n### Vivekananda's Pendulum\n\nVivekananda gave this example in the West: a big pendulum. On one side is happiness; on one side is misery. One side is health, disease, life, and death. And we want to grab that pendulum and hold it on the happiness side. But it's a big pendulum, and we're not that big, and it's going to swing. Okay, we hold on to one, we get both. We can't simply stop the pendulum on the happiness side.\n\nWhen this becomes a fact of life, when we realize the limitations of ordinary finite happiness, that's when spiritual striving starts.\n\nSo the question is: do we feel the impermanence of the world? Is there a latent sense of the reality that's behind all phenomena? Until we feel the limitations of ordinary experience, we can't really yearn for what's beyond it.\n\nSo what happens at a certain stage of our moral development? Those in whom good tendencies prevail wake up to this.\n\n## The Transition from Ethical to Spiritual\n\nAs an example, in *The Gospel of Sri Ramakrishna* toward the beginning, Mahendranath Gupta takes Ramakrishna to meet his employer at the time, Vidyasagar. There's a whole chapter on this. Vidyasagar was a well-known, respected philanthropist in Kolkata at that time—a brilliant, self-made man who went out of his way to help students who couldn't afford their college tuition and others.\n\nHe was once said to have asked, \"What good have I done to that particular person that he criticizes and derides me?\" From his own experience, he knew the limitations of how much good you could actually do for the world. It has its own repercussions.\n\nRemember a scene in *Fiddler on the Roof* at the beginning? They're introducing the people in the play, and everyone in the village has a little part. The beggar goes up to someone and says, \"You know, I need a little money,\" and then he says, \"One kopek? Last week you gave me two kopeks.\" \"I had a bad week.\" \"If you had a bad week, why should I suffer?\" That's the way it goes sometimes when you try to do good to the world.\n\nAndrew Carnegie said that it was harder to give away his money than it was to make it.\n\nBut for all Vidyasagar's selfless service, he was not a spiritual aspirant.\n\nNow, Sri Ramakrishna talked with him for hours. Vidyasagar dismissed people—I mean, he knew so much, he was so brilliant that you'd start and try to tell him something, and he'd say, \"Stop. I know that.\" But he just sat kind of with his mouth open and said, \"No, I never heard that before\" with Ramakrishna. Ramakrishna is talking in generalities, and when he has these long conversations with people, almost always toward the end he'll change the focus and direct his attention to that person and somehow or other he'll say, \"This is where you stand right now, and this is exactly what you need to do; this is the next step.\" He doesn't neglect them.\n\nSo toward the end of the conversation, Sri Ramakrishna says: **\"There's gold hidden in you. It's covered by a little clay. But you do a little more of selfless service, and soon that clay will be removed, and you'll see the gold.\"**\n\nHe's just at that transition point between being a good, ethical person who unconsciously feels the affinity with that spiritual principle but hasn't yet become conscious of it. That spiritual principle—that gold in his heart—is very close, and it's prompting him to these unselfish acts, but he's not aware of it.\n\nAt a certain point, that experience becomes more definite. The person has some inner awakening, some realization of the divine ground of that gold in the heart. The unselfish action purifies the mind, and the impurities—the bad samskaras—are symbolized by the clay, and the gold is the Atman.\n\nAt that point, the transition between the life of a good person and the life of a spiritual aspirant takes place. There's a lot of experience, a lot of preparation before that shift comes between the ethical and the spiritual. And it takes similarly a long time of practicing karma yoga before we're purified enough to really practice bhakti yoga per se or jnana yoga per se. It's the bridge—generally thought of as the bridge between our ordinary lives (the lives that everyone seems to lead) and this extremely spiritual life where you've got the attitude of a seeker of God in a personal relationship—a God with loving qualities and omnipotence who is personally concerned about you—or the path of knowledge where God doesn't care about you at all.\n\n## The Practice of Karma Yoga\n\nI want to talk a little bit about the practice of karma yoga. How is it practiced?\n\nThe Gita says, with respect to the path of bhakti and karma yoga (karma yoga as it's practiced by someone following the path of divine love): \"The person who does actions, offering them to God, abandoning attachment, is not tainted by sin as a lotus leaf is not tainted by water.\" Those actions drop away; they don't bind us.\n\nSri Krishna says: \"Whatever you do, whatever you eat, whatever you offer and sacrifice, whatever you give away, whatever austerity you practice—oh, Arjuna, do it as an offering to me.\" Do it as an offering to God.\n\nSo this is the mental attitude or mental attitudes that one should have as a seeker of the personal God on the path of divine love.\n\n### A Personal Demonstration\n\nNow, when I first read the Gita years and years ago, I wondered, well, you know, what's that like? Because the Gita was written so long ago, there's a language translation problem and also a cultural translation problem. Certainly for a Westerner trying to understand the Gita in the context in which it was written—the cultural context in which it took place—there's a cultural translation problem. But even for someone from the Indian subcontinent, the culture 3,000 years ago and the culture today is quite different, so there's still a cultural translation problem.\n\nAnd I kept wondering: what's it actually like to do that?\n\nI want to share with you how I first got the understanding of what that might be like. Again, this was in the 70s, a little later, and it was in relation to my spiritual initiation (diksha).\n\nI wasn't a monk; I still had an outside job and was living at the center. I saw other people get spiritual initiation, and I was told (not by Swami Satprakashananda but by someone else—a lay devotee who ended up being his sevak, his personal attendant as his health declined) to bring something to the initiation. I was supposed to dress in clean clothes, come early at such and such time, and bring a fruit. Okay.\n\nSo I got up on that morning, put on freshly laundered clothes, and as I was leaving my basement apartment (I had a kitchen down there), I paused and thought, \"Oh yeah, I was supposed to bring a fruit.\" So I reached up on the refrigerator, and fortunately I had some bananas. I grabbed a banana and went upstairs. So I got upstairs with the banana.\n\nI didn't know what to do with it. I was just told, \"Bring a fruit.\" So I left it on the coat rack, went upstairs, got initiated, and afterwards, Bob (he also took care of the daily fruit offering that's still done in St. Louis) said to me, \"Did you bring a fruit?\" I said, \"Well, yeah, I brought a fruit.\" He said, \"Swami will ask me if you brought a fruit.\" I said, \"Well, yeah, I did.\" He said, \"Well, what did you do with it?\" \"I left it on the coat rack.\" I really didn't know what I was doing.\n\nBob was extremely non-judgmental, and he got really quiet, and after a while he said, \"You left it on the coat rack.\" For him, that was a big comment.\n\nNot too long after that, Bob said, \"Swami wants to see you.\" Okay. So I went upstairs, and he said, \"Well, you know, when we initiate people, we ask them to bring a fruit. It's kind of symbolic.\" I knew where this was heading. I didn't say anything. He said, \"Did you bring a fruit for your initiation?\" I said, \"Yes.\" He said, \"What happened to it?\" I said, \"Well, I left it on the coat rack. I don't exactly know what happened to it.\"\n\nThen he got quiet. He could have creamed me—I mean, he would be well within his purview as a spiritual teacher to have really let me have it. But I guess he had pity on me. I really didn't know any better. I mean, how could I be so oblivious living there?\n\nSo he said, \"Well, you know, it's kind of symbolic. In spiritual life, we offer ourselves to the Lord. It's a change. Your life is no longer yours.\" And this fruit is a symbol. It's a fruit that's offered to the Lord, but it's symbolic that you're offering yourself to the Lord.\n\nAnd then he said: **\"The devotee always offers his best to the Lord. It's very important—whether it's an activity, whether it's a thought, whatever it is, you offer the best to the Lord. There are many highs, there are many highers, but there's only one highest. There are many finites, but there's only one infinite. There are many goods, there are many betters, but there's only one best, and that is generally called God. And you always offer your best to the Lord.\"**\n\n\"So, I'd like you to buy some fruit for offering to the Lord. Not one fruit or two fruits or three fruits, but many fruits. And each fruit should be the best fruit you can find. And if you can't find that fruit at one store, you should go to another store. And if you can't find it there, you should go to another store. But come back with lots of fruit and make it the best fruit you can find.\"\n\nSo I thought, okay, I'm supposed to get some fruit for the Lord. And I went on about my life. I mean, weeks went by. He didn't say when I needed to do it, and I kept thinking, \"I should do that. I've got to do that. I need to get some fruit for the Lord.\"\n\nWeeks went by, and one day I got home from work, and it was like, \"When are you going to get that fruit? You got to get that fruit right now.\" I thought, \"Hmm, where'd that come from?\" And it came again. \"Well, okay. I'm gonna get some fruit now.\" I was okay. \"I'm going now.\" So I got my car keys, and I went out to get fruit.\n\nNow, this was my internal sadhana pounding on my internal lethargy. You know, it needed a little bit of a push. So I got in my car, and I went to a specialty store because they had kind of exotic fruit. And that's when all my previous training started to kick in.\n\nSee, my grandfather had a grocery store, and I remember standing in the produce aisle with him, and he asked me, \"Do you know how to pick out oranges?\" I looked at him, and he says, \"You don't know how.\" He picks one up, puts it in my hand, and says, \"Feel the weight of it.\" Says, \"Okay, now put that down.\" He puts another one in my hand that's the same size, and he says, \"You feel that one?\" \"Yeah.\" I said, \"What's the difference?\" \"This weighs a lot more.\" He said, \"That's because there's more juice in it. It's going to be good.\"\n\nSo all these things started to kick in—all these samskaras started to kick in. All those things that were in the back of my mind that I hadn't thought of for years started to kick in because I was getting fruit for the Lord, and I had to get the best fruit that I could find. I heard him; I just delayed.\n\n\"Well, I can't buy that one. No, that one's not good enough. Not symmetric. Oh, that has a small soft spot. Underripe. Overripe.\" I got very picky.\n\nSo I got some things there. Then I went to another store, Schnucks. Then I went to National. Then there was another Stroub's specialty store in another part of town; I went there. I went to four stores, maybe five. And I came back with a lot of fruit. I mean, I came back with fruits I'd never seen before. I came back with a star fruit in the 70s. And I didn't know whether that one was ripe or not. There was just this huge conglomeration of stuff.\n\nAnd I noticed that as this process went on, I started to feel better and better. You see, it was a practical demonstration of this whole process of working for the Lord. Obviously, I wasn't buying this fruit for myself. I didn't know when it would be cut, if it would be cut, who would cut all this fruit, what would be done with it, who would eat it. I was just getting fruit for the Lord and the very best I could find. And the longer this went on, the better I felt. So by the time—and so I didn't want to stop; that's why I went to all those stores—by the time I got back, I was in a wonderful mood. I was beside myself.\n\nAnd I got back, and Bob had gotten back from work by this time. He was the one that did the fruit offering. And I gave it to Bob. This time I didn't leave it on the coat rack.\n\nAnd I kind of forgot about it. And that's another sign that you're doing it the right way: you do it, and you forget about it because the joy is in the doing. It's there in the doing as you do it. The joy is in the doing.\n\nSo that happened. Well, this was summer; it was August. It happens to be the best time to buy fruit. And at that time, the center kind of closed down in July and August; we didn't do too much. And I was really thinking, \"What are we going to do with all this fruit?\" Well, Bob saw me come in with this load of fruit, and his face brightened up instead of thinking, \"Oh my god, what am I going to do with all this fruit?\" His face brightened up because when he got home from work, he'd gone up to do something, and Swami Satprakashananda had said, \"Oh, you know, tomorrow is Sri Krishna's birth anniversary, and call the devotees. We're going to celebrate it tomorrow morning.\" So Bob was sitting in the kitchen thinking, \"I have to go out and buy fruit,\" and I walk in with all this stuff. So he was happy; he didn't have to go out and buy the fruit.\n\nOkay. So good. So we did that, and the fruit was pretty much used. I bought so much it couldn't all be used. Even though a lot of people came, he didn't cut the star fruit.\n\nBut later on, he told me—you know, it'd been three or four weeks since I was supposed to go out and get the fruit, and all that time, Swami never said a word about it. But this morning, after the shrine function, he said, \"Did that boy in the basement buy fruit?\" \"Yes.\" \"Swami, how much fruit? What kind of fruit?\" \"Well, he brought, you know, oranges and grapes and apples and bananas and peaches and nectarines and...\" \"Okay. Okay. Okay. Very good. Very good.\"\n\n### The Lesson\n\nSo what was the lesson? You offer the best to the Lord. And not only that, but the feeling that you get was an object lesson, a demonstration. The feeling that comes from that unselfish activity of offering your very best to the Lord is its own reward. You don't need more than that.\n\nSo that takes the place of success and failure. It takes the place of the elation that comes from the result or depression that comes from the result. You're in that zone while you're doing it, and that joy is its own reward. Not only that, the mind is calm. You're able to activate the samskaras that you need for that particular task, and you actually do it better.\n\n## The Witness Attitude in Karma Yoga\n\nNow, this one was harder for me.\n\nA karma yogi inclined to self-introspection, whose ideal is to withdraw the Self with a capital S from the not-self, is to withdraw the Atman from everything else—withdraw the Atman from the body, the mind, the senses—and maintain an attitude of witness. Now that was tough.\n\nA witness to all activities, not only in the external world but also in one's own mind, as their constant observer. The Atman is intrinsically conscious and aloof from all these fluctuations of nature.\n\nIn the words of the Gita again: \"The gunas of prakriti, in the form of the body, the sense organs, and the mind, perform all action. With the understanding diluted by egoism, a man thinks, 'I am the doer.' But one with true insight into the domain of guna and karma, knowing that the gunas of the senses merely rest on the gunas of objects, does not become attached.\"\n\nThis made as much sense to me as quantum physics. It's a different outlook. It's hard to translate for most of us into our normal lives.\n\nSo what does it mean? What's the practical example?\n\n### The Chanting Lesson\n\nFor me, it came as an observation, and this is how it happened. This was later, after I had joined and was a probationer monk of the order, and Swami Satprakashananda had passed away. Swami Chetanananda was in charge, and he decided that we have two brahmacharis now (I was the junior one; there was a senior brahmachari), and Bob was there, a lay devotee.\n\nEvery morning, he said, \"I'll teach you how to chant the Gita.\" We'd take 10 verses at a time and chant them Monday through Friday. He, with Swami Chetanananda, would read the Sanskrit chant (we had English transliteration), and then on Saturday, we would solo—we'd go alone—and then we'd go on to the next verses.\n\nWell, this was rather difficult at first. You know, difference between aspirated consonants and unaspirated consonants, and then these strange configurations of vowels and consonants that our tongues just tumbled over. And we're supposed to",
      "string": "# The Yoga of Necessity: Involuntary Union with the Divine\n\n## Introduction\n\nGood morning. My name is Prahep Bose, and I serve as the secretary of the Vidanta Society of New York. This morning, we are very happy to welcome Swami Nish Papanandha not just as our guest speaker today, but we are blessed and grateful to have him as our guest at our center for the next ten days.\n\nThe Swami is a monk of the Ramakrishna Order of India and serves as the assistant minister at the Vedanta Society of St. Louis, where he has resided since 1974. He became interested in Vedanta through college coursework, joined the order in 1981, and received final monastic vows in India in 1995. A graduate of Washington University, Swami Nish Papanandha currently manages the book and multimedia publications of the St. Louis Vedanta Society and is very active in interfaith work in the St. Louis area. He is also a well-known and popular speaker at many of our Vedanta centers throughout the United States and at universities across the country.\n\nThe subject of his talk today is **The Yoga of Necessity**.\n\n## Opening Invocation\n\n*Om shanti, shanti, shanti.*  \nLead us from the ever-changing to the unchanging.  \nLead us from darkness to light.  \nLead us from death to immortality.  \nLight us through and through and guide us ever more with thy loving presence.  \nPeace. Peace. Peace.\n\n## The Spiritual Dichotomy\n\nGood morning. I'm very happy to be back here again after almost two years at your very warm and inviting center in this very busy city. It's just nice to be here.\n\nThe topic this morning is **the yoga of necessity**. How many of you have ever heard of the yoga of necessity other than the title of this talk? Good.\n\nI'll begin with a verse from the Katha Upanishad:\n\n> \"The self-existent one so created living creatures with senses looking outward. Rare is that wise person who, desirous of immortality, looks inward and realizes the spiritual self and becomes free forever.\"\n\nIn a very succinct way, this verse covers a lot of territory in spiritual life. We're manufactured in such a way that we're not aware of the divine ground. Our senses lead us outward into an objective world, and that's where we seek fulfillment.\n\nAccording to the Vedantic teachers, it's not just in this life or just in human life, but through all life. In a progression, the jiva—the embodied being—moves upward on a phylogenetic scale, finally becomes a human being, and then has many, many lives as a human being seeking fulfillment externally. We're just kind of programmed that way.\n\n## The Parable of the Musk Deer\n\nThere's another parable—the parable of the musk deer who spends its life running and running (except in this case, it's many, many lives) and finally, exhausted and unable to find the source of the wonderful smell it's seeking, falls down in a heap on the ground only to find that smell has been coming all this time from its own navel.\n\nThis is the analogy: in search of fulfillment externally, we finally and perhaps accidentally realize that perhaps this fulfillment is something very close to us, and we begin to look inside. This is what's called *pravritti* and *nivritti* in Sanskrit—looking for fulfillment externally and then looking for fulfillment internally.\n\n## The Involuntary Yoga of Deep Sleep\n\nYet juxtaposed to this outward tendency of the mind is the fact that every day we rest in that spiritual self. We rest in the divine ground every day during deep, dreamless sleep. The ego subsides. In deep sleep, there is an awareness of unspecified joy. It's the first stage of sleep that rebounds after sleep deprivation.\n\nOur Vedantic teachers tell us that what's happening is this: the waking experience of each of us is quite different from one another, and the dream experience of each of us is similarly quite different. The ego is present in both waking and dream experiences. But the experience of profound dreamless sleep is similar for all of us.\n\nThe ego idea, the \"I\" consciousness, is the yoke that drives us forward in this world. All our physical and mental activities proceed from it. The economy of life is such that every day it's ordained that once a day we have to throw off this yoke of the ego, let it go, and have complete rest in deep sleep. We withdraw in a state of ignorance—we're not aware of it—but we withdraw, our teachers tell us, to that spiritual center. And there's joy there. We feel that joy when we come out of deep sleep.\n\nSo there's this dichotomy: our senses direct us outward for fulfillment in the external world—we're frantically trying to find fulfillment outside—and yet every day, in spite of ourselves, we withdraw in deep sleep to this spiritual state and draw our sustenance from within, from that divine ground, whether we like it or not.\n\n## What is the Yoga of Necessity?\n\nSo withdrawing in deep sleep to the divine ground is kind of an **involuntary yoga**. Yoga is union with God. For the seeker of God along the path of divine love, yoga is union with God. For the follower of the path of knowledge, yoga is identification with that divine ground.\n\nSo unconsciously and involuntarily, we have this yoga every night in deep sleep. It doesn't illumine us, but it sustains us. We're expending our will trying to find fulfillment outside, but every night when we sleep (or if we sleep during the daytime), we find fulfillment in deep sleep.\n\nSo what is necessity? Something necessary or indispensable—in other words, something we can't do without. What we can't do without is deep sleep. We can't do without the sustenance that comes from that joy we get there. So it's a yoga of necessity. We can't get away from it, but it doesn't illumine us. We come out of deep sleep the same person who went in.\n\n## Consciousness in Waking and Dream States\n\nOn the other hand, in the waking and dream states where the ego is active, every thought, every feeling, every experience is illumined by the light of consciousness. The Atman, which is the source of our relative consciousness, is part of each and every experience in the waking state and the dream state.\n\nWe withdraw from the ego and draw our sustenance directly from the Atman in deep sleep, and this goes on every day, all the time—but we're unaware of it. So these are yogas of necessity. Whether we like it or not, whether we're aware of it or not, these things are happening according to our Hindu teachers.\n\nThe problem is that we're not aware. This is the problem. We're aware of the objects of consciousness, but we're not aware of consciousness in and of itself. We're aware of the unspecified happiness and the ignorance of deep sleep, but we're not aware of the Atman. Although we're communing with that Atman by force, as it were, during deep sleep, we're not aware of it per se.\n\nThat involuntary communion with Atman in deep sleep is the source of the joy we feel coming out of deep sleep. Then the rest of the time, the Atman is present in every experience as the knower, the objectifier, as consciousness—but we don't know that we're the knower. In fact, we think that we are what the knower objectifies. This is a mistake that we pay dearly for.\n\n## Nirvikalpa Samadhi vs. Deep Sleep\n\n*Nirvikalpa samadhi* is pretty much the opposite of deep sleep. It's unspecified infinite awareness, and it illumines us.\n\nYears ago, we had a brahmachari in St. Louis (not me). When you get into monastic life, you realize after a while that no matter what happens during the day, you have to get up the next morning very early every day, no matter what time you go to bed. Most of us eventually get into the habit of taking a little nap in the afternoon. This brahmachari would sometimes say after lunch, \"Well, I'm feeling the need for a little nirvikalpa samadhi,\" and he'd disappear for a while.\n\nSo we have these two things in the yoga of necessity: we've got the deep sleep state where we throw off the yoke of the ego and commune, though unconsciously, with the divine ground; and the waking and dream states where we're objectifying every experience as the knower, but we don't know we're the knower.\n\n## Summary: The Constant Involuntary Yoga\n\nTo summarize: we can't get away from Reality with a capital R. It's what is. Whether we're in deep sleep, the waking state, or the dream state, it's always there. We're always in this involuntary yoga. The problem is we're not illumined by it.\n\n## Karma Yoga: The Second Meaning of Yoga of Necessity\n\nI've got another meaning of the yoga of necessity that we're going to spend the rest of our time discussing. For that, I'll tell you a story.\n\nYears ago in the 70s, I started living at the center as a lay devotee in 1974, as was just mentioned in the introduction. I had a job outside, and on weekends, on Saturday mornings, I would join in and help with what needed to be done at the center—mowing the lawn, trimming the bushes, cleaning the house, whatever needed to be done.\n\nSwami Satprakashananda was there at that time. He'd founded the center in 1938, but he was in his late 80s and was withdrawing from the practical aspect of the work. He was confined at some point to the second floor of the center because of physical disabilities.\n\nBut I looked forward every week to going upstairs on Saturday morning and getting instructions from him on what needed to be done. It was a point of contact that I could depend on. I was his total focus of attention for a short time, and it always lifted me up, even though it was quite mundane.\n\nBut he became less and less aware of what actually needed to be done because he couldn't get around and see what was going on. So at a certain point, it became obvious that it couldn't continue. He said, \"Well, do this,\" and I said, \"Well, actually, this is the state of things right now.\" Then he said, \"Okay, well then do that,\" and I said, \"Well, actually, you know, this is what's going on.\" We went back and forth for a while—not too long; he was very sharp—and he said, \"Well,\" kind of scratching his head a little bit, \"I don't get around anymore, and I really can't direct your work specifically.\"\n\nI thought, \"Oh gee, what have I done to myself? I could have, should have kept my mouth shut.\"\n\nAnd then he said: **\"Do what is necessary.\"**\n\nOn one hand, I lost dependable contact with my spiritual teacher, and I was not happy about that. But those four words have served me all these years as a shorthand for karma yoga—how to decide what to do and how to act, taking the ego out of the equation.\n\n\"Do what is necessary\" doesn't say \"do what you like and avoid what you dislike.\" It's: do what you need to do when you need to do it. It's been useful, and it can be used either on the path of bhakti or on the path of knowledge. I tend to think, because of the practical use of that phrase, of karma yoga as the yoga of necessity.\n\n## The Compulsion to Act\n\nIn the chapter on karma yoga in the Bhagavad Gita, Sri Krishna says: \"Because no one ever remains for even a moment without activity, for all are made to work under compulsion by prakriti, by primordial nature.\"\n\nIt is the nature of existence to move and change. The advice is: \"You perform the obligatory duties, for action is superior to inaction.\" Again, this is the Gita: \"Without action, even the maintenance of your body will not be possible.\"\n\nSo we're forced to act. Whether we like it or not, we're living and we're acting. So in that sense, karma is a necessity, and karma yoga is the yoga involved in that necessity.\n\n## What is Karma?\n\nKarma is sometimes translated as \"work,\" but karma and work aren't quite the same. Karma means **volitional action**—the work that is done deliberately, consciously, with self-determination. Karma covers a range of activity of both the body and the mind.\n\nWhat we do with the body is karma. What is perceived by the senses is karma. We see and smell a flower and hear a bee buzzing around the flower—this is all karma. All these sensory perceptions create lasting impressions in the mind depending upon how much attention we give to them.\n\nIf you deliberately decide to sit quietly, that sitting quietly is not work, but it is karma. If you lie down deliberately with the intention of avoiding work, that's not work, but it is karma. It's done intentionally, and it makes an impression on the mind, and that impression will have a slight tendency to push us toward similar karma.\n\nWe think with the mind, or deeply feel for a person, or will something—these functions of the mind are all considered karma.\n\nBut the autonomic functions of the body, like digestion and blood circulation, are not considered karma. They're involuntary. The will is not involved, and they aren't karma. We don't decide, \"Well, I'm going to circulate my blood this morning.\" That happens on its own.\n\nInstinctive or reflex actions are also not karma. Sneezing or closing the eyes when something is brought very close to them suddenly are not karma—they're reflex actions. Seeing your kneejerk in the doctor's office is a reflex; it's not your karma (might be the doctor's karma, but it's not yours).\n\nThe more interest we take and the more attention we pay to an action, the deeper is the impression on the mind.\n\n## The Effects of Karma\n\nThis karma produces two effects:\n\n1. **There's a tangible and immediate effect.** If you feed a person, her stomach is filled, and you get the immediate satisfaction of having fed her.\n\n2. **But in addition to the immediate effect, karma produces an impression on the mind.** We're constantly gathering impressions from our various activities, including our perceptions, thoughts, and intentions.\n\nOut of those impressions, our dispositions are created. Out of these impressions, we develop talents like playing a musical instrument or hitting a baseball. In this way, our memories, talents, dispositions, and inclinations come out of these karmic impressions, called *samskaras* in Sanskrit.\n\nAnother effect of karmic impressions is more subtle—it's not so obvious, and we have to kind of take it on faith for a while. These karmic impressions are stored within the mind as very subtle moral forces that become, in the course of time, retributive forces.\n\n### The Pond Analogy\n\nThrow a pebble in a pond (this is Vivekananda's illustration). There's a splash, and then these ripples in concentric circles go out toward the periphery of the pond. While that's going on, obviously, the pebble is slowly dropping to the bottom of the pond, where it will stay.\n\nAt some time in the future, these forces—these subtle moral forces—become activated and create favorable or unfavorable situations. They're moral forces. If the intention motivating a particular karma is benign and loving, that comes back to us in the course of time (and it may be a very long time) as a favorable situation. The opposite is true if the motive associated with karma is negative, arising from malicious feelings, anger, jealousy, pride, and so forth. We're all familiar with those. Those come back to us eventually as unfavorable situations.\n\nSo apart from the impressions that create our dispositions, character, talents, and memories, there's this set of moral forces created through karma which become retributive forces eventually. The pebbles lie waiting at the bottom of the pond of the mind, waiting for some situation to call them forth.\n\n### The Durability of Karma\n\nWhen the body dies, the mind with all its contents—with every karmic impression—goes with the departing soul. Those karmas eventually create favorable or unfavorable situations for us according to their nature: good, bad, or mixed (and most karma is mixed; it's very rare that a motivation is completely good or completely bad).\n\nThese karmic impressions reach fruition in this life or future lives. Death can't nullify them. Distance can't avert them. Wherever a person will go, these impressions go with him or her. Time can't erase them. Time may pass, but these karmic impressions won't lose their force or potency.\n\nIt sounds a bit draconian, doesn't it? It gets worse.\n\nThese karmic impressions can be more durable than the physical universe. In Vedantic cosmology, the universe is created and destroyed cyclically. It rolls on for billions and billions of years, and then at a certain point—that's the day of Brahma—and then the night of Brahma comes, and everything slows down, goes into cold storage. Well, what happens to all the jivas that aren't illumined? They go into cold storage with the rest of the universe. And when things start up again billions and billions of years later, these unredeemed souls come out to reach their destiny, which is the realization of God.\n\nThink about it. We all learn (well, we don't all learn, but I think most of us here learn) that it's not a good idea to eat junk food, and we avoid it. Well, what about the junk samskaras that are going to stay with us through the next kalpa? Yeah, we got to avoid those too.\n\nThis aspect of karma makes everything we do, think, feel, see, hear, or imagine important. Nothing is irrelevant because we carry the samskara until we're liberated.\n\n## The Escape Hatch: Karma Yoga\n\nSo now we get to the escape hatch. We've made this terrible situation by going through the meaning of karma and how long samskaras stay with us.\n\nKarma yoga is a spiritual discipline which converts ordinary work into a means for one's own liberation and the welfare of others.\n\nNow, at what point does one step on that path of karma yoga? What's the transition point between karma which binds us and karma which frees us?\n\nIn order to become a karma yogi, a person has to realize the limitations of our ordinary experience. The limitations of good and evil have to be understood not as a theory but as a fact of deepest concern. One should feel the limitations of relative existence and strive to get free from those limitations. There has to be a consciousness of bondage.\n\nThis limitation of finite existence has to become in some way a matter of experience and something that's of deep personal concern. The desire for freedom—not political freedom or all these smaller freedoms, but the desire for the infinite, the unlimited—can't come without a personal, existential experience at the deepest level of bondage in some form. This demarcates the spiritual from the secular.\n\nA karma yogi is not simply ethical but spiritually oriented. To the karma yogi, the world appears as a mass of contraries, as pairs of opposites. Light and darkness, growth and decay, life and death, health and disease are bound up together inextricably.\n\n### Vivekananda's Pendulum\n\nVivekananda gave this example in the West: a big pendulum. On one side is happiness; on one side is misery. One side is health, disease, life, and death. And we want to grab that pendulum and hold it on the happiness side. But it's a big pendulum, and we're not that big, and it's going to swing. Okay, we hold on to one, we get both. We can't simply stop the pendulum on the happiness side.\n\nWhen this becomes a fact of life, when we realize the limitations of ordinary finite happiness, that's when spiritual striving starts.\n\nSo the question is: do we feel the impermanence of the world? Is there a latent sense of the reality that's behind all phenomena? Until we feel the limitations of ordinary experience, we can't really yearn for what's beyond it.\n\nSo what happens at a certain stage of our moral development? Those in whom good tendencies prevail wake up to this.\n\n## The Transition from Ethical to Spiritual\n\nAs an example, in *The Gospel of Sri Ramakrishna* toward the beginning, Mahendranath Gupta takes Ramakrishna to meet his employer at the time, Vidyasagar. There's a whole chapter on this. Vidyasagar was a well-known, respected philanthropist in Kolkata at that time—a brilliant, self-made man who went out of his way to help students who couldn't afford their college tuition and others.\n\nHe was once said to have asked, \"What good have I done to that particular person that he criticizes and derides me?\" From his own experience, he knew the limitations of how much good you could actually do for the world. It has its own repercussions.\n\nRemember a scene in *Fiddler on the Roof* at the beginning? They're introducing the people in the play, and everyone in the village has a little part. The beggar goes up to someone and says, \"You know, I need a little money,\" and then he says, \"One kopek? Last week you gave me two kopeks.\" \"I had a bad week.\" \"If you had a bad week, why should I suffer?\" That's the way it goes sometimes when you try to do good to the world.\n\nAndrew Carnegie said that it was harder to give away his money than it was to make it.\n\nBut for all Vidyasagar's selfless service, he was not a spiritual aspirant.\n\nNow, Sri Ramakrishna talked with him for hours. Vidyasagar dismissed people—I mean, he knew so much, he was so brilliant that you'd start and try to tell him something, and he'd say, \"Stop. I know that.\" But he just sat kind of with his mouth open and said, \"No, I never heard that before\" with Ramakrishna. Ramakrishna is talking in generalities, and when he has these long conversations with people, almost always toward the end he'll change the focus and direct his attention to that person and somehow or other he'll say, \"This is where you stand right now, and this is exactly what you need to do; this is the next step.\" He doesn't neglect them.\n\nSo toward the end of the conversation, Sri Ramakrishna says: **\"There's gold hidden in you. It's covered by a little clay. But you do a little more of selfless service, and soon that clay will be removed, and you'll see the gold.\"**\n\nHe's just at that transition point between being a good, ethical person who unconsciously feels the affinity with that spiritual principle but hasn't yet become conscious of it. That spiritual principle—that gold in his heart—is very close, and it's prompting him to these unselfish acts, but he's not aware of it.\n\nAt a certain point, that experience becomes more definite. The person has some inner awakening, some realization of the divine ground of that gold in the heart. The unselfish action purifies the mind, and the impurities—the bad samskaras—are symbolized by the clay, and the gold is the Atman.\n\nAt that point, the transition between the life of a good person and the life of a spiritual aspirant takes place. There's a lot of experience, a lot of preparation before that shift comes between the ethical and the spiritual. And it takes similarly a long time of practicing karma yoga before we're purified enough to really practice bhakti yoga per se or jnana yoga per se. It's the bridge—generally thought of as the bridge between our ordinary lives (the lives that everyone seems to lead) and this extremely spiritual life where you've got the attitude of a seeker of God in a personal relationship—a God with loving qualities and omnipotence who is personally concerned about you—or the path of knowledge where God doesn't care about you at all.\n\n## The Practice of Karma Yoga\n\nI want to talk a little bit about the practice of karma yoga. How is it practiced?\n\nThe Gita says, with respect to the path of bhakti and karma yoga (karma yoga as it's practiced by someone following the path of divine love): \"The person who does actions, offering them to God, abandoning attachment, is not tainted by sin as a lotus leaf is not tainted by water.\" Those actions drop away; they don't bind us.\n\nSri Krishna says: \"Whatever you do, whatever you eat, whatever you offer and sacrifice, whatever you give away, whatever austerity you practice—oh, Arjuna, do it as an offering to me.\" Do it as an offering to God.\n\nSo this is the mental attitude or mental attitudes that one should have as a seeker of the personal God on the path of divine love.\n\n### A Personal Demonstration\n\nNow, when I first read the Gita years and years ago, I wondered, well, you know, what's that like? Because the Gita was written so long ago, there's a language translation problem and also a cultural translation problem. Certainly for a Westerner trying to understand the Gita in the context in which it was written—the cultural context in which it took place—there's a cultural translation problem. But even for someone from the Indian subcontinent, the culture 3,000 years ago and the culture today is quite different, so there's still a cultural translation problem.\n\nAnd I kept wondering: what's it actually like to do that?\n\nI want to share with you how I first got the understanding of what that might be like. Again, this was in the 70s, a little later, and it was in relation to my spiritual initiation (diksha).\n\nI wasn't a monk; I still had an outside job and was living at the center. I saw other people get spiritual initiation, and I was told (not by Swami Satprakashananda but by someone else—a lay devotee who ended up being his sevak, his personal attendant as his health declined) to bring something to the initiation. I was supposed to dress in clean clothes, come early at such and such time, and bring a fruit. Okay.\n\nSo I got up on that morning, put on freshly laundered clothes, and as I was leaving my basement apartment (I had a kitchen down there), I paused and thought, \"Oh yeah, I was supposed to bring a fruit.\" So I reached up on the refrigerator, and fortunately I had some bananas. I grabbed a banana and went upstairs. So I got upstairs with the banana.\n\nI didn't know what to do with it. I was just told, \"Bring a fruit.\" So I left it on the coat rack, went upstairs, got initiated, and afterwards, Bob (he also took care of the daily fruit offering that's still done in St. Louis) said to me, \"Did you bring a fruit?\" I said, \"Well, yeah, I brought a fruit.\" He said, \"Swami will ask me if you brought a fruit.\" I said, \"Well, yeah, I did.\" He said, \"Well, what did you do with it?\" \"I left it on the coat rack.\" I really didn't know what I was doing.\n\nBob was extremely non-judgmental, and he got really quiet, and after a while he said, \"You left it on the coat rack.\" For him, that was a big comment.\n\nNot too long after that, Bob said, \"Swami wants to see you.\" Okay. So I went upstairs, and he said, \"Well, you know, when we initiate people, we ask them to bring a fruit. It's kind of symbolic.\" I knew where this was heading. I didn't say anything. He said, \"Did you bring a fruit for your initiation?\" I said, \"Yes.\" He said, \"What happened to it?\" I said, \"Well, I left it on the coat rack. I don't exactly know what happened to it.\"\n\nThen he got quiet. He could have creamed me—I mean, he would be well within his purview as a spiritual teacher to have really let me have it. But I guess he had pity on me. I really didn't know any better. I mean, how could I be so oblivious living there?\n\nSo he said, \"Well, you know, it's kind of symbolic. In spiritual life, we offer ourselves to the Lord. It's a change. Your life is no longer yours.\" And this fruit is a symbol. It's a fruit that's offered to the Lord, but it's symbolic that you're offering yourself to the Lord.\n\nAnd then he said: **\"The devotee always offers his best to the Lord. It's very important—whether it's an activity, whether it's a thought, whatever it is, you offer the best to the Lord. There are many highs, there are many highers, but there's only one highest. There are many finites, but there's only one infinite. There are many goods, there are many betters, but there's only one best, and that is generally called God. And you always offer your best to the Lord.\"**\n\n\"So, I'd like you to buy some fruit for offering to the Lord. Not one fruit or two fruits or three fruits, but many fruits. And each fruit should be the best fruit you can find. And if you can't find that fruit at one store, you should go to another store. And if you can't find it there, you should go to another store. But come back with lots of fruit and make it the best fruit you can find.\"\n\nSo I thought, okay, I'm supposed to get some fruit for the Lord. And I went on about my life. I mean, weeks went by. He didn't say when I needed to do it, and I kept thinking, \"I should do that. I've got to do that. I need to get some fruit for the Lord.\"\n\nWeeks went by, and one day I got home from work, and it was like, \"When are you going to get that fruit? You got to get that fruit right now.\" I thought, \"Hmm, where'd that come from?\" And it came again. \"Well, okay. I'm gonna get some fruit now.\" I was okay. \"I'm going now.\" So I got my car keys, and I went out to get fruit.\n\nNow, this was my internal sadhana pounding on my internal lethargy. You know, it needed a little bit of a push. So I got in my car, and I went to a specialty store because they had kind of exotic fruit. And that's when all my previous training started to kick in.\n\nSee, my grandfather had a grocery store, and I remember standing in the produce aisle with him, and he asked me, \"Do you know how to pick out oranges?\" I looked at him, and he says, \"You don't know how.\" He picks one up, puts it in my hand, and says, \"Feel the weight of it.\" Says, \"Okay, now put that down.\" He puts another one in my hand that's the same size, and he says, \"You feel that one?\" \"Yeah.\" I said, \"What's the difference?\" \"This weighs a lot more.\" He said, \"That's because there's more juice in it. It's going to be good.\"\n\nSo all these things started to kick in—all these samskaras started to kick in. All those things that were in the back of my mind that I hadn't thought of for years started to kick in because I was getting fruit for the Lord, and I had to get the best fruit that I could find. I heard him; I just delayed.\n\n\"Well, I can't buy that one. No, that one's not good enough. Not symmetric. Oh, that has a small soft spot. Underripe. Overripe.\" I got very picky.\n\nSo I got some things there. Then I went to another store, Schnucks. Then I went to National. Then there was another Stroub's specialty store in another part of town; I went there. I went to four stores, maybe five. And I came back with a lot of fruit. I mean, I came back with fruits I'd never seen before. I came back with a star fruit in the 70s. And I didn't know whether that one was ripe or not. There was just this huge conglomeration of stuff.\n\nAnd I noticed that as this process went on, I started to feel better and better. You see, it was a practical demonstration of this whole process of working for the Lord. Obviously, I wasn't buying this fruit for myself. I didn't know when it would be cut, if it would be cut, who would cut all this fruit, what would be done with it, who would eat it. I was just getting fruit for the Lord and the very best I could find. And the longer this went on, the better I felt. So by the time—and so I didn't want to stop; that's why I went to all those stores—by the time I got back, I was in a wonderful mood. I was beside myself.\n\nAnd I got back, and Bob had gotten back from work by this time. He was the one that did the fruit offering. And I gave it to Bob. This time I didn't leave it on the coat rack.\n\nAnd I kind of forgot about it. And that's another sign that you're doing it the right way: you do it, and you forget about it because the joy is in the doing. It's there in the doing as you do it. The joy is in the doing.\n\nSo that happened. Well, this was summer; it was August. It happens to be the best time to buy fruit. And at that time, the center kind of closed down in July and August; we didn't do too much. And I was really thinking, \"What are we going to do with all this fruit?\" Well, Bob saw me come in with this load of fruit, and his face brightened up instead of thinking, \"Oh my god, what am I going to do with all this fruit?\" His face brightened up because when he got home from work, he'd gone up to do something, and Swami Satprakashananda had said, \"Oh, you know, tomorrow is Sri Krishna's birth anniversary, and call the devotees. We're going to celebrate it tomorrow morning.\" So Bob was sitting in the kitchen thinking, \"I have to go out and buy fruit,\" and I walk in with all this stuff. So he was happy; he didn't have to go out and buy the fruit.\n\nOkay. So good. So we did that, and the fruit was pretty much used. I bought so much it couldn't all be used. Even though a lot of people came, he didn't cut the star fruit.\n\nBut later on, he told me—you know, it'd been three or four weeks since I was supposed to go out and get the fruit, and all that time, Swami never said a word about it. But this morning, after the shrine function, he said, \"Did that boy in the basement buy fruit?\" \"Yes.\" \"Swami, how much fruit? What kind of fruit?\" \"Well, he brought, you know, oranges and grapes and apples and bananas and peaches and nectarines and...\" \"Okay. Okay. Okay. Very good. Very good.\"\n\n### The Lesson\n\nSo what was the lesson? You offer the best to the Lord. And not only that, but the feeling that you get was an object lesson, a demonstration. The feeling that comes from that unselfish activity of offering your very best to the Lord is its own reward. You don't need more than that.\n\nSo that takes the place of success and failure. It takes the place of the elation that comes from the result or depression that comes from the result. You're in that zone while you're doing it, and that joy is its own reward. Not only that, the mind is calm. You're able to activate the samskaras that you need for that particular task, and you actually do it better.\n\n## The Witness Attitude in Karma Yoga\n\nNow, this one was harder for me.\n\nA karma yogi inclined to self-introspection, whose ideal is to withdraw the Self with a capital S from the not-self, is to withdraw the Atman from everything else—withdraw the Atman from the body, the mind, the senses—and maintain an attitude of witness. Now that was tough.\n\nA witness to all activities, not only in the external world but also in one's own mind, as their constant observer. The Atman is intrinsically conscious and aloof from all these fluctuations of nature.\n\nIn the words of the Gita again: \"The gunas of prakriti, in the form of the body, the sense organs, and the mind, perform all action. With the understanding diluted by egoism, a man thinks, 'I am the doer.' But one with true insight into the domain of guna and karma, knowing that the gunas of the senses merely rest on the gunas of objects, does not become attached.\"\n\nThis made as much sense to me as quantum physics. It's a different outlook. It's hard to translate for most of us into our normal lives.\n\nSo what does it mean? What's the practical example?\n\n### The Chanting Lesson\n\nFor me, it came as an observation, and this is how it happened. This was later, after I had joined and was a probationer monk of the order, and Swami Satprakashananda had passed away. Swami Chetanananda was in charge, and he decided that we have two brahmacharis now (I was the junior one; there was a senior brahmachari), and Bob was there, a lay devotee.\n\nEvery morning, he said, \"I'll teach you how to chant the Gita.\" We'd take 10 verses at a time and chant them Monday through Friday. He, with Swami Chetanananda, would read the Sanskrit chant (we had English transliteration), and then on Saturday, we would solo—we'd go alone—and then we'd go on to the next verses.\n\nWell, this was rather difficult at first. You know, difference between aspirated consonants and unaspirated consonants, and then these strange configurations of vowels and consonants that our tongues just tumbled over. And we're supposed to"
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-11-10T11:53:20.118466+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-11-10T11:54:22.352386+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-11-10T12:00:19.678116+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}