{
  "id": "234f1df0-5067-4a37-aa70-b09a2db76bf4",
  "title": "How to Have Difficult Conversations: A Former Secret Service Agent's Plan",
  "content": "# How to Have Difficult Conversations: A Former Secret Service Agent's Plan\n\nWe all have them. The conversations that live in the shadows of our minds, cloaked in so much emotion or tension that we don't know how to handle them. A supervisor overlooking us for a promotion. A spouse after a fight. A friend who has betrayed us. Or perhaps someone we’ve labeled as a \"narcissist\" or a \"gaslighter.\"\n\nAccording to Desmond O’Neal, a former Secret Service agent and interrogation expert with over 30 years of experience, that’s the first place we go wrong: **we label people.**\n\nIn his first public conversation, O’Neal—who has trained elite teams from the FBI to the CIA and spent years using science-backed techniques to get the world's biggest liars to open up—lays out a simple, actionable framework for navigating our darkest, most difficult conversations. It’s not about interrogation tactics. It’s about human connection.\n\n## The Problem with Labels: \"Stop Making It Easy for Yourself\"\n\nThe conversation begins with a common scenario: \"I've got a difficult conversation I want to have with someone, and they might be a narcissist.\"\n\nO’Neal’s response is immediate: \"So, let's stop there.\"\n\n> \"If you just blatantly label somebody as being a narcissist, you've just made it easy for yourself. You've just put blame on them, and you're not going to be able to really understand who this person is and why they are the way they are.\"\n\nHe challenges the label. What does \"narcissist\" even mean? Low empathy? Self-centered? A bit aggressive?\n\"Okay,\" he says. \"Do you think personally that there are times in your life where you lack empathy?\"\n\nThe answer, of course, is yes. Empathy is situational and subjective. By slapping on a clinical-sounding label, we absolve ourselves of the need to understand. We enter the conversation already seeing the other person as a problem to be managed, not a person to be understood. The same goes for accusations of \"gaslighting.\" Before you use the term, you must be specific: *What* are they gaslighting you about? *When* does it happen?\n\nThe first step to a better conversation is to strip away the reductive labels. See the human, not the diagnosis.\n\n## The \"Dark Conversation\" Framework: Have a P.L.A.N.\n\nWhen stress is high and emotions are strong, how do you authentically connect? O’Neal’s answer is to have a plan, encapsulated in the acronym **P.L.A.N.**\n\n### **P is for PURPOSE**\nBefore you say a word, you must know your mission. Why are you there? What is the goal?\n\n> \"Your mission is going to drive your tactics. Your mission is going to determine if things get off track.\"\n\nO’Neal explains this through **Multiple Goals Theory**. In any interaction, we pursue simultaneous goals:\n*   **Task-Oriented:** I want to get something done (e.g., get a promotion, resolve a conflict).\n*   **Identity:** How do I feel about myself during this? (e.g., Am I respected? Am I the good guy?).\n*   **Relational:** What does this do to our relationship?\n\nIn easy conversations, these align. In difficult ones, they clash. You might have to choose between correcting your boss in a meeting (task/identity goal) and preserving your relationship with them (relational goal). Your overarching **Purpose** is your anchor. It keeps you from being pulled into emotional chaos when the other person becomes aggressive, insulting, or tries to derail you.\n\nO’Neal illustrates this with a harrowing story from his career. He was tasked with interviewing Phillip Garrido, a kidnapper and serial rapist who had held a young girl captive for 18 years, to see if he was connected to another missing child. For four days, 8-9 hours a day, O’Neal sat with him.\n\n> \"Multiple times he was very aggressive. He was very condescending. He called me a liar... He questioned my integrity. Now, my purpose is not to make him feel that I'm smarter than him. It's not to belittle or berate him... I could have said, 'You kidnapped an 11-year-old girl... and you question *my* integrity?' I didn't do that because that's not why I was there.\"\n\nBy staying ruthlessly focused on his purpose—to understand the truth about the cold case—he was able to conclude, and later bet his career on, Garrido's innocence in that particular crime. New evidence eventually proved him right.\n\n**The lesson:** When the conversation gets ugly, your purpose is your lifeline. It's the difference between being reactive and staying strategically engaged.\n\n### **L is for LISTEN (The Thing We're Worst At)**\nListening, truly listening, is a monumental cognitive task.\n\n> \"Internally, my internal vocabulary... is running about 800 to 1,000 words a minute. I'm speaking to you at about 120 to 150 words a minute... Simultaneously, you are listening to me... but your brain can process at like 400 to 600 words per minute. So, you have too much cognitive bandwidth.\"\n\nThis excess bandwidth is why we drift off, plan our reply, or become \"convinced instead of curious.\" To listen actively, you must practice **cognitive inhibition**—deliberately narrowing your mental bandwidth to stay fully engaged with the other person.\n\n> \"Stephen Covey says most people don't listen with the intent to understand. They listen with the intent to reply. And if you are simply just waiting for your turn to talk, then you and I are not connecting. Controlling a conversation comes from listening, not talking.\"\n\n### **A is for ASK (The Bridge to Understanding)**\nIf you are listening and you notice a change—in their words, their tone, or their body language—you **must ask about it.** This is how you show curiosity and deepen connection.\n\nO’Neal points to \"empathy accuracy\" research. Your ability to accurately understand what another person is thinking is shockingly low:\n*   For a stranger: ~20%\n*   For a close friend: ~30%\n*   For your significant other: **No higher than 40%**\n\n> \"You have a four out of ten chance of being right. And if that conversation gets emotional, that 40% can go down as low as 15... When your ego is on the line, your ears go offline.\"\n\nAsking questions resolves ambiguity. He gives a simple example: You come home from a workout and say, \"That was tough.\" Your partner could:\n1.  Say nothing.\n2.  Assume they understand: \"That's why you look the way you do!\"\n3.  Ask: **\"What do you mean by tough?\"**\n\nOnly the third option shows true tuning-in. The same applies to non-verbal cues. If you see someone cross their arms and roll their eyes during an emotional point, don't assume. Ask.\n\n> \"It seems like what you just did maybe was because you didn't like what I had to say, because I saw you cross your arms and roll your eyes. Do I have that right?\"\n\nThis \"seems like\" language is observational, not accusatory. It opens a door for clarification instead of slamming one shut.\n\n### **N is for NEXT STEPS**\nHow do you want to resolve this? What is the end goal? This is about proposing a way forward.\n\n> \"Do you think that you and I can find an amicable way forward?... What does that look like for us?... I'm having this conversation with you because my relationship with you matters.\"\n\nIt’s an invitation to co-create a solution. If the conversation has been about a colleague's rudeness, the \"next step\" might be a direct, specific request: \"When you call me a name like that, it's disrespectful. Can you explain to me specifically why you did that?\" You make them back up their emotion with reason.\n\n**There is no magic bullet.** But with a P.L.A.N., you walk away knowing you handled it the best you could, regardless of the outcome.\n\n## What to STOP Doing: Three Communication \"Extinctions\"\n\nO’Neal believes in \"extinction before acquisition.\" To communicate better, stop doing these three things:\n\n1.  **Stop trying to be right.** This is the ego trap that kills connection.\n2.  **Stop telling people \"I understand.\"** You can understand their words, but you cannot truly understand their unique, internal experience. Saying \"I understand\" often shuts down exploration and makes the moment about you. Instead, make them *feel* understood by listening and asking. \"It sounds like this is really tough for you\" is better than \"I know exactly how you feel.\"\n3.  **Stop giving unsolicited opinions.** Most of the time, people don't want you to fix it; they want you to \"sit in the mud with them.\" Unless they explicitly ask for your advice, your job is to listen and create space for their emotion.\n\n## Leadership, Trust, and the Power of Decisiveness\n\nThe principles of dark conversations extend into leadership. For O’Neal, **leadership is a feeling** cultivated by being calm under chaos.\n\n> \"If you're only a leader when it's calm, then you're not really a leader. You're somebody with a higher salary and a title.\"\n\nHe cites research on decision-making under uncertainty. In one study, students who got exam results—whether they passed *or* failed—were more likely to book a vacation than those left in ambiguity. **Uncertainty paralyzes.** Great leaders can make decisions with limited information.\n\n> \"The best decision to make is the right one. The second best is the wrong one. The worst one is to not make a decision at all.\"\n\nThis connects to **trust**, which O’Neal visualizes as concentric rings:\n*   **The Center Ring: Self-Trust.** Can you trust yourself to make decisions and keep your own promises?\n*   **The Next Ring: Unconditional Trust.** A very small circle of people (e.g., family, a select few friends).\n*   **The Outer Ring: Conditional Trust.** Everyone else. \"People should earn your trust... Don't give it away for free.\"\n\nIf you lose someone's trust, regaining it requires specific accountability, time, and relentless consistency.\n\n## The Ultimate Goal: Rapport Through Other-Focus\n\nAfter decades of research and practice, the most powerful finding for O’Neal is this: **Rapport is everything.** And rapport isn't built by being overly nice or talking about the weather.\n\n> \"Rapport is understanding values... If I'm paying attention to you and I'm making you feel seen and heard and understood... by the reciprocity of doing that, you do the same thing for me. That's rapport.\"\n\nIt requires killing the \"me-me syndrome\"—the tendency to see every interaction through the lens of our own ego, story, and goals. He shares a poignant personal story of the day his father died. Years later, talking with his siblings, he learned his sister remembered \"The Simpsons\" playing on the TV in the room.\n\n> \"I have absolutely no idea that there was a TV in the room... Her perspective and the way she saw that moment affected her differently than everybody else.\"\n\nTrue connection demands that we move beyond our own narrative and genuinely seek to understand the other person's world. It’s about **outward reflection**, not just self-reflection.\n\nIn the end, the techniques of a former Secret Service agent boil down to profoundly human principles: enter with clarity, listen with intent, question with curiosity, and always, always seek to understand the person behind the problem. It’s a plan not for winning arguments, but for preserving—or saving—what matters most: our connection to each other.",
  "category": "PERSPECTIVES",
  "time_to_read": "10 min read",
  "article_link": "https://unhook-production.up.railway.app/article/234f1df0-5067-4a37-aa70-b09a2db76bf4",
  "article_source": "Teerth",
  "external_id": "xDQyLnNAXr4",
  "youtube_channel": "TheDiaryOfACEO",
  "published_at": "2025-12-01T08:01:15.000Z",
  "cached_at": "2025-12-03T14:47:36.578Z"
}