{
  "id": "32b04350-778a-416f-87a7-3443d4d3ca0a",
  "title": "Vipul Shah on Kerala Story, National Awards, and Cinema's Role",
  "content": "# Vipul Shah on ‘The Kerala Story’: “It’s Not a Political Film, It’s a Social One”\n\nIn a landscape where cinema and politics often collide, filmmaker Vipul Shah’s *The Kerala Story* stands as one of the most debated Indian films in recent memory. But according to Shah himself, the controversy may be missing the point. “I don’t consider it a political film,” he insists. “I see it as a social film.”\n\nThe movie, which dramatizes the stories of young women allegedly coerced into religious conversion and recruited by extremist groups, received two National Awards this year: Best Director and Best Cinematography. Yet, almost immediately, several politicians took to social media to label it “divisive.” Shah sees this less as criticism and more as political posturing. “That is their political compulsion,” he says. “These awards have no connection to a film’s politics or a political party.”\n\nShah argues that the film’s subject matter—rooted in real testimonies—is fundamentally social, not ideological. “Often, you take an issue, and if political parties get involved on both sides, it starts to look like a political film. But if you remove that haze and look closely—what is the film actually about? It talks about a social issue. Because it’s an uncomfortable truth, it may have political ramifications. That’s why parties jump in.”\n\nHe draws a clear line between the film’s intent and the noise around it. “Otherwise, let me tell you something simple: the National Awards happened. Our film won two. Some politicians tweeted calling it divisive. When the film was released, I could understand their tweets. But tweeting about the awards? That’s their political compulsion. Yet they reacted. So when you see these two things together, you might think, ‘Oh, this is a political film.’ But actually, it is not.”\n\nAt its heart, Shah maintains, *The Kerala Story* is about the lives of young women— “whose lives are being destroyed.” That, to him, makes it a social film, “an exposé, at best.” But when political figures weigh in, public perception shifts. “Because so many political people get involved and comment, audiences start feeling it’s a political film. And then it’s very easy to draw conclusions.”\n\nHe acknowledges the film’s polarizing nature but attributes it to the nature of the story itself. “This is a film with two sides. One side is those people in Kerala who are doing this work. The other is the girls whose lives are badly affected because of it. Everyone chooses a side. And then they defend that side very strongly. That’s probably why it seems like a political film. But otherwise, it is not.”\n\n---\n\n**Did you find this perspective compelling?**  \nSubscribe for more deep, nuanced conversations that challenge conventional narratives and bring clarity to complex issues—direct from some of the most thoughtful voices in India and beyond. One click, and we’ll keep them coming.\n## On Constructive Criticism and the Power of Cinema\n\nVipul Shah’s stance on criticism is clear: he welcomes it—so long as it’s specific, reasoned, and constructive. Sweeping dismissals, he argues, reveal more about the critic’s agenda than the work itself. \n\n> “If someone comes with constructive criticism, we are more than happy to engage and give answers. But if you just want to discard everything in one go, call it nonsense, say they’re lying because it doesn’t suit your narrative—what explanation can I possibly give you?”\n\nHe doesn’t claim *The Kerala Story* is flawless. Like any creative endeavor, cinema is an “ever-evolving process.” There’s always room to refine, reimagine, and do better. But what frustrates him is the tendency to reduce nuanced films to political footballs, shutting down dialogue rather than deepening it.\n\nThis leads him to a broader reflection—one that goes beyond his own film and touches on the untapped potential of Indian cinema as a whole.\n\n### Cinema as Soft Power: Lessons from Hollywood\n\nShah believes Indian filmmakers have chronically underestimated cinema’s capacity to shape perception, identity, and even geopolitics. He points to Hollywood not as an aesthetic ideal, but as a masterclass in narrative influence.\n\n> “America is considered a superpower today. There’s a general perception around the world: if there’s ever any trouble, America will come to save the day. Where did that narrative come from? America has lost nearly every war it fought—Vietnam, Cuba, Iraq yielded nothing, they fled Afghanistan overnight. So how is America the world’s best military? It’s their cinema.”\n\nFrom *Avengers* to *Mission: Impossible*, American films consistently position the U.S. as the globe’s guardian—a narrative so potent that it overrides historical reality. Shah credits Hollywood for building a “cultural capital” that reinforces America's status as a superpower. \n\nMeanwhile, Indian cinema, in his view, has largely been content with a simpler role: entertainment as escape.\n\n> “There was a perception that people come to Indian cinema to be entertained—just entertain them. They don’t want to see too much, they don’t want to think too much. They want to leave their problems outside, sit in AC for three hours, and feel happy. That’s it.”\n\nBut that, he argues, is a profound underestimation of both the medium and the audience.\n\n### The Shift Toward Realism—and Responsibility\n\nShah acknowledges that this is changing. Films like *The Kashmir Files*, *URI*, and yes, *The Kerala Story*, represent a turn toward realism, social engagement, and narrative ambition. They trust audiences to handle complexity—and they trust cinema to do more than just entertain.\n\nHe cites older films like *Ardh Satya*—a gritty, hero-less police drama that was also a blockbuster—as proof that Indian audiences have always been ready for substance. They just weren’t always offered it.\n\n> “We never embraced the kind of cinema that could take India’s narrative to the world. That job wasn’t done by cinema, and I feel that in our country, the entire system never took cinema that seriously.”\n\nNow, he believes, that’s beginning to change. And if embraced consciously, cinema could become India’s most powerful tool for soft power expansion—just as it has been for Korea with K-pop and K-dramas, or for America with its myth-making blockbusters.\n\n> “If we start thinking, ‘We all want to use Indian cinema as soft power’—if that consciousness comes—we will achieve it very quickly.”\n\n### On Polarizing Films: *Animal*, *Kabir Singh*, and the Purpose of Debate\n\nWhen asked about commercially successful but morally contentious films like *Animal* or *Kabir Singh*, Shah refuses to dismiss them outright. Instead, he questions the quality of the discourse around them.\n\n> “Both films started debates around masculinity, patriarchy… Is that debate bad? It will lead us somewhere, make us think. I may not agree with the character—personally, I wouldn’t want to live that life—but when my kids see the film, we have a debate at home. I’m able to tell them something about that angle. Why is that debate bad?”\n\nHe finds the selective outrage hypocritical. Why is *Pushpa*, a film about a smuggler and criminal, celebrated, while *Animal* is condemned? \n\n> “It’s selective debate. I think *Pushpa* is a fantastic film. What they’ve done with that character is superb. I’ve seen it three times. I’ve seen *Animal* three times, *Kabir Singh* three times. But personally, do I want to be a smuggler? No.”\n\nThe problem, in his eyes, isn’t that these films exist—it’s that the conversations around them so often turn toxic rather than constructive.\n\n> “If we make it into a constructive debate, something good can come out of it. Otherwise, noise is just noise. Nobody gains anything.”\n\n### The Underestimation of the Audience\n\nA recurring theme in Shah’s perspective is a respect for the viewer’s intelligence—and a frustration with condescending assumptions about how people consume media.\n\n> “It’s a very wrong assumption that people don’t have the ability to think. ‘Oh, people will just accept whatever you give them.’ During my film, people said there would be communal violence after watching it. Nothing happened. Nothing.”\n\nHe mentions Muslims who watched *The Kerala Story* and appreciated it, even tweeting in support. Their response complicated the reductive narrative that the film would only deepen divisions.\n\n> “We make assumptions and take the conversation in a different direction. Cinema allows you the freedom to debate—and from that churn, you can bring out something good for society.”\n\n### Comedy, Context, and the Lost Art of Story-Based Humor\n\nShifting to a lighter note, Shah reflects on the state of comedy in Indian cinema—a genre he knows well, having been involved in hits like *Namastey London* and *Singh Is Kinng*. \n\nHe believes comedy has grown harder to write—and not because audiences are more sensitive, but because writers are relying less on story and more on isolated jokes.\n\n> “Comedy is one of the toughest things to write. When comedy is involved in a good story, that’s when it becomes memorable.”\n\nHe points to classics like *Hera Pheri*: beloved not because it was a string of gags, but because it had “a beautiful plot, amazing characters, and through those characters, the humor emerged.”\n\nToday, he suggests, comedy often feels disposable—in part because stand-up and digital content have raised the bar. Why settle for mediocre humor in a film when you can watch exceptional comedians on your phone anytime?\n\nStill, Shah is optimistic. If writers return to strong narratives and recognize that comedy is ultimately a “family genre”—meant to be enjoyed together, without mean-spiritedness or vulgarity—there’s no reason Indian comedy can’t thrive again.\n\n> “Political satire? No problem. People are happy to accept satire. The people you’re satirizing aren’t so foolish that they’ll come after you.”\n\nHe smiles. \n“The problem isn’t restrictions. It’s imagination.”\n\n---\n**Next Section Preview:** In the final part of this conversation, Vipul Shah delves into the personal risks and emotional stakes of making controversial cinema, the evolving role of the filmmaker in a polarized society, and his vision for the future of Indian storytelling—on screen and beyond.\n## The Art of Humor and Character: Weaving Comedy into Serious Narratives\n\nVipul Shah leans forward, his eyes lighting up as he delves into the mechanics of blending humor with gravitas—a signature of his filmmaking philosophy. “When we were crafting *Singh is Kinng* and *Namastey London*,” he begins, “there were two core ideas at play.” He explains that both films centered on Punjabi protagonists—characters known for living life to the fullest, unapologetically and with humor deeply embedded in their personalities. “The challenge was,” he says, “how do you weave that humor into your script without diluting the core? You have a dense love story to tell, or a message about redeeming flawed characters—so some scenes must be serious, emotional, even dramatic. And they are. But when the moment allows, you activate that fun-loving side so the character becomes immensely likable.”\n\nHe believes that when a likable person delivers a message, it settles easily within the audience. “If a very serious, wise person says something, it can feel heavy. But when the same point is made with a joke, it becomes digestible. It stays with you.” That, to Shah, is the power of humor—not as decoration, but as a tool. “Any film I make has humor in it. It’s my philosophy. Look at *Aankhen* with Paresh Rawal’s character, or *Waqt* with Amit ji, Boman, and Rajpal—that confederation was spicy, fun. Even in later films, we always ensured humor had a place.”\n\nShah sees humor as an emotional lubricant. “When your characters are funny, they can deliver a big message very easily, very beautifully. And if there’s an uncomfortable moment in the film, humor can make it very easy to digest. As a maker, it’s a great tool—one I use well to deliver whatever message the story holds.” He adds with a laugh, “If I’m going to watch a film, I want to laugh. Even if it’s just four times, I want to laugh openly. And if you can make me laugh, your brownie points in my review will go up. That’s a given.”\n\nHe recalls a dialogue from *Singh is Kinng* where Akshay Kumar says, “*Main meethi baatein nahi karta… bas sachchi karta hoon. Acchi apne aap lag jaati hai.*” (I don’t say sweet things… I just say the truth. The good automatically feels good.) “That’s the likable character—this Sardar is very happy, lives with an open heart. But there’s also something about Akshay Kumar himself.”\n\n## Akshay Kumar: The Philosopher of Laughter\n\nWhen asked about Akshay Kumar’s unique flair for comedy, Shah doesn’t hesitate. “He’s unique in comedy because he loves to laugh and he loves to make people laugh. Even on set, even when you meet him otherwise—that’s very high on his agenda. *Hansi hai, masti karni hai.* (It’s about laughter, it’s about having fun.) He’s that true Punjabi *munda*. His philosophy is that the set should be a very happy place. If there’s tension anywhere, he’ll be the first to step in and ease it out.”\n\nShah shares an anecdote that perfectly captures Kumar’s energy. “He believes in starting early—he’ll call you for a meeting at 4:30 or 5 in the morning. Now, you might not be a 4:30 person, but he is. And he understands that the next person might be grumbling, *‘Arre sir, why 4:30? Call me at 9, it’s a normal human time!’* So when you meet him at 4:30, you’re tired, half-asleep—but he’s full of energy. He’ll crack jokes, make things lively. The environment at his office at that hour is like people are laughing, enjoying themselves, food is flowing—he looks after you. That’s his personality.”\n\nThis carries into his work. “When he’s doing a comedy film, he can’t help but improvise. His mind is super active—he’s always thinking about how to make people laugh. And he loves it. He loves to make people love.” Shah points to the iconic “Ashok Fitness” scene from the *Housefull* series as a pure Akshay Kumar moment. “I don’t know if it was in the script or if he improvised it on the spot, but that’s him—100%.”\n\nWhat stands out, Shah emphasizes, is Kumar’s lack of insecurity. “He’s one actor who, if the other person has a good punch, he doesn’t feel threatened—he’ll encourage it. *‘Arre yaar, ye kaise le gaya? Kar, mast mazaa aayega logon ko hasaane mein.’* (Wow, how did he take that? Do it, it’ll be fun to make people laugh.) There are two types of approaches—one where I say all the jokes, and another where everyone cracks jokes together to make it a great, funny sequence. He’s all for the latter.”\n\n## The Timeless Icons: Amitabh Bachchan and Akshay Kumar\n\nShah reflects on what sets megastars like Amitabh Bachchan and Akshay Kumar apart from others. “It’s phenomenal—the influence, the craftsmanship, the history, the legacy, the impact these gentlemen have built.” He describes Amitabh Bachchan’s enduring passion. “If you meet him today, the first thing he’ll say after greeting you warmly is, *‘Yaar, tum mujhe kaam nahi de rahe ho.’* (You’re not giving me work.) Now, imagine—the superstar of the millennium, someone we’ve idolized for decades, says that to you. What do you do? The desire to do great work—that’s still at the level of a newcomer in him.”\n\nHe recalls working with Bachchan. “There’s no script page with him on set. He comes fully prepared. And never once does he say, ‘I won’t do what you’re saying, I’ll do this.’ That angle doesn’t exist. He says, ‘Okay, you want it like this? Give me two minutes.’ And in the first take itself, you’re 90% convinced it can’t get better than this. The focus, the sincerity, the passion—it’s magic. When you’re watching him on monitor, you get so engrossed you forget to say ‘cut.’ You forget you’re the director—you feel like you’re just watching. That’s his power.”\n\nAkshay Kumar, on the other hand, is “a great philosopher in my mind.” Shah explains, “He believes in karma—just keep working. Hit or flop, many people are involved in a film. The director, writer, DOP, production designer, editor, background, music—thousands of people. I can’t control everything in one film. My job is to work. The result is in God’s hands.” This philosophy, Shah says, keeps Kumar largely unaffected by success or failure. “I’ve never seen him change in the last 20 years. If a film doesn’t work, it feels bad—you’ve worked so hard—but he says, ‘Okay, fine. We all worked hard. It wasn’t meant to be. Next time, we’ll work harder.’ He just moves on.”\n\nThese qualities, Shah believes, make them timeless. “They’re not bound by any era. As long as they want to work, they’ll get great work and they’ll deliver.” He points to Bachchan’s relentless schedule even today, from *Kaun Banega Crorepati* to films, with the same energy. “The sheer love for their work is at another level. It’s a statement that India’s voice for the polio-free campaign was Amit ji’s voice—because people would listen to him.”\n\n## On Nepotism and New Talent: A Producer’s Perspective\n\nThe conversation shifts to nepotism and the opportunities for new actors. Shah is unequivocal. “Nepotism is a term that has been forcefully stuck on us.” He offers an analogy: “If there’s a grocer’s shop below your office, do you ever tell him, ‘You can’t give this to your son? You have to give it to someone who’s worked with you for 25 years?’ Obviously, when his son grows up, he’ll take over the shop. That happens in every big company, everywhere. But in films, it’s suddenly a problem.”\n\nHe highlights what he sees as the most dangerous aspect: the audience’s double standard. “When a star’s son comes, the audience shows up in big numbers for the opening. When a new guy comes, no one is at the cinema hall. His opening doesn’t happen. He has to struggle a lot. So why does the audience shout about nepotism? Why don’t they go and make these new guys stars? It’s in your hands. You decide who will be a star and who won’t.”\n\nHe defends producers like Karan Johar. “If his film doesn’t work, the loss is only his. So it’s his choice. He chooses the script—so he’ll choose the actor too. Why is he blamed for that? I think it’s the stupidest thing.” Shah argues that everyone wants to pass on their legacy to their children. “That’s a common thing, no? Why does a father work? For his sons. To make their lives better. And the power you have as an audience—you don’t want to use it. You just sit on social media and curse about nepotism.”\n\nHe acknowledges the other side—the bitterness of those who come to Mumbai with dreams and don’t get opportunities. “I understand that bitterness. Someone else’s inheritance is what I could never earn in my whole life.” But he urges perspective. “Think about it: how many films does a major banner make in its entire lifetime? Yash Raj Films, one of the biggest banners of all time, is 52 years old. They’ve made maybe 100 films. In those 100 films, how many new people did they launch? They launched Poonam Dhillon and Farooq Sheikh, then Arjun Kapoor, Ranveer Singh, Anushka Sharma—maybe 8-10 people. That’s it.”\n\nThe issue, he says, is also economic. “In India, to a great extent, a movie runs on the star. The actor is the marketing plot of the film. So if I need to bring certain economics to a film, I can’t do it with somebody people don’t know. I need that type of actor.” He circles back to the audience’s role. “If you make new guys’ films big, everyone will run after them. Look at *Sairat*—it was a hit. I promise you, immediately after, many new guys and girls were launched. Everyone was thinking, ‘Get a good love story, take a new boy and girl—because *Sairat* worked, so we should do the same.’ People see economic opportunity.”\n\nUltimately, he says, it’s about money. “No one wants to lose. *‘Main kamau nahi, par gavau nahi.’* (I may not earn, but I won’t lose.) If a producer expects his capital to come back, that’s not wrong.” Yet he sympathizes with the emotional weight of the issue. “It’s complex because emotions are involved—many youngsters are very talented and don’t get work. It pains us too. That’s why I say: the audience should take this responsibility. Make those new guys hit. Go to their films. If it becomes a hit, the matter is over. Everyone will make films with new people. It’s the simplest solution. But you don’t go.”\n\nHe cites the example of Vicky Kaushal, who came the hard way—through TV, web shows, then films. “He’s an outstanding actor, brilliant. But even today, is he as big a star as his talent? Respect, yes—the whole industry respects him. But if his film releases, will it open at 10 crores on day one? No.” Similarly, *Band Baaja Baaraat* with Ranveer and Anushka had a good opening, but not blockbuster-level. “My film *Commando* with Vidyut Jammwal opened very well 13 years ago. But if you can name only three films in 13 years, that’s the reality.”\n\nShah’s message is clear: the power to change lies with the audience. If they support new talent, the industry will follow.\n\n--\n**Next: Vipul Shah delves into the evolving landscape of Indian cinema, the impact of OTT platforms, and his vision for the future of storytelling.**\n## The Unseen Architects: Who Really Gets the Credit?\n\n“Whose credit is it? The audience’s or someone else’s?” Vipul Shah poses the question with a knowing smile, cutting straight to one of the film industry’s most persistent and quietly accepted contradictions. The conversation shifts from the craft of filmmaking to the politics of perception—specifically, the uneven distribution of glory and blame.\n\n“In India, there are star directors,” Shah begins, listing names like Rajamouli, Prashanth Neel, Sukumar, Lokesh Kanagaraj, Rohit Shetty, and Sanjay Leela Bhansali. “Each has their own loyal audience. You can market a film on their name alone. Every director has that, to some extent. People understand that.”\n\nBut then comes the twist—the media’s double standard.\n\n“If you notice,” he says, “the media places the crown of a film’s success on the actor’s head… and shatters the entire pot of a film’s failure on the director’s head. This is a media tradition.”\n\nHe illustrates this with a stark example: the contrasting receptions of *Baaghi* and *Heropanti 2*. Both were directed by Ahmed Khan and produced by Sajid Nadiadwala, with Tiger Shroff as the lead. *Baaghi* was a blockbuster. “Everyone said Tiger, Tiger, Tiger. All credit went to Tiger.” But when *Heropanti 2* underperformed, social media campaigns erupted: “Ban Ahmed Khan from direction.” Shah notes wryly, “When he made *Baaghi*, you didn’t say, ‘Give him the Filmfare Award.’”\n\nHe’s quick to clarify that actors themselves often understand and want to share credit—it’s the media ecosystem that resists. “The media doesn’t want to share it. They want that photo… and a director’s photo isn’t as glamorous. It doesn’t attract them.”\n\n## The Manufactured Narrative: PR, Paid Opinions, and Public Perception\n\nShah doesn’t stop at traditional media. He takes aim at a more modern affliction: the orchestrated nature of online discourse.\n\n“Maybe 10–15 years ago, the public still had original opinions,” he reflects. “But today, when I open Twitter or Instagram and see talk about any movie or actor… about 80% of it is probably paid. You can tell from the face—it’s a campaign being run. It’s not some actual person’s opinion in that moment.”\n\nHe describes it as a kind of parallel theater—a strange, almost detached drama where PR outfits are tasked not with informing, but with *creating* opinion. “I’m not saying this in a bad way. It’s like… a different drama is playing out on the side.”\n\nBut there’s hope. With time, he says, the audience has learned to filter out the noise. “People have recognized it. They’ve said, ‘I pay these people, but no results come. Not a single ticket is sold because of what they’re putting out.’” Those who’ve been exposed have seen their influence—and income—plummet. Those who haven’t will be exposed soon.\n\n“Every system, when something new comes,” he concludes, “some wrong things come along with the good. You just need to filter the noise out. And the audience does that.”\n\nHe laughs about the absurdity of it all—seeing a decades-old clip of Aamir or Shah Rukh Khan being trended with negativity. “Who cares about this? Everyone in the industry knows these are manufactured opinions. Everyone knows how it’s done.”\n\nThe choice, he implies, is yours: to participate or not.\n\nHe shares that during the release of *The Kerala Story*, many people approached him directly: “Your film is such a big hit. Give us some money, we’ll write about it.” His team refused. “We don’t subscribe to this.” For the first two weeks, the film was largely ignored by mainstream media. It was only when social pressure became unavoidable that coverage began. “Then they started writing. Until then, they weren’t.”\n\nThe message is clear: you’re told, “Your film won’t be shown.” But it’s up to you to realize what truly matters—creating genuine audience interest. “That’s a choice you have to make.”\n\n## The Oscar Question: Can Indian Cinema Cross That Bridge?\n\nThe conversation turns to global recognition—specifically, the Oscar. Shah is thoughtful, measured.\n\n“There’s a very big gap,” he admits. “The way we express our stories, and the way stories are accepted internationally…” He points to festivals like Cannes, Berlin, Sundance, and Busan, where artistically ambitious films from Europe, South America, or Korea are celebrated—but often don’t reach the Oscars. The films that do, he suggests, strike a balance between mainstream appeal and artistic expression—a balance that doesn’t always align with Indian cinematic instincts.\n\n“Our cinema is a bit emotive. We depend on verbalizing everything. Don’t keep anything. ‘I will understand, but the audience won’t.’ You have to spoon-feed as well.” The expectations of Indian audiences and American audiences are very different, and so are the films made for them.\n\n“Our way of writing and executing… might feel a bit outdated to them. Because they were making cinema like this maybe 30 years ago.” But he’s optimistic. “When our cinema evolves, winning an Oscar won’t be a big deal. I don’t think it’s an unachievable task.”\n\nHe cites *RRR*’s recognition in action choreography and music, and A.R. Rahman’s Oscar for *Slumdog Millionaire* as signs that India isn’t completely off the map. “But the speed at which we get there will actually be decided by our audience. If our audience evolves that quickly, then our cinema will evolve, and we will get there.”\n\n## The Ambitious Future: *Ramayan*, IPO, and Building Legacies\n\nShah is excited about new horizons—especially Nitesh Tiwari’s ambitious *Ramayan* adaptation. “It’s a very adventurous approach,” he says, praising the alignment of vision, world-class VFX experience, and a stellar cast including Ranbir Kapoor. “I think it might show where Indian cinema is also going. It’s a path-breaking effort without a doubt.”\n\nHe sees it as part of a larger movement—one that includes his own company’s upcoming IPO. “Indian cinema is going to have a tremendous future,” he says with conviction. “We are going to expand into a very, very big film industry and compete on a world level.” The stakes will become bigger and better, and he wants to be ready.\n\n“*Ramayan* could be the first step toward that journey.” For too long, he suggests, Indian cinema has been seen as a family-run, private industry. “It’s time we exploit the full potential of cinema… and build a great company for people to see what’s possible.”\n\n## What’s Next: New Films and a Lesson in Legacy\n\nOn the immediate horizon, Shah has two exciting projects. *Hisab* is a unique, fun film centered around a bank robbery, featuring Jaideep Ahlawat, Shefali Shah, and Abhishek Banerjee. Then there’s *The Governor*, starting tomorrow, fronted by Manoj Bajpayee and directed by Chinmay. It’s a gripping story based on recent history—specifically, the years 1989–1991, when India stood on the verge of bankruptcy.\n\n“Many people in today’s generation don’t know,” Shah explains. “Before ‘91, there was no Coke, no Pepsi, no TVs, no shopping malls, no multiplexes, no phones. Landlines at home took a year to come.” India was transforming, and at the heart of that transformation was an unsung hero—an RBI Governor whose fierce effort helped save the nation from economic collapse. “It’s not a political film at all. It’s a human story of an Indian fighting for the nation.”\n\nWhen asked for the name, he smiles. “I’m not at liberty to take the name due to certain legal aspects.” A quick Google search will reveal it, but the film isn’t about politics—it’s about respect for a warrior who fought on a different front.\n\n## A Final Philosophy: Don’t Retire—Rebuild\n\nThe conversation closes on a reflective note. Shah shares the core philosophy that has guided his long and successful career:\n\n“I have never planned my life. I never planned my career, my moves, anything. I just believed in one thing: work with absolute passion and sincerity. Work to get credibility. Money will follow. Don’t chase money—chase credibility. Chase name. Chase respect. Money is going to follow you.”\n\nHe pushes back strongly against the modern dream of retiring early. “That’s a wrong way to look at life.” What people are really looking for, he believes, isn’t freedom *from* work, but freedom *in* thought—freedom from the self-imposed misery of constant pressure.\n\n“If you’re happy, work won’t feel like work.” He urges people to build something people will remember. “And the day you retire, what will all the people associated with you do?” It’s a responsibility as much as it is a passion.\n\nHis advice is simple, earned through decades of creation: “Just focus on working. Don’t set such goals. Focus on creating value, creating reputation, creating credibility. Money will follow.”\n\n## Closing Thoughts: honesty in an industry of diplomacy\n\nAs the conversation winds down, Shah reflects on why he speaks so openly in an industry known for its diplomacy. “Often we are told that if you speak openly, many people will get upset. Don’t do that.” But he feels that if you are civil and honest, you can at least try. “Maybe I haven’t yet spoken 10% of what goes on in my mind,” he admits with a laugh. “But you have to start speaking at some point.”\n\nIt’s a fitting end to a conversation that was as much about the unseen structures of cinema as it was about the stories we see on screen. In an industry of illusions, Vipul Shah chooses clarity—not to provoke, but to remind us that real respect isn’t manufactured. It’s built, scene by scene, film by film, with a sincerity that no campaign can buy.\n\n---\n*This concludes our four-part series with Vipul Shah. Thank you for reading.*",
  "category": "MOVIES",
  "time_to_read": "26 min read",
  "article_link": "https://unhook-production.up.railway.app/article/32b04350-778a-416f-87a7-3443d4d3ca0a",
  "article_source": "Teerth",
  "external_id": "AzFXjdvqe34",
  "youtube_channel": "ThePrakharGuptaXperience",
  "published_at": "2025-09-19T15:30:08.000Z",
  "cached_at": "2025-10-01T15:34:27.200Z"
}