{
  "id": "3886fafb-e0d3-4cd9-b40b-4cef65c32887",
  "title": "How You Will Be Forgotten and the Ghosts You Leave",
  "content": "# How You Will Be Forgotten and the Ghosts You Leave\n\nHey, Vsauce, Michael here.\n\nA single piece of refined flour is, on average, just 82.67 microns wide. That means a 5 lb bag of flour contains about 2.7 billion individual specks of flower dust. Now, if each of those particles were a person, three bags could represent every single human alive on Earth today—8.1 billion itty-bitty things.\n\nAre you under 30 years old? That question could roughly divide everyone alive today in half: the yeses and the nos. But can you imagine a second question that could then divide both of those groups in half? If so, and if you kept doing that, after just 33 questions, you would be left with more than 8 billion groups, each containing just one person. In other words, out of everyone alive today, we could pinpoint a specific individual—for example, you—with just 33 yes-or-no questions. What would those questions be? Do they even exist? We don’t know.\n\nBut we do know that every year, about this many people die—a little bit more than a quarter cup. But about twice as many as that are born. And how many people have ever been born? This many: 117 billion. But out of all of these people, out of everyone who has ever existed, this is how many you will ever meet. You are a stranger to your own species.\n\nThis is a video about how you will be forgotten. It’s about the ghosts that surround us, and how they’re getting closer.\n\n---\n\n## The Solar Corona of You\n\nOur journey begins 2,500 km above the surface of the sun. There, a hot layer of ionized gas begins its reach millions of kilometers out into space. It’s called the solar corona. Normally, it’s outshone by the rest of the sun because it gives off just one-millionth as much light. But during an eclipse, it can be seen.\n\nWhen you are eclipsed—when you’re gone—your own sort of corona will remain as well: the memories people have of you, your treasure and junk, emails and texts you sent, the fact that your child has a nose like yours, every appearance you made in the background of a stranger’s photo. Those are all traces of you that shine while you’re alive, but can also continue long after you’re gone. Douglas Hofstadter called them your **solar corona**. I love that phrase because it makes a cosmological phenomenon personal by literally including you.\n\nHow long will you be here? Well, that’s why I made this clock. It tells the time, but it also tells *your* time. Just answer a few questions, and then when it’s ready, push the red button, and the clock will begin counting down the seconds you have left to live—approximately. Now, whenever you want, you can switch it to show the time. But that’s not nearly as fun.\n\nAlso, this clock never forgets. If you take away its power, it’ll go dark, but it’s still thinking about you. Next time you plug it in, it will pick right back up where it should be. Now, if you would like a practical retro *memento mori*, you can pre-order one of these now. *Omnia vulnerant, ultima necat* is Latin, and it refers to these passing seconds. It means: “Each of these wounds, the last kills.” *Mox nox* means “soon it will be night”—and it will.\n\nBut while this is ticking down, something else is ticking up: the number of ghosts in the world.\n\n---\n\n## Your Nominal Ghost\n\nYour **nominal ghost** is your name. It’s out there representing you whether you’re there or not. It won’t haunt the world forever, though. As we’ve often been reminded, you die twice: once when your heart stops beating, and then again, usually sometime later, when your name is spoken for the last time.\n\nBut whose name has been remembered the longest? Signed here on this 5,000-year-old tablet is the oldest written name we’ve ever found: **Kusham**, the first named character we know in the written history of humanity. Probably—it’s not entirely clear whether Kusham is the name of a person or just the title of an office holder. If you want to be really sure, a generation or two later, this tablet was made. It contains three names: G. Saul and two people he enslaved, Pop X and a woman named Sakalger. These individuals are the reigning chance of avoiding the second death.\n\nAnd with archival practices and technologies being what they are today, your name could conceivably last just as long as these have already.\n\nBut I’ve got to say: if you want your ghosts to last longer, it helps to bend the truth a little bit.\n\nToby Jukenov built this interactive globe that shows the most famous person born in every location. Fame is based on Wikipedia data: how long their article is, how many languages it’s in, how many visits it gets per day, stuff like that. By the way, out of everyone alive right now—about this many of us—almost exactly a quarter teaspoon are mentioned on Wikipedia.\n\nNow, let’s zoom in on Stillwell, Kansas. Oh, hey there, good-looking. But here’s the thing: I wasn’t born in Stillwell. I grew up there. I lived there from ages 5 to 18, but I was born in Kansas City. For a while, a lot of things online said that I was born in Stillwell, so that’s probably how I wound up here. But should I correct it? What’s more important? The truth, or a little lie that prolongs and enhances my nominal ghost?\n\nMaybe the truth? Because even if my name is forgotten, images of me may stick around.\n\n---\n\n## Your Likeness Ghost\n\nAnd that is your second ghost: your **likeness**. Figurative portrayals of what you look like. We have no idea what most people who have lived looked like long ago—no records were made. Eventually, some were and have survived.\n\nSo, who’s the earliest known person where we know what they looked like? Well, it’s probably **Gudea**. He was an ancient Sumerian ruler, and 27 4,000-year-old statues of him have been found in southern Iraq. They stand out not just for their craftsmanship, but also for the fact that earlier depictions of human forms are either more abstract or generalized. But because these depictions of Gudea are more realistic, are so similar to each other, and have been found spread so widely, it’s tenable that they’re similar to the actual face of the actual individual as he appeared in life—the first known illustrated person in our history.\n\nEven if your figural ghosts don’t stick around as long as Gudea’s have, things that look kind of like you might.\n\n---\n\n## Your Genetic Ghost\n\nI’m talking about your **genetic ghost**: your personal genomic variation that can be carried on by your descendants. Now, interestingly, even if your progeny are especially fecund, your genetic ghost probably won’t stick around that long. Just how much of your unique genetic code winds up in your grandkids, for example, depends partly on chance. It could be anywhere from 23% to 27%.\n\nYour great-grandkids will only contain 9% to 14% of you. Your great-great-great-great-great-grandchildren will, on average, be no more similar to you than you are to any stranger. In fact, it is at that distance that it becomes possible to be genetically left behind—for absolutely no personal chunks of your genome to be present in anyone. More than 70% of your ancestors from 11 generations ago aren’t in you at all.\n\nSo, you’re not so much the genetic foundation on which your progeny sit as you are their baby teeth: a thing that served a purpose but was destined to then fall out and be set aside.\n\n---\n\n## Becoming a Fossil\n\nWhere should you be buried if you want to become a fossil? Fossils last a long time. Your legacy could be representing our species in a cool, bony pose at a museum millions of years from now.\n\nWell, as it turns out, fossilization—the mineralizing of bones into rocky ghosts—is an exceedingly rare occurrence. Bill Bryson puts it this way: less than one-tenth of 1% of a species is ever lucky enough to become fossilized. Which means that millions of years from now, all that will be left of every single person alive today in the U.S. will probably just be about 60 fossilized bones—not even one full human skeleton.\n\nThe best way to improve your chances of becoming a fossil are to be buried rapidly and deeply, with no coffin, under the seafloor of a still mass of water at low elevation, where sediment deposits will be swift and fine and oxygen levels low. Some locations that fit this bill are parts of the Black Sea, the Gulf of Mexico where the Mississippi discharges, and the mangrove swamps along the northern coast of Australia.\n\nBut even then, there’s risk, right? Earth is an active, churning rock, and erosion can wear you away. Metamorphic activity could melt you back down. So if you want to be a trace for a long time, leave.\n\nThe oldest unchanged piece of Earth wasn’t even found on Earth. It was found on the moon, where geological activity is less brutal. A monolith engraved with your name and biography buried on the moon would be a good idea. Except, you know, in 5 to 10 billion years, our sun will expand into a red giant, engulfing the Earth and Moon, likely destroying them forever.\n\nSo, a copper disc coated in aluminum and gold floating through space would be even better. The golden records aboard the Voyager spacecraft could exist for trillions of years. They could conceivably still be legible even after the last star goes dim.\n\nBut your final type of ghost will be there, too.\n\n---\n\n## Your Ripple Ghost\n\nIt’s what I call your **ripple ghost**: the diffused domino effect of all of your actions. There will be people, for example, a century from now, who could enjoy the shade of a tree you planted without ever wondering who put it there. The butterfly effect effectively guarantees us all a sort of anonymous, minute immortality.\n\nJust by being born, technically you changed the universe irrevocably. The tiny and subtle but very real way your mass affects the planet Saturn right now will contribute in some extremely small way to exactly how and when its rings collapse. When the universe enters its heat death and it’s the same temperature everywhere, the arrangement of matter in the universe will be the way it is because you existed.\n\nThere will be no minds to observe it. So you won’t be remembered, but you won’t be annihilated.\n\n---\n\n## But Like… So What?\n\nBut like… so what? Oh, I’ve got ghosts that stick around. News flash, buddy: I’m not my ghosts.\n\nOkay, first of all, yeah—that’s exactly why talk of fame and legacy gets so fizzy. For what? I won’t be around to enjoy it, and eventually no one will be. But secondly, that’s actually a pretty good definition of the self: you are everything you take with you when you die. Your secrets, the things you could have done or said but never did. That’s what you are.\n\nNow, you could desperately try to do as much as you can and leave as much on the table as possible, but life is short. Too short.\n\nWell, Derek Parfit has pointed out that the brevity of life probably has nothing to do with its meaning. If your life was twice as long, would it have twice as much meaning? If we were all immortal, would the meaning of life suddenly be obvious? No. Meaning is separate from the sheer participation we crave. We just want to keep playing this game.\n\nAnd there’s never been more game to play.\n\n---\n\n## The Haunted House We Live In\n\nStaggering amounts of what we want to experience have been tamed into beasts so lightweight and so fast that, like ghosts, they can pass through walls. The “Soy Bomb” only lasted 36 seconds. But because a digital ghost of it lingers in Earth’s largest haunted house, an average of 40 people have seen it every day for the last 30 years.\n\nOld music started outselling new music for the first time in 2015. Today, we each spend an average of 7 hours and 3 minutes a day in a haunted house full of avatars and messages from the living and dead alike. People and ideas and art and the past have become not just accessible, but *accessible*. We are on these ghost portals so much it’s become pretty much the only way anyone finds companionship anymore. For crying out loud, more people on this planet own cell phones than toothbrushes.\n\n**Documentality** is the word Maurizio Ferraris gave to his ontology of traces, but it’s also a great word for the extent to which day-to-day life in a society happens as documentation. In a society of high documentality, nearly every transaction, click, step, every memory, everything said or done is vulnerable to recording—or simply comes into the world already pre-remembered, not as an ephemeral oral exchange or a haphazard note, but as a high-fidelity, timestamped, cataloged artifact.\n\nIn such a world, it shouldn’t be surprising if it starts to feel like there are more things you’ve said than things you *could* say. More ways things *have* been than ways things *could* be. The future isn’t what it used to be.\n\n---\n\n## But We’re Not Fully Documented Yet\n\nBut don’t get it twisted: complete documentality is far from here. As I’ve mentioned before, our estimates of the current human population have about a 2% to 3% margin of error. That means that about this many people may or may not exist. And at any given moment in the U.S. alone, there are about 40,000 deceased bodies whose identities are unknown.\n\nWhen Steve Fossett failed to return to the Flying M Ranch in 2007, search and rescue efforts sent to find him discovered eight previously unidentified airplane crashes that weren’t him but had been out there for, in some cases, decades. And when authorities searched for Gabby Petito, they found her and the bodies of at least eight other people they weren’t even looking for.\n\nWe are not a documented species. We are a bunch of animals walking in and out of rooms.\n\nThat said, some things changed. The last time a body was interred in the Tomb of the Unknown Soldier was after the Vietnam War, but it was removed in 1998 after DNA testing connected it to a name: Michael Joseph Blassie. In 2014, prosecutors didn’t need witnesses or security cam footage to construct what happened between Michelle Carter and Conrad Roy because they had these thousands of text messages.\n\nDespite living just 35 miles apart, Carter and Roy’s relationship occurred almost entirely through text. So these are not pieces of their relationship. They’re not evidence of the whole story. They *are* the whole story. These messages aren’t missing the glances, the nods, the way he or she said it. This is all they each saw. And we have it all—an entire human relationship that happened as, and still is, undying documents.\n\nThey’re all online, just a few taps deep in the world’s largest ocean of documentation. And we just keep filling it up, turning more and more of what we do and see into ghosts—not just to remember, but to experience.\n\n---\n\n## Living as Ghosts\n\nWhen we instinctively watch events through our phones, it’s not that we aren’t living in the moment. It’s that we are. Today, to be in the moment, you have to be fully in the moment—every part of you, even the eye you have to charge and the mind you share with others.\n\nSee what’s happening? We are not just getting more ghosts. We are beginning to live as ghosts—as an account, a like, a post, a view. And it’s great. We’re spared the humilities of confrontation. And to be an image is to be something. Frederick Douglass and Sojourner Truth knew this. They had photographic images of themselves printed up. To own and control and sell your own figural ghost meant that you had power.\n\nBut today, being a ghost surrounded by other ghosts causes a certain kind of newfangled anxiety.\n\n---\n\n## The Information-Action Ratio\n\nIn his 1985 *Amusing Ourselves to Death*, Neil Postman describes what he calls the **information-action ratio**. Now, even though this book predates the worldwide web, it may as well have been written about it. Let me ask you a modern version of a question he asks in here: How often does something you see on social media cause you to alter your plans for the day, or to take some action you would not otherwise have taken, or provide you with insight into some problem you are required to solve?\n\nWhen everything persists, irrelevance takes over. But the constant scroll of doom and pleasure and distraction isn’t just irrelevant, is it? No, it’s truly a ghost that can pass right through you. You can sit and stare for an hour and not remember a single thing you were served.\n\nWe don’t do that because it feels good. We do it because our minds want to be unsettled.\n\n---\n\n## The Unsettled Mind\n\nA never-ending scroll of decontextualized news and horror and comedy and family and backflips isn’t some unholy modern abomination of nature. It is exactly the niche we evolved to thrive in.\n\nOh no—my brain evolved to eat berries in a cave? No, it evolved to reach the lushness of Southeast Asia and then cross the Wallace Line. Not because it had to, and not because it could, but because what lay beyond was *next*. And we’ve got autoplay on.\n\nHey, let’s build a thing that floats and, like, we could fit in it. We could call it a boat. Huh? What’s that? Where will it take us? Away.\n\nWe are not the universe experiencing itself. We are the universe ignoring itself. We are the universe looking for something else. In order to be here for long, we needed to not be here for long.\n\nI don’t think it’s the risk or the challenge that motivates us. Good stories and curiosity and adventure are the icing on the cake we really desire: **unsettledness**.\n\nNot knowing what’s going to happen next can be exciting. Why? I think in the same way that long necks were selected in giraffes because no one was eating the way-up-high leaves, and in the same way that white fur was selected in polar mammals because no one was eating snow, imagination was selected in humans because no one was eating *possibilities*.\n\nAs soft apes in the midst of climatic change, those who survived didn’t wait for natural selection to provide an answer. No, they relied—as we still do today—not on evolution, but on **resolution**: on picturing and manipulating an analog world inside the theater of their own minds.\n\nUp here, we can imagine things that aren’t: hypotheticals, the distant past and future, the way things might be. We can recognize that collecting firewood now will be worth it. We can recognize that if there’s no water here, we can bring it to us. The world is not our home. It’s fuel for the fire up here, where we really live.\n\nBut because of that fire, we have made the whole world our home. Our ancestors are those hominids whose resolving never resolved.\n\nNow, sure, binge-watching TV or scrolling a social media feed are pretty different than crossing the Bering Strait, but they’re still unsettling, right? What’s going to happen next? Each next swipe brings you something different. Like the cognitive niche we built for ourselves, it never resolves. But unlike the travails of our ancestors, there’s so much less danger. We can witness and interact safely from home.\n\nLike pieces of luggage being moved at light speed without moving at all, the internet is a bounty of torques and vales—pushes that spin us around but don’t move us anywhere, and wishes not strong enough to inspire action.\n\nWe’re not amusing ourselves to death. We’re amusing ourselves to *life*—a longer, scarier life.\n\n---\n\nAnd as always, thanks for watching.\n\nDon’t forget to pre-order your very own death clock. After you’ve answered its questions and pressed the red button, the button stays locked down. It cannot change. It’s locked to your soul, to your life—unless you want to give it to someone else, or you made a mistake or something, in which case you can reset it by just poking this into the hole in the back.\n\nBut you better pre-order now, because time is literally running out.",
  "category": "PERSPECTIVES",
  "time_to_read": "18 min read",
  "article_link": "https://unhook-production.up.railway.app/article/3886fafb-e0d3-4cd9-b40b-4cef65c32887",
  "article_source": "Teerth",
  "external_id": "xHd4zsIbXJ0",
  "youtube_channel": "Vsauce",
  "published_at": "2025-07-16T01:00:01.000Z",
  "cached_at": "2025-10-11T16:57:10.370Z"
}