{
  "id": "49330030-9adc-4644-b043-cb7c0bb21bf8",
  "title": "Zubeen Garg: Assam's Rebel Singer and People's Hero",
  "content": "# Zubeen Garg: Assam's Rebel Singer and People's Hero\n\nIn a country where many Bollywood celebrities are perceived as slaves to power and money, there are very few stars who not only have the courage to stand against the system but choose to rebel against it.  \nZubeen Garg was one such rebel.\n\n## The Day Assam Stood Still\n\nOn September 19, 2025, Assam came to a standstill.  \nThat day, not only did the sea claim one life—it silenced the voice of an entire generation.  \nZubeen Garg’s name was etched into every path, every corner, every festival, and every heartbeat of the state.\n\nFrom college students to police officers, from social media influencers to office-goers—no one could hold back their tears.  \nAs one admirer put it:  \n> \"Zubeen voiced our love and heartbreaks, but he also voiced our desperation and frustration at a failing system in society.\"\n\nOffices shut down. The government announced three days of official mourning.  \nWhen Zubeen’s body returned to Assam, hundreds of thousands lined the streets for one last glimpse.  \nOn September 23, his last rites drew a record-breaking crowd—something never before seen in India.\n\nFor those unfamiliar with Zubeen’s legacy, the question arises:  \nWhy did the death of a singer bring an entire state to a halt?  \nThe answer is simple: Zubeen Garg was not just a singer.\n\n## The Early Years: A Voice Born from Turmoil\n\nZubeen stepped into the music scene in the early 1990s—a time when Assam was gripped by insurgency.  \nThe United Liberation Front of Assam (ULFA) was at its peak, and an entire generation was taking up arms, demanding a separate country.  \nOperation Bajrang had just ended, leaving behind repression, atrocities, and deep sadness among the youth.\n\nAmid this violence, Zubeen’s first album, *Anamika*, was released in 1992.  \nIt was Assam’s first rock album—and it fostered new hope.  \nHis melodies about love, despair, and hope felt like fresh air in a suffocating environment.  \nThe album was an instant hit, and Zubeen became a star overnight.\n\nOver the next few years, he delivered hit after hit, overwhelming the imagination of Assam’s people.  \nHis songs echoed in valleys, fields, and tea gardens.  \nThere was a Zubeen song for every occasion—and these songs gave people a reason to love their land and culture despite their disappointments.\n\nIn the 1990s, Assam needed Zubeen.  \nHe expressed their contradictions, insecurities, and cultural pride through music.  \nHis songs carried political defiance and cultural pride, rooted in Assam’s land, rivers, crops, and traditions.  \nAt a time when English was the language of aspiration, Zubeen made it easy to sing and speak in Assamese with pride.\n\n## Beyond Assam: Bollywood and Back\n\nBy 2000, Zubeen had become an icon across Assam.  \nHis face adorned billboards; his songs filled the air.  \nEvery year during the Bihu festival, his presence was in high demand.\n\nHe later moved to Mumbai and found nationwide fame with the song *Ya Ali* from the film *Gangster* (2006).  \nOther hits followed, like *Dil Tu Hi Bataa* from *Krrish 2*.  \nBut at the peak of his Bollywood career, Zubeen left Mumbai and returned to Assam.\n\nIn an interview, he explained:  \n> \"Bollywood had an attitude problem. I am treated like a king in Assam—and a king should never leave his kingdom.\"\n\nOver his career, Zubeen recorded more than **38,000 songs** in over **40 languages**, including Assamese, Hindi, Telugu, Tamil, Malayalam, Nepali, Bhojpuri, Bengali, and nearly every language of the Northeast.  \nHe could play **12 musical instruments**.  \nYet, despite his immense talent and output, he was grossly underpaid.\n\nHis manager, Siddhartha Sharma, revealed that the rights to Zubeen’s 38,000 songs remain with production houses and music companies.  \nZubeen received only a one-time recording fee—a stark example of how music companies exploited him.\n\n## More Than a Musician: The People’s Hero\n\nWhat set Zubeen apart was not just his musical genius—it was how he lived among the people, for the people.  \nEveryone in Assam seems to have a story about him: a photo, a memory, a moment of kindness.\n\nHe would sit on the road and eat with laborers; he helped vegetable vendors and rickshaw drivers.  \nHe stood by his people in every crisis, donating generously to social causes and helping thousands of families throughout his life.\n\nEvery day, people gathered outside his studio or home seeking help—and he never sent them away empty-handed.  \nWhether it was a wedding, funeral, medical treatment, or school fees, Zubeen helped however he could.\n\nDuring floods in Assam, he visited affected areas, collecting clothes, medicines, and funds for distribution.  \nAmid the COVID-19 pandemic, when hospitals faced bed shortages, Zubeen offered to convert his two-story Guwahati house into a COVID care center.\n\nHe adopted 15 underprivileged children.  \nOne of them was Kajali—a girl he rescued from domestic servitude and abuse.  \nZubeen not only saved her; he adopted her, fought a legal battle, and won.\n\nBecause he helped the underprivileged and stood with his people in their time of need, Zubeen was a real-life hero to many.\n\n## The Rebel: Unafraid to Challenge Power\n\nZubeen was not just a hero—he was a rebel.  \nHe questioned those in power, whether political or religious.\n\nWhen asked,  \n> \"Why do you have so much bitterness?\"  \nHe replied:  \n> \"Because I’m a rebel, I’m a fighter. I’m always a fighter. I’m not a politician, I’m a fighter.\"\n\nInspired by Che Guevara, Zubeen spoke freely and honestly, like a free bird.  \nHe never backed down from opposing ministers or politicians—he challenged them directly.\n\nHe publicly stated that all ministers and leaders in Assam were corrupt, regardless of party affiliation:  \n> \"The ministers and MLAs now, they’re corrupted. Whether they’re in BJP, Congress or another party… In Assam, they appoint such a cultural minister who knows nothing about our culture.\"\n\nZubeen, an atheist, declared he had no caste, religion, or god—he was free.  \nBorn into a Brahmin family, he openly spoke against the caste system and social discrimination.  \nAs a 12th grader, he distanced himself from his Brahmin identity, using his sacred thread to tie his mosquito net.\n\nIn May 2018, when Bollywood actor Govinda visited Guwahati to sacrifice a buffalo at the Maa Kamakhya temple, Zubeen opposed it:  \n> \"No god asks for the blood of animals.\"  \nHe added that if Govinda wanted to appease the goddess, he should have sacrificed himself, not the buffalo.\n\n## Defender of Culture—Without Chauvinism\n\nZubeen loved Assam, its language, and its culture—but he was no chauvinist.  \nIn April 2013, a faction of ULFA warned singers against performing Hindi songs during Bihu, claiming it would protect Assamese culture from \"negative Indian influence.\"\n\nZubeen was the only singer who opposed them.  \nHe refused to recognize their authority, declaring:  \n> \"Music has no language.\"  \nHe challenged ULFA, calling their stance \"outdated and utter nonsense.\"\n\nULFA threatened to shoot him.  \nYet Zubeen stood unfazed.  \nWhen the Assam government offered him security, he initially refused, saying he felt safer among the people than with a security cover.\n\nBecause of his courage, even those who disagreed with him respected him.  \nULFA later told him he was like a brother—and after his death, they paid tribute to him.\n\n## The Artist as Activist: CAA and Environmental Protests\n\nZubeen never hesitated to criticize any government that failed his people.  \nWhen the Modi administration introduced the Citizenship Amendment Act (CAA), Zubeen became the face of Assam’s resistance.\n\nHe declared:  \n> \"I would rather die than let CAA be implemented in Assam.\"  \nDuring the December 2019 protests, he actively participated, singing *Politics No Koriba Bondhu* (\"Don’t play politics, my friend\")—which became the anthem of the anti-CAA movement in Assam.\n\nHe took out rallies, launched the website **AssamAgainstCAA.in**, and urged protesters to remain non-violent while condemning government violence.\n\nEven in 2024, Zubeen continued to oppose the CAA, vowing to fight until it was repealed.\n\nHe also championed environmental causes.  \nWhen the BJP government planned to cut down trees in Guwahati for a flyover, Zubeen joined locals in protest:  \n> \"It is unacceptable to sacrifice trees for development.\"  \nHe warned PM Modi and CM Himanta Biswa Sarma that he would start a revolution if the trees were cut—even saying,  \n> \"If the government was adamant about cutting down trees, they need to cut me down first.\"\n\nThe government eventually abandoned the plan.\n\n## A Rare Breed: Celebrities Who Stand with the People\n\nZubeen’s legacy stands in stark contrast to most Indian celebrities, who often side with power rather than the masses.  \nDuring the farmers’ protests, many big-name cricketers, actors, and influencers tweeted hashtags like #IndiaAgainstPropaganda—but remained silent on issues like student protests, E20 fuel, or Ladakh unrest.\n\nZubeen was among the handful of celebrities who stood with the people and refused to bow to authority.  \nThat’s why hundreds of thousands stood with him on the streets—he inspired true respect and affection.\n\nOthers, like **Diljit Dosanjh**, **Naseeruddin Shah**, **Prakash Raj**, and **Sonu Sood**, have also shown courage in speaking up or helping those in need.  \nBut Zubeen was unique in how deeply he embedded himself in the lives of his people.\n\n## A Final Unity\n\nIn recent years, Assam’s politics reached a low point—marked by division and hatred.  \nYet, Zubeen’s death once again united the state.  \nPeople of every caste, creed, and religion came together to bid him farewell.\n\nZubeen Garg was of the people—a true artist, a rebel, a fighter.  \nHis story is a reminder of what it means to live with courage, compassion, and conviction.\n\n---\n\n*This article is based on public statements, interviews, and tributes to Zubeen Garg. His life continues to inspire millions across India and beyond.*",
  "category": "MUSIC",
  "time_to_read": "8 min read",
  "article_link": "https://unhook-production.up.railway.app/article/49330030-9adc-4644-b043-cb7c0bb21bf8",
  "article_source": "Teerth",
  "external_id": "JTZ55i-8dGk",
  "youtube_channel": "dhruvrathee",
  "published_at": "2025-10-04T18:02:47.000Z",
  "cached_at": "2025-10-11T16:56:50.063Z"
}