{
  "id": "65158f1b-d077-4864-ac90-7d1de16ff84a",
  "title": "Australia Bans Social Media for Under-16s, Sparking Global Debate",
  "content": "# Australia Bans Social Media for Under-16s, Sparking Global Debate\n\nAs our understanding of social media deepens, so does our awareness of its deadly side effects. Social media connects us, but it also breaks us apart. It is a source of knowledge, yet it is also becoming a repository for the \"WhatsApp University.\" It has the potential to build up our next generation, but perhaps it is also in the process of destroying it. One moment you're watching cute dog and cat videos, consuming educational content, and the very next moment, you can slip into a panicked state. Your self-confidence can be shredded. Because on social media, someone always has a better body, better skin, is on a better vacation, or appears to be leading a better life than you. Someone is driving a better car. Social media puts pressure on us. Almost everyone will agree with this. There is no debate here.\n\nBut now, think about this same pressure on a 12-year-old child. What must be happening to them? What must they be feeling when this immense social media pressure is bearing down on their developing minds? Chasing likes and shares—some days high, some days low—a single nasty comment, an act of cyberbullying, can shake their entire world. Self-doubt can transform into anxiety. Nights can pass without sleep. Irritability can set in. What started as a time-pass on social media can end up costing a very heavy price.\n\nYou might say I'm telling someone's exceptional story, that this is an outlier. But the truth is, this has become the daily reality for millions of children worldwide. If you turn the pages of newspapers or do a little research, you will find countless examples of social media-related stress, conflict, and self-harm among teenagers.\n\nTo tackle this problem, Australia has now taken a revolutionary and controversial step. **Australia has become the first country in the world to legally ban social media accounts for children under the age of 16.** From December 10th, if you are under 16, platforms like Instagram, TikTok, and YouTube are banned for you.\n\nThe government there says social media is not just a problem of addiction; it is a \"mental health minefield,\" especially for our children and teenagers. And if I tell you something shocking, it is this: companies like Facebook knew about this. They knew all of this. They had conducted research on addiction, but for years, they suppressed the truth.\n\nSo, if there is indeed a problem with social media and teenagers, will banning it achieve anything, or is this governmental overreach? Is it merely a government show? Or is it perhaps the first step in dealing with the havoc wreaked by social media worldwide?\n\n## The Mechanics of the Ban: What's In, What's Out, and How It's Enforced\n\nFrom December 10th, social media accounts for children under 16 are now banned in Australia. Social media platforms like Facebook, Instagram, Snapchat, Threads, TikTok, X (Twitter), YouTube, Reddit, and streaming platforms like Kick and Twitch are affected by this ban. If these platforms do not block access for children under 16, they will face penalties.\n\n**Exemptions include:** YouTube Kids, Google Classroom, and messaging apps like WhatsApp. This has also drawn criticism for not including gaming platforms and AI chatbots in the ban. The government says it will continue to renew the list and decide on further actions.\n\nThis is the first time any country has enacted such a teen ban into law. The Australian government states this was done to protect children from the risks of social media, such as cyberbullying, harmful content, online predators, and grooming.\n\nHowever, free speech campaigners in Australia argue that this ban ignores children's rights, strips teenagers of their right to information, and will push teen conversations underground, leading to the use of illegal apps with potentially more devastating effects.\n\n### But can such a teen ban even be enforced?\n\nThe responsibility for enforcing the ban has been placed on the social media platforms, not on the children or their parents. The government says platforms must take \"reasonable steps\" to verify age. This could include uploading ID, using facial or voice recognition tools, or employing AI. The exact technology to be used is not specified.\n\nWhat *is* specified is that the Australian government will impose massive fines on these platforms if they are found violating the ban by not verifying age: **up to 32 million US dollars (approximately 50 million Australian dollars).**\n\nBut even if you're not a computer scientist, you likely understand that circumventing such a ban is quite easy. It is not foolproof. Facial recognition for age estimation can be inaccurate. A legitimate user could be wrongly blocked if AI detects them as underage. In such cases, bypassing it is often easy—through hacking or rooting devices.\n\nThere are reports that in Australia, TikTok simply asks, \"Are you 16 or over?\" If you tap 'Yes,' you're verified as over 16. So, is all this a show, or is it a message the Australian government wants to send to the public? Much like wearing a seatbelt while driving or keeping school children away from alcohol and cigarettes, these rules are not always 100% enforceable, but they give the public a direction for their own welfare.\n\nAustralian Prime Minister Anthony Albanese has said this ban will give children \"the right to be a child.\" But this decision has divided parents and netizens into two camps. Some parents praise it, while others call it a drastic and authoritarian action. In any democracy, people do not like the government interfering in their lives in this manner. Some say it seems less about child safety and more about increasing government control.\n\nOne critic said, \"Parenting should be done by parents, not the nation.\" Another called it a step towards deep surveillance: \"Today teenagers, tomorrow adults.\" Others argue it will be ineffective and that instead, children and parents should be taught how to maintain online safety and why it's needed.\n\nTwo teenagers have even challenged the government's decision in the Australian High Court, claiming it is unconstitutional and violates their right to free communication.\n\n## The Platform Perspective: Business vs. Safety\n\nSocial media platforms argue the ban will be ineffective, difficult to implement, and could conversely isolate vulnerable children who use social media to anonymously share their pain, struggles, and issues with the world. The companies also say it could endanger user privacy.\n\nBut the truth is also that there is fear within social media companies that other countries might follow Australia's lead, taking similar steps that could cripple their business.\n\n## The Hidden Research: What Big Tech Knew\n\nDo we in India even know about the bad impact of social media on the teenage brain? Before understanding that, know this: whether adult or teen, everyone's data and consumption are like gold for social media companies and online operators. Your attention and your data are diamonds and pearls to them.\n\nBut the more alarming truth is that there's nothing new here—at least not for Facebook. Facebook has known all these things for years. While parents were busy deciding screen time, Big Tech companies like Facebook (Meta) were conducting research and psychological experiments on our children.\n\nWhat they discovered from these experiments was so disturbing, so damaging, that they prevented their own findings, their own research, from coming to light. It's exactly like cigarette companies knew how nicotine caused cancer but suppressed that research and lied to people.\n\nFinally, in 2021, some news reports were leaked, revealing the truth. According to a leak, Facebook had begun researching the mental effects of Instagram on younger users as early as 2019. Repeatedly, their research showed these platforms were harmful to many users, especially teenage girls.\n\nA slide from a 2019 internal presentation, reviewed by *The Wall Street Journal*, clearly states that Instagram makes body image issues worse for one in three teenage girls. A 2020 presentation revealed that 32% of teenage girls said Instagram makes them feel worse when they already feel bad about their bodies. Another slide noted that teenagers blame Instagram for their increasing anxiety and depression.\n\nThis Instagram research, based on 2019 and 2020 focus groups and diary studies, makes it clear the company was fully aware of the impact its product was having on teens' mental health. Yet, publicly, Facebook executives—who have owned Instagram since acquiring it in 2012—have repeatedly claimed their platforms do not have a significant negative impact on teens.\n\nIn fact, a lawsuit is ongoing against Meta and three other social media companies, during which several shocking allegations and data points have emerged. Last month's court filings made the major claim that **Meta deliberately downplayed the risks of its platforms for children and knowingly misled the public.**\n\nAccording to a *TIME* magazine report on these revelations—based on sworn depositions by current and former Meta executives, internal emails, and company research documents uncovered during the lawsuit's discovery process—the tactics used are not unique to Meta.\n\n### Major Allegations Against Meta:\n\n1.  **A \"Joke\" of a Threshold for Sex Trafficking Content:** Instagram's former Head of Safety and Well-being, Vaishnavi Jaya Kumar, told the court she was stunned in 2020 to learn of the company's \"17-strike policy\" for accounts reportedly involved in sex trafficking. In simple terms, an account needed to be reported at least 16 times for a serious crime like sex trafficking before it would be disabled.\n2.  **Lying to the US Congress:** Meta told Congress it did not know its platforms could be so harmful to children, despite the internal 2019 reports we just discussed, which clearly showed them that heavy use of Instagram and Facebook increased anxiety and depression rates in teens. At the end of 2019, Meta ran a deactivation study which found that if users stopped using Facebook and Instagram for a week, their anxiety, depression, and loneliness decreased. Meta immediately stopped this study and never made the results public. In December 2020, when directly asked by the Senate Judiciary Committee if they knew of a link between platform use and depression/anxiety in teen girls, Meta flatly told the court, \"No, we don't know.\"\n3.  **Knowing About Predator Connections:** Meta knew Instagram also functioned to connect teen children with unknown adults. The problem of adult users harassing and grooming teens on Instagram has been known to Facebook for years. Around 2019, Meta's researchers recommended making teen accounts private by default so that when a teen created an account, it would be private and strangers couldn't connect, even if settings were changed later. Meta refused to follow this basic suggestion because they asked their growth team how much business would be lost. The growth team replied that making teen accounts private by default would cause Instagram to lose 1.5 million active teen users every year. Therefore, despite having the technology, Meta did not launch this feature in 2020. Default privacy settings were finally implemented in 2024, under immense pressure.\n\nMeta's central business goal is this: to attract young users and keep them engaged on the platform. The truth is, you are not giving your child access to the internet; you are giving the internet access to your child.\n\nThis was proven again recently when an entire case in the US unfolded around Roblox, because the company had known for years that predators were lurking in chats under the guise of gaming, grooming and exploiting children.\n\nOften, social media companies show a minimum age of 13 to join their services. But this rule is mostly not legally enforced; rather, it's a part of self-regulation. The system relies on users wanting to state their age honestly. Therefore, the scope for mischief is vast. Surveys in several European countries show that children under 13 still use these platforms extensively, rules notwithstanding. This becomes a hunting ground for predators.\n\n## The India Debate: Ban or Educate?\n\nAustralia's decision has sparked a major debate in India. Should such a restriction, this type of ban, be imposed here as well? Would any benefit come from it?\n\nExperts in our country say the real solution is not a ban, but **education, awareness, and behavioral change**. In India, community engagement and counseling-based strategies could also be emphasized.\n\nBut the fact is that most parents are already quite troubled by their children's technology habits. They are feeling overwhelmed. Parents want to know: how do we deal with this? What should be done? What shouldn't? How do you handle a difficult situation when a child has a meltdown because their mobile or tablet is being taken away?\n\nExperts are also troubled that the effects of social media addiction on very young children are becoming clearly visible. Dr. Monica Sudhir, who works with adolescents, describes how she now frequently sees serious cases: very young children who are hyperactive, addicted to phones, and some who throw violent tantrums when devices are taken away. She says this entire issue will not be solved by law alone.\n\nExperts believe that instead of a complete ban on social media, we need to focus on and improve educational methods. From a young age, children should not be dependent on using tablets in school or relying on AI for homework. Childhood once played out in parks, playgrounds, and school corridors. Today, childhood is passing on those very screens—screens that never switch off.\n\n## The Path Forward: From Prohibition to Empowerment\n\nSocial media has become a mental health trap where a double-tap, a scroll, a small comment can become an anxiety or mental health issue. And I am not talking about a problem of the coming days. This has become today's truth, the truth for every person who has a phone in their hand today.\n\nAnd if social media is so toxic for children, imagine what is going to happen in the future—we are building an entire toxic society.\n\nTherefore, not a total ban, and not just fines and punishments either. But the government must issue a notification, an advisory. Schools must be directed that, just like smoking, drinking, and underage driving, students should be taught about social media addiction. Show them. Give them data. Show them how social media companies are engineering ways to hijack their brains.\n\nJust as \"Good Touch, Bad Touch\" is taught in schools today, there is a need to explain the difference between toxic media, non-toxic media, and educational social media, and the context involved.\n\nIf the government can think about making Aadhaar compulsory, it can certainly make this education compulsory. After that, if someone still knowingly wants to jump into a well, that's fine. Then the government can also say, \"We have done our job.\"\n\nBut the responsibility falls on us to talk to people, to teenagers, about this disease. Because in 10 years, I can assure you, we will be talking about teen social media consumption at the same level and in the same way we once debated and discussed underage drinking and smoking.\n\nWhat do you think? Will this kind of ban work in India? Write and tell us in the comments below.",
  "category": "NEWS",
  "time_to_read": "13 min read",
  "article_link": "https://unhook-production.up.railway.app/article/65158f1b-d077-4864-ac90-7d1de16ff84a",
  "article_source": "Teerth",
  "external_id": "-m8uJExpzo4",
  "youtube_channel": "thedeshbhakt",
  "published_at": "2025-12-11T16:18:02.000Z",
  "cached_at": "2025-12-12T16:42:45.645Z"
}