{
  "id": "703aad0a-2391-465c-8fef-e052d8cb72a7",
  "title": "Why Materialism is Nonsense: Bernardo Kastrup's View",
  "content": "# Why Materialism is Nonsense: Bernardo Kastrup's View\n\nWhat do you think the microphone in front of me is made out of?\n\n> I think it's made out of mental states, mind states, and the matter that we attribute to it is an extrinsic appearance and an image of mental states.\n\nThis concise answer to a deeply complicated question might raise a few eyebrows. If you asked the average person on the street what a microphone is made of, they’d likely say metal. Ask what metal is made of, and you’d eventually arrive at atoms. But what are atoms made of? Electrons. And electrons? Here, the answers begin to falter.\n\nThis line of questioning points toward a growing realization: once we reach the foundation of reality, we may be talking about something like **consciousness or mind**. This idea has gained traction recently, often discussed under labels like **panpsychism**. But according to philosopher and scientist Bernardo Kastrup, that’s not quite right either.\n\nKastrup, a proponent of **analytic idealism**, argues that **materialism—the belief that everything is made of inert, non-conscious stuff—is not only mistaken but fundamentally incoherent**. In a wide-ranging conversation, he laid out why he believes the universe is ultimately mental in nature—and what that means for us.\n\n---\n\n## What Analytic Idealism Actually Says\n\nKastrup is careful to clarify what he is *not* saying. When he claims the microphone is made of mental states, he isn’t denying the reality of metal, atoms, or the external world.\n\n> I'm not denying what appears to perception and measurement as matter, as atoms. These things are empirically verified. […] I'm not denying that there is an external world beyond my mind. What I'm saying is that this external world beyond my mind, just like my mind, is also made of mental states.\n\nThis position is distinct from **solipsism** or **subjective idealism** (the “to be is to be perceived” view of George Berkeley). Kastrup affirms that the world exists independently of any individual’s perception. Trees fall in forests with no one around to hear them. But both the tree and the forest are, at bottom, mental.\n\n> When there is a perceiver, those mental states appear to the perceiver according to the qualities that we describe as physicality: extension, texture, temperature, weight, and so forth.\n\nSo, if materialism is so intuitive, why give it up? According to Kastrup, it leads to **insoluble problems** and bleak implications.\n\n---\n\n## The Troubles with Materialism\n\n### The Hard Problem of Consciousness\nIf the world is fundamentally non-conscious, then consciousness must somehow emerge from unconscious stuff. But how?\n\n> Nobody has managed to [explain this], and I would claim it has been proven to be even an incoherent thing to try. It's wrong in principle. It's like saying, how do you reduce the number five to a marital status?\n\n### Psychological and Existential Implications\nIf consciousness is merely an **epiphenomenon**—a byproduct of certain material configurations—then:\n\n> We are oddities in the universe. We don't really belong here. We are a peculiar accident that's coming to an end. […] I'm already dead; I just don't know it yet. Everything is ultimately for nothing.\n\nThese aren’t just philosophical concerns. They shape culture, psychology, and our sense of meaning.\n\n---\n\n## Qualities vs. Quantities: What Science Actually Does\n\nA key point in Kastrup’s critique involves the distinction between **qualities** and **quantities**.\n\n- **Qualities** are the contents of perception: colors, sounds, textures, flavors.\n- **Quantities** are *descriptions* of those qualities: length, mass, charge.\n\n> Quantities are descriptions of what appears on the screen of perception, which of course is eminently qualitative. Everything on the screen of perception is qualitative.\n\nScience excels at modeling and predicting behavior through quantitative description. But it does not—and cannot—tell us what things *are* in themselves.\n\nKastrup uses a powerful analogy:\n\n> Imagine you’re hiking in the mountains with a map. The map describes the terrain. But at some point, people began to think the mountain *emerges* from the map. We’re doing this while standing on the mountain!\n\nWe are immersed in qualitative experience, yet we’ve come to believe that only the quantitative descriptions are real.\n\n---\n\n## If Not Matter, Then What?\n\n### The Mind Is All There Is\nKastrup’s position is a form of **idealism**: the view that reality is fundamentally mental. But his version—**analytic idealism**—is rigorously argued and consistent with empirical evidence.\n\nHe illustrates his view with a thought experiment:\n\n> Imagine an alien observing you. It might conclude: “That’s all there is to Alex—just the set of images I perceive.” But you know that’s wrong. Underlying the external appearance is your **inner life**—the real you.\n\nNow, consider this:\n\n> Your body is made of the same atoms and force fields as the rest of the universe. Clearly, your body is how your mental inner life appears to outside observation. So the same should hold for the rest of the universe.\n\nIn other words, **matter is the extrinsic appearance of inner mental states**.\n\n### Not Everything Is Conscious\nKastrup does not claim that rocks or microphones are conscious. Rather, all matter is the **outer appearance** of mental activity. Some of that mental activity is organized into **conscious subjects** (like us); much of it is not.\n\n---\n\n## Dissociation and the Illusion of Separate Selves\n\nHow do we get many individual minds from one underlying reality? Kastrup turns to psychology:\n\n> In psychiatry, this has been known for 200 years as **dissociation**.\n> \n> When you dream, you are dissociated. You identify with your dream avatar, but upon waking, you realize you were the whole dream.\n\nHe proposes that **we are alters in a cosmic mind**—dissociated personalities in a universal consciousness. This isn’t meant as a metaphor for illness, but as a natural process.\n\n> Given enough time, dissociation in the mind of nature was bound to happen. Lo and behold, it did.\n\nWhat does a dissociated complex look like from the outside?\n\n> It looks like a biological organism. […] Life itself may be the appearance of dissociation in the mind of nature.\n\n---\n\n## Why Not Panpsychism?\n\nKastrup reserves some of his strongest criticisms for **micro-constitutive panpsychism**—the idea that elementary particles possess consciousness.\n\nThe problem, he says, is that **particles aren’t things**.\n\n> In physics, we have known for at least 80 years that there are no particles. […] They are identifiable patterns of excitation of an underlying quantum field.\n\nIf particles aren’t discrete entities, then building individual minds out of them is a non-starter.\n\n> The moment you associate separate subjectivities to each particle, you are no longer consistent with physics.\n\n---\n\n## So, Does the Self Exist?\n\nKastrup is clear: the **personal self**—the narrative “I” born on a certain date, with a certain history—is an **illusion**.\n\n> Not a single atom in the body of your 5-year-old self has remained in yours all this time. Your thoughts are different, your emotions, your outlook, your appearance. It's preposterous to say you were your 5-year-old self.\n\nBut an illusion is not nothing. It must be explained. The sense of self arises from the **integration of mental states** into a complex—a process studied in **Integrated Information Theory**.\n\nWhat *does* exist is **core subjectivity**—the ground of experience itself.\n\n> The most parsimonious metaphysical hypothesis […] is that this core subject […] is the only thing that exists, and the myriad different qualities of experience are just different patterns of excitation of the self.\n\n---\n\n## Is This Religion in Disguise?\n\nKastrup’s view undeniably echoes certain religious traditions, particularly **Hinduism** and **pantheism**. He acknowledges this:\n\n> I would be dishonest if I didn’t say yes to this. […] You could say the universe is God dancing.\n\nBut he guards against anthropomorphism:\n\n> I don't think [this mind] is deliberate. I don't think it had a plan. I don't think it's passing moral judgment. […] It is simply unfolding its own mental archetypes in a spontaneous, regular, predictable manner.\n\n---\n\n## Conclusion: A Call to Rethink Reality\n\nKastrup leaves us with a challenge:\n\n> Physicalism is the most magical, arbitrary, gratuitous, inflationary, ridiculous metaphysical alternative on the table.\n> \n> The only reason you think what I'm saying is mind-blowing and physicalism is level-headed is **cultural indoctrination**.\n\nHis case is not built on mysticism, but on **coherence, parsimony, and empirical consistency**. He advocates for:\n\n- **Rationalism**\n- **Determinism**\n- **Reductionism**\n- **Monism**\n\n…the very values materialists claim to uphold.\n\n> We espouse the same values, but I submit to you that the only reason you think what I'm saying is mind-blowing and physicalism is level-headed is cultural indoctrination.\n\nIf you take one idea from this discussion, let it be this: **matter is what mind looks like from the outside**. The universe is not a dead, mechanical thing—it’s a living, mental reality. And we are not accidental tourists in a foreign land, but dissociated fragments of a conscious whole.",
  "category": "PERSPECTIVES",
  "time_to_read": "8 min read",
  "article_link": "https://unhook-production.up.railway.app/article/703aad0a-2391-465c-8fef-e052d8cb72a7",
  "article_source": "Teerth",
  "external_id": "DrMEL20o5KE",
  "youtube_channel": "CosmicSkeptic",
  "published_at": "2025-11-02T19:57:43.000Z",
  "cached_at": "2025-11-04T17:18:04.979Z"
}