{
  "id": "80e1b152-2f7a-4a91-8748-96579cccaa00",
  "title": "Pakistani Leader Admits to Attacks on India from Red Fort and Kashmir",
  "content": "# Pakistani Leader Admits to Attacks on India from Red Fort and Kashmir\n\nIn a startling speech delivered at a recent assembly, Chaudhry Anwar ul Haq, the Prime Minister of Pakistan-occupied Kashmir (PoK), openly admitted that Pakistan-backed militants have carried out attacks on India—specifically mentioning strikes originating from the historic Red Fort in Delhi and the forests of Kashmir.\n\n“If you spill blood in Balochistan,” he declared, “we will hit you from the Red Fort. We will hit you from the forests of Kashmir. By the grace of Allah, our brave boys have done this work.”\n\n---\n\n## A Revealing Admission\n\nThe statement, made during a lengthy and fiery address, amounts to a rare public acknowledgment of Pakistan’s alleged involvement in cross-border terrorism. While political rhetoric in the region is often charged, the specificity of the locations—the Red Fort and Kashmir—lends the claim significant gravity.\n\nTwo interpretations emerge from his words:\n- It could be political bluster—an empty threat made for domestic consumption.\n- Or it could be a genuine admission, reflecting operational knowledge of attacks planned and executed with the support of Pakistani authorities.\n\nGiven that militant operations in PoK typically require at least tacit approval from local authorities—and often direct coordination with Pakistan’s Inter-Services Intelligence (ISI)—the latter interpretation cannot be easily dismissed.\n\n---\n\n## Context: A Government in Crisis\n\nChaudhry Anwar ul Haq’s position is far from secure. Just days before this speech, a no-confidence motion was passed against him. Several ministers resigned in October, accusing him of failing to govern PoK effectively, mishandling the rights of 2.5 million refugees, and allowing unrest to grow—all while making provocative statements in the assembly.\n\nHis speech was reportedly delivered to an almost empty house, attended only by a handful of loyalists. The political pressure on him is immense, and some analysts suggest his inflammatory rhetoric may be an attempt to divert attention from domestic failures.\n\n---\n\n## Corroborating Evidence and Narrative Warfare\n\nThe admission aligns with intelligence and open-source claims circulating in India. On platforms like Telegram, handlers linked to groups such as Jaish-e-Mohammed, Jamaat-ul-Mujahideen, and Ghazwat-ul-Hind have reportedly taken credit for the Red Fort attack, further pointing toward Pakistani involvement.\n\nIndia has so far not publicly presented concrete evidence linking the attack to Pakistan—but now, a Pakistani leader appears to have done that job for them.\n\nMeanwhile, Pakistan’s Defense Minister Khawaja Asif has warned his nation to “stay alert,” claiming India could take action at any time. This reflects a broader narrative battle, one which—according to the speaker—Pakistan is currently winning.\n\n“Pakistan is winning the narrative war,” he argued, “and India needs to counter it.” He suggested India establish a dedicated department for countering misinformation and shaping public perception—something India has so far resisted, preferring to “respond through action.”\n\n---\n\n## The Geopolitical Angle: U.S., China, and Turkey\n\nThe speech also touched upon Pakistan’s shifting international alliances. While China has long been a key partner, it has recently begun scaling back funding for projects under the China-Pakistan Economic Corridor (CPEC). The U.S., meanwhile, remains a nominal supporter—but one driven more by transactional interests than strategic alignment.\n\nRecent U.S.-India deals—such as the LPG energy agreement and the potential purchase of anti-tank missiles—signal Washington’s pragmatic tilt toward New Delhi. As the speaker noted, “America just sees India as a shopkeeper—you take the goods, pay the money, that’s it.”\n\nPakistan, however, appears to be banking on the possibility of a limited conflict to divert attention from its severe internal crises—and to position itself as a key player in any U.S.-brokered peace process, especially under a potential second Trump administration.\n\n---\n\n## India’s Position: Restraint and Readiness\n\nIndia has so far responded with restraint. The country is focused on development, pollution control, and upcoming state elections—not war. Yet, as the speaker noted, India is not unprepared.\n\nChanges in India’s military doctrine now treat terrorism as an act of war. The induction of specialized units like the Rudra and Bhairav battalions signals a more proactive stance. India has also significantly strengthened its positions in the Northeast, conducting exercises and accelerating development—a move that has not gone unnoticed in Beijing.\n\nWhile Pakistan continues to promote its “bleed India” doctrine, the speaker argued that in reality, it is Pakistan that is bleeding—from internal violence, a crumbling economy, and deteriorating relations with the Taliban.\n\n---\n\n## Conclusion: A Dangerous Escalation?\n\nChaudhry Anwar ul Haq’s speech is more than just political theater. It is a public admission that adds fuel to an already volatile situation. Whether it represents official policy or the desperate rhetoric of a weakened leader, it underscores the persistent use of cross-border militancy as a tool of policy.\n\nIndia now has not only forensic and intelligence evidence but also a public statement from a Pakistani leader to support its long-standing accusations. The question is: how will it respond?\n\nAs the speaker concluded: “Hopefully, conflict won’t happen. But if it does, Pakistan won’t survive it.”\n\n---\n*This analysis is based on a public address and should be understood within the context of ongoing India-Pakistan tensions. Further developments are expected as official reactions emerge.*",
  "category": "NEWS",
  "time_to_read": "5 min read",
  "article_link": "https://unhook-production.up.railway.app/article/80e1b152-2f7a-4a91-8748-96579cccaa00",
  "article_source": "Teerth",
  "external_id": "5aQXkavlhfY",
  "youtube_channel": "StudyGlows",
  "published_at": "2025-11-20T03:51:01.000Z",
  "cached_at": "2025-11-20T15:01:15.201Z"
}