{
  "id": "83598240-11d6-4c34-8efd-f3ea0bc5bf63",
  "title": "Raghuram Rajan: India Will Never Trust the US",
  "content": "# Raghuram Rajan: India Will Never Trust the US\n\n## Introduction\n\nIndia and the United States are currently at a critical juncture in their diplomatic and economic relationship. Former Reserve Bank of India Governor Raghuram Rajan, now a professor at the University of Chicago, has made a striking statement during a recent event, asserting that India will never fully trust the US again. His comments come in the wake of controversial tariff decisions and shifting geopolitical alignments that have deeply strained bilateral ties.\n\n## The Core Issue: Tariffs and Trust\n\nRajan pointed to the stark disparity in US tariff policies: **50% tariffs on India** compared to just **19% on Pakistan**. He emphasized that such actions have inflicted deep and lasting damage on the trust between the two nations. On record, Rajan stated plainly: **\"The US cannot be trusted.\"** This sentiment, voiced while he was in the US itself, underscores the severity of the breach.\n\nHe elaborated that these tariff measures—alongside other statements and actions targeting India—have pushed the India-US relationship to its limits. Rajan expressed surprise that military cooperation has so far remained intact, calling it \"good news,\" but questioned the logic of maintaining defense partnerships while imposing the world’s highest tariffs on the same partner.\n\n> \"How can it be that on one hand, I impose the highest tariffs on your country... and on the other hand, India will engage in defense partnership with the US?\"\n\n## The Friendship Paradox: Modi and Trump\n\nRajan also addressed the much-publicized personal rapport between Prime Minister Narendra Modi and former US President Donald Trump. He questioned the sincerity of this friendship in light of the aggressive trade stance.\n\n> \"Where is the friendship between Modi and Trump that was extolled? It’s a slap in the face for Modi.\"\n\nHe noted that the Indian opposition has seized on this contradiction, asking how a \"great friend\" could treat India as the \"most tariffed country\" in the world.\n\n## The Geopolitical Shift: US-China Rapprochement\n\nA major concern Rajan highlighted is Trump’s sudden foreign policy pivot toward China. The idea of a **G2 partnership** between the US and China represents, in Rajan’s view, one of the biggest geopolitical changes in the coming years.\n\nAn article in *The Tribune* summed up India’s unease with the phrase: **\"G2 won’t be music to India’s ears.\"** For India, the optimal scenario was competition between the US and China, which would allow India to benefit from US technological and manufacturing support. Instead, Trump’s announcement of improved relations with China—including assurances on Taiwan and collaboration within a G2 framework—forces India to reevaluate its entire strategic position.\n\n## India’s Response: Strategic Recalibration\n\nIn response to these developments, India is already signaling a shift. Defense Minister Rajnath Singh recently announced plans to purchase **more S400 missile defense systems from Russia**, openly defying US pressure. India has also not fully halted oil purchases from Russia.\n\nRajan observed that the world seems to be reverting to the alignment of 20 years ago: close US-Pakistan ties, strong India-Russia relations, and a US-China G2 proposal reminiscent of the Obama era.\n\n> \"Unless a breakthrough understanding happens, you will see India gravitate more toward Russia, and distances will continue to grow in India-US relations.\"\n\n## The Long-Term Damage\n\nRajan believes the damage done during the Trump era is profound. Even if a new US administration takes over, recovery could take **up to eight years**, unless quick corrective actions are taken. If high tariffs remain for two to three years, India-US trade could be halved.\n\n## India’s Current Strategy: Wait and Watch\n\nFor now, India’s strategy appears to be one of restraint. Despite Trump’s statements and tariff policies, India has not retaliated with reciprocal tariffs—unlike China, which responded in kind during its trade war with the US.\n\nIndia’s approach seems to be: **\"Do nothing, and by doing nothing, we might win.\"** This is partly because the US Supreme Court is yet to rule on the President’s authority to impose such tariffs. If the Court strikes them down, it would be a major victory for India. If it delays, India may need to urgently pursue a trade deal with the US.\n\n## Military Cooperation Continues—For Now\n\nDespite trade tensions, strategic military cooperation continues. The **Malabar Naval Exercise** between India and the US began recently and will continue for nine days. This sends a mixed signal: even as trust erodes on the economic front, defense ties remain active.\n\n## Conclusion: History in the Making\n\nRaghuram Rajan’s analysis paints a sobering picture of India-US relations. Trust has been deeply wounded, and the path to repair is long. With the US tilting toward China and India leaning back toward Russia, the world order appears to be cycling back to an earlier era.\n\nAs Rajan put it: **\"You are watching history in the making right now.\"** How India navigates this complex landscape will shape not only its future, but also the balance of power in the Indo-Pacific and beyond.",
  "category": "NEWS",
  "time_to_read": "5 min read",
  "article_link": "https://unhook-production.up.railway.app/article/83598240-11d6-4c34-8efd-f3ea0bc5bf63",
  "article_source": "Teerth",
  "external_id": "JEn0KoLUWug",
  "youtube_channel": "Career247Official",
  "published_at": "2025-11-10T11:02:23.000Z",
  "cached_at": "2025-11-10T14:46:38.884Z"
}