{
  "id": "8db51de0-06ca-4fc3-9707-2e22669ad71a",
  "title": "Trump Threatens 100% Tariffs on China, Markets Panic",
  "content": "# Trump Threatens 100% Tariffs on China, Global Markets Panic\n\nIn a move that has sent shockwaves through global financial markets, former U.S. President Donald Trump has announced the potential imposition of 100% tariffs on Chinese goods. The announcement, made via his social media platform Truth Social, triggered a massive sell-off across U.S. and international markets, wiping out over $1.6 trillion in market value and creating an atmosphere of widespread panic.\n\n## The Announcement and Immediate Fallout\n\nTrump declared that tariffs on China could be raised to 100%—or even as high as 130% when combined with existing duties—in response to what he described as China’s “extremely hostile” trade position. The threat came after reports surfaced that China had been urging other nations not to export rare earth minerals and magnets to the United States.\n\nThe market reaction was swift and severe:\n- Major U.S. tech stocks, including Tesla and Amazon, plunged into the red.\n- Bitcoin fell by nearly 10%.\n- Over $1 billion in cryptocurrency was liquidated in what analysts called one of the worst sell-offs in crypto history.\n- Asian and European markets also braced for turbulence as fears of a renewed U.S.-China trade war intensified.\n\n## What Prompted the Escalation?\n\nThe friction stems from a recent U.S. Senate proposal to ban Chinese airlines from using Russian airspace on flights to the United States. Because U.S.-Russia relations remain strained, American carriers cannot use the shorter northern route over Russia, putting them at a competitive disadvantage. Chinese carriers, by contrast, regularly fly over Russia, saving time and fuel.\n\nIn response to the proposed U.S. ban, China reportedly issued letters to multiple countries, including India, demanding guarantees that rare earth magnets supplied by China would not be resold to the U.S. This move was perceived by the Trump camp as an “unprecedented” and aggressive attempt to control global supply chains and isolate the U.S. economically.\n\n## Political Context: Nobel Prize Controversy Adds Fuel\n\nCoinciding with the trade dispute is Trump’s public frustration over not receiving the Nobel Peace Prize. White House communications staff and pro-Trump politicians have openly criticized the Nobel committee, accusing it of prioritizing politics over peace. While Trump’s anger over the Nobel snub is a separate issue, it underscores the tense and volatile political backdrop against which these trade threats have emerged.\n\n## Upcoming APEC Summit in Jeopardy\n\nThe timing of Trump’s tariff threat has cast doubt on a planned meeting between Trump and Chinese President Xi Jinping at the upcoming Asia-Pacific Economic Cooperation (APEC) summit in South Korea. Trump hinted in a follow-up tweet that he may no longer see the point in meeting with Xi, signaling a further deterioration in U.S.-China relations.\n\nThe summit was also expected to host Indian Prime Minister Narendra Modi as a special guest, with hopes of facilitating a Modi-Trump meeting to help repair U.S.-India relations. Now, the entire diplomatic agenda hangs in the balance.\n\n## What Comes Next?\n\nMarkets are bracing for China’s retaliation, which could include counter-tariffs on U.S. goods. With the official tariff announcement expected by November 1, 2025, investors remain on edge. Some analysts speculate that Trump’s threats could be a tactical move to temporarily depress markets before a reversal, but the uncertainty has already triggered a global financial tremor.\n\nAs one commentator noted, “Things are about to get a lot worse.” The world watches closely to see if the two economic giants can step back from the brink or if a full-blown trade war is now inevitable.\n\n---\n*Image: Composite illustration of Donald Trump and stock market charts trending downward.*  \n*Source: Analysis based on recent statements, market data, and geopolitical context.*",
  "category": "BUSINESS",
  "time_to_read": "4 min read",
  "article_link": "https://unhook-production.up.railway.app/article/8db51de0-06ca-4fc3-9707-2e22669ad71a",
  "article_source": "Teerth",
  "external_id": "nLRh1cU1_6k",
  "youtube_channel": "Career247Official",
  "published_at": "2025-10-11T10:44:25.000Z",
  "cached_at": "2025-10-13T15:06:31.054Z"
}