{
  "id": "8e007a86-0545-46a9-9dae-83469b43f4a9",
  "title": "The Urgent Need for Right to Disconnect in India",
  "content": "**The Urgent Need for a “Right to Disconnect” in India**\n\n---\n\n### Introduction: A Tragic Wake-Up Call\n\nIn a heartbreaking incident last year, a young, ambitious woman joined a corporate firm—Ernst & Young—full of hope and drive. Just four months later, she was dead.\n\nThe reason? She was so overburdened with work that she was continuously working on her laptop, even after office hours. Whether due to pressure from managers or looming client deadlines, she couldn’t handle the stress. She wasn’t eating properly, wasn’t sleeping properly. Ultimately, her body collapsed.\n\nHer name was Anjali Ambast. Imagine—a young woman, just starting to build her career, collapsing in only four months because of work pressure, because of a toxic work culture.\n\nThis is not an isolated case. Similar incidents have occurred:\n- An IIT/IIM graduate died by suicide, with police suspecting work pressure.\n- An HDFC Bank manager in Lucknow died at work, with colleagues pointing to excessive work pressure.\n\nWorkers today are under immense pressure to meet client demands and organizational targets. Often unknowingly, they are pushed beyond their limits, leading to physical and mental collapse. There is an urgent need to prevent such tragedies—and that step is the **Right to Disconnect**.\n\n---\n\n### What Is the “Right to Disconnect”?\n\nAt first glance, “Right to Disconnect” sounds like a fascinating term. But what does it actually mean?\n\nIf your official duty time is, say, 10 AM to 6 PM, then once you finish work and leave the office, **you have the right**:\n- Not to maintain any connection with the office.\n- To switch off your mobile.\n- Not to reply to any calls, texts, emails, or client demands.\n- To say “no” to emergency Zoom meetings—without being penalized.\n\nNo punitive action, no monetary deduction, no threat of job loss. You’ve completed your office work during office hours. Now, you need time for yourself—to rejuvenate your body, mind, and soul. Time to spend with family and friends. Time to sleep peacefully.\n\nUltimately, the human resources—the workers—are the real assets of any company. If they are healthy and happy, the company will grow. They are not mechanical robots. They need time to rest, sleep, and connect with loved ones.\n\n**Definition**:  \nThe Right to Disconnect is a regulation that empowers employees to ignore work-related communication—be it email, text messages, or phone calls—outside their official working hours.\n\n---\n\n### Why Is This Right So Urgent Now?\n\nWork pressure and toxic work culture have intensified, especially **post-COVID-19 pandemic**.\n\nDuring the pandemic, work-from-home became the norm, and the fine line between “work” and “home” was completely blurred. Companies began to assume that since workers were already at home, comfortably situated, there was no time limit. Meetings ran late into the night—midnight, 1 AM.\n\nThis mindset exacerbated work pressure and toxic culture in the post-pandemic era.\n\n---\n\n### Global Practices: Who Is Already Doing This?\n\nSeveral countries have recognized and implemented the Right to Disconnect:\n\n- **France**: One of the pioneering countries, it protects employees from penalties for being unreachable after hours.\n- **Portugal**: Restricts employers from contacting workers outside official hours, except in emergencies (clearly defined).\n- **Spain (2018)**: Ensures workers can switch off their devices after work hours.\n- **Ireland (2021)**: Recognized the Right to Disconnect for employees after working hours.\n- **Australia**: Recently enforced under the Fair Work Legislation Amendment.\n\nThese laws can serve as role models for India.\n\n---\n\n### Where Does India Stand?\n\nIndia does **not** yet have a specific “Right to Disconnect” law. However, certain provisions in Indian law implicitly support this idea:\n\n- **Article 38** of the Constitution promotes people’s welfare, including workers’ welfare.\n- **Article 39** safeguards workers’ health and strength.\n- **Judicial Support**:\n  - **Vishakha Guidelines vs. State of Rajasthan** recognized dignity in the workplace, especially for women facing harassment.\n  - **Ravindra Kumar Dhariwal vs. Union of India** emphasized that employers must consider an employee’s individual differences and capabilities. The court stated that employers should recognize a worker’s capacity and not force work upon them beyond office hours.\n\nIn 2018, MP Supriya Sule introduced a **Right to Disconnect Bill** as a private member’s bill, but no concrete action followed.\n\n---\n\n### The Stark Reality: Data from India\n\n- A study by the **ADP Research Institute** found that **49% of Indian workers** said work-related stress negatively impacted their mental health.\n- A French politician, Benoît Hamon, aptly said: *“Employees physically leave the office, but they do not leave their work.”*  \n  Companies keep workers tied with an “electronic leash”—through smartphones, emails, and chats. Workers live in constant anxiety: *“Did I get an email? Is there some new task?”*\n- According to an **ILO report**, Indians work **46.7 hours per week** on average.\n- **51% of Indian employees** work more than 49 hours per week—well above the standard 8-hour/day norm.\n\nCompare this to developed nations:\n- USA: ~38 hours/week\n- Japan: ~36 hours/week\n- UK: ~35.9 hours/week\n\nSome Indian corporate voices have even advocated for extreme work hours:\n- **Narayana Murthy** (Infosys) suggested **70 hours/week**.\n- An unnamed corporate hall chairperson demanded **90 hours/week**.\n- **Elon Musk** once spoke of **120 hours/week**.\n\nThese numbers are staggering. If workers are treated as robots—only as money-minting machines—their well-being is ignored, and the consequences are severe.\n\n---\n\n### Benefits of the Right to Disconnect\n\n1. **Improved Work-Life Balance**\n2. **Reduced Stress & Burnout** (emotional, physical, mental)\n3. **Increased Productivity** (happy employees are more productive)\n4. **Healthier Workforce** (fewer mental and physical health issues)\n5. **Reduced Burden on Public Health Systems**\n6. **More Economic Growth** (a happy workforce contributes better)\n\n---\n\n### Challenges & Counterarguments\n\n1. **Impact on Business Growth**  \n   - Small businesses, especially in the informal sector, may struggle with fixed timelines.\n2. **Increased Response Time**  \n   - If a client has an urgent demand and the worker is unavailable, decision-making gets delayed.\n3. **Reduced Flexibility of Employees**  \n   - Sometimes an extra half-hour can wrap up a project neatly—this flexibility may be lost.\n4. **Global Competitiveness**  \n   - With high unemployment and intense competition, some argue that Indians need to work harder and longer to make products globally competitive.\n\n---\n\n### The Way Forward\n\n1. **Enact the Right to Disconnect** and implement it on a pilot basis.\n2. **Learn from the outcomes**—see what works and what doesn’t.\n3. **Balance high productivity with protecting employees’ mental and physical health**.\n4. **Introduce workplace reforms**:\n   - Cultivate a **sympathetic heart**, not a toxic work culture.\n   - Assess an employee’s **capability and performance** before assigning work.\n   - Avoid abusive language and disrespectful behavior.\n5. **Learn from global best practices** (France, Spain, Portugal, Australia, Italy).\n6. **Adapt solutions to the Indian context**—Indian society is complex, and its problems are unique. But we must start somewhere.\n\n---\n\n### Conclusion\n\nUltimately, what we need is a **healthier workforce** that is **happy**.  \nIf your workforce is happy, company productivity will automatically increase.\n\nLet’s move toward a future where no more young lives are lost to overwork, where dignity and well-being in the workplace are non-negotiable.\n\n---\n*Thank you, and all the best.*",
  "category": "BUSINESS",
  "time_to_read": "6 min read",
  "article_link": "https://unhook-production.up.railway.app/article/8e007a86-0545-46a9-9dae-83469b43f4a9",
  "article_source": "Teerth",
  "external_id": "YcnaRzrRiEI",
  "youtube_channel": "StudyIQEducationLtd",
  "published_at": "2025-09-30T04:30:06.000Z",
  "cached_at": "2025-10-09T17:15:22.228Z"
}