{
  "id": "945392d1-53bb-477d-829c-d97a87c3ba28",
  "title": "Are Tech IPOs Exploiting Retail Investors in India?",
  "content": "# Are Tech IPOs Exploiting Retail Investors in India?\n\nThe lens is clearly focused on the big story of the day. Lenskart is finally making its market debut with the much-awaited Lenskart IPO. You are looking at a post-money valuation of almost ₹70,000 crore in terms of market capitalization. There is a lot more to do ahead.\n\n**\"I'll get you a ₹7,000 crore IPO.\"**\n\nIndia is the \"dumbest IPO market that ever existed in the history of IPO markets.\"\n\nAre you judging the people who invested in us as \"dumb\"?\n\nThe retail investor who put money into Vijay Shekhar Sharma's Paytm turned out to be \"dumb\" four years later. The question now is this: after investing in Lenskart and all the new tech IPOs, will more \"dumb\" people be created in our country, or will they learn some lessons from history?\n\nWhen the much-hyped brand Lenskart's IPO finally arrived in the market, there were no firecrackers in the stock market, nor any celebratory feelings in the hearts of retail investors. For Lenskart's ₹7,000 crore IPO, bidding happened for over ₹1 lakh crore. Meaning, it was oversubscribed more than 28 times. Many must have thought, \"It's a tech stock. If we get some shares, then on the listing day, it will be profit, money, money, money!\"\n\nAfter all, the company's founder, Peyush Bansal, is a big shark on Shark Tank, a role model for young and aspiring entrepreneurs. So many people see him as an inspiration. Lenskart's name is known to many; it's famous in every household. Whatever little was left to be desired was completed by influencer marketing before the IPO.\n\nAvailable in a price band of around ₹400, this IPO was brought to the market so that the lens company's valuation would reach ₹70,000 crore, a figure that is close to 90% of our country's total eyewear market size. This very ₹70,000 crore valuation—this *overvaluation*—had already caused an uproar over the past several days. If you look at the company's Profit-to-Earnings or P/E ratio, it was said to be 230 at this valuation, which was many times higher than the average P/E ratio of any normal stock.\n\nThe funny thing is that Peyush Ji himself would not invest in Lenskart. If this P/E number was 70—forget 230, even if it was 70—he still wouldn't invest. Because Peyush Ji has told us for years on Shark Tank that he only invests in companies where the P/E ratio is a normal 15 to 20, or at a maximum, not more than 30.\n\nMany other people spotted red flags in the Lenskart IPO. A loss-making company that suddenly becomes profitable just before the IPO due to a one-time settlement—just by chance. Peyush Ji himself buys back this company's stock at ₹52 per share in the month of July, and that very share is available to you and me in November in a price band of ₹382 to ₹428. What a miracle! Look at how valuations increase in just months.\n\n**Something is wrong.**\n\nIn stock market language, this is called a \"pump and dump\" scheme. And Peyush is not the only founder who has printed a lot of money on the backs of institutional and retail investors. From this IPO, Bansal has already earned ₹800 crore, while retail investors got a 2% return on the first day. But the problem is this: if Lenskart's story goes the way of Paytm, Nykaa, Mamaearth, Ola Electric, etc., then even that 2% return will slip from their hands.\n\nBecause by hyping the IPO and bringing it to market, founders in today's date are more focused on making money themselves by selling their shares and exiting, rather than taking the company forward. And this has now become a trend. In the end, the retail investor is left with overpriced, loss-making shares in the name of a tech company.\n\nThis is why you need to be cautious.\n\n## The Paytm Precedent: A Cautionary Tale\n\nExactly four years ago, the largest IPO of that time came to the market: Paytm, or One 97 Communications. Its IPO came in November 2021, and the hype was so immense that it would put even this Lenskart frenzy to shame. The whole country was celebrating as if a festival had arrived because Paytm's valuation was reaching ₹1.4 lakh crore, and Paytm's ₹18,300 crore IPO was seen as India's financial unicorn movement. \"Now India has achieved it!\"\n\n\"Bro, UPI has arrived!\" This payment method is not like a credit card or debit card. It was being called a revolution. And CEO Vijay Shekhar Sharma at that time was calling it the \"gateway to a cashless economy,\" saying \"our horses will be set free.\" \"UPI will change the definition of the country.\" \"Even America will drink water in front of us.\" Global venture capitalists, Alibaba, SoftBank had poured money into it eagerly. So much money was spent. As far as promotion and ads were concerned, people were very excited about this IPO.\n\nBut what people weren't seeing at that time—because we only believe in the hype—was the \"path to profitability,\" which we never actually thought about in the tech sector. \"How will the company actually make money?\" Because it was being said, \"We will get data. If we get data, we will give loans. If we give loans, we will get money.\" This is what was used to sell this stock.\n\nSharma had his own social media blitz, his own credibility. He would give full knowledge, and because of this, the subscription was also 1.8 times oversubscribed. If we talk about valuation, it was running at 44 times valuation, while the company was loss-making. The path to profitability was not visible. All these things, plus the hype, and we also forgot about Google Pay and other wallets that were coming.\n\nBasically, what was happening here—and what we can see in many cases—was that the venture capitalists wanted to take out their money. \"Bro, we've thrown this stock on you, the retail investor. We are cutting ourselves out, making a fat profit through a thin exit.\"\n\nOn the listing day itself, the stock went down 9%. \"It's okay, it only went down 9%. There's UPI. The country's transformation will happen. We'll bear a little pain.\" But after that, the stock kept going down. It went down by 70%. By mid-2022, it reached around ₹600. RBI also banned Paytm Payments Bank. And now, when the company is trying to focus again on its core competencies and business, by November 2025 the share has come up a little, but even after so many years, it still hasn't matched its IPO price.\n\nSo, as far as movies are concerned, Vijay Dinanath Chauhan was a star in his time, and Vijay Shekhar Sharma also didn't consider himself any less than Amitabh Bachchan in the financial world. But now he is trying to make Paytm better. He has learned his lessons. The question is, have you and I learned anything from the market? Probably not.\n\nBecause if we had learned, we would have sensed how big a scam was going on with the \"Elon Musk of India.\"\n\n## The Ola Electric Mirage\n\nAs far as Ola is concerned, bored with Ola Cabs, Bhavish Aggarwal set up Ola Electric and was already a star on Twitter. He took up the slogan of \"Make in India EV Revolution.\" The product wasn't even properly established. People didn't even properly test the product; they just imported an EV scooter from outside. But they didn't delay in launching the IPO—launched an IPO of more than ₹600 crore with a valuation of ₹33,000 crore. Even big two-wheeler companies were left watching, and such a big IPO came to the market. People kept pouring money into it, oversubscribing the IPO 4.26 times.\n\nThey claimed a 35% market share in electric two-wheelers, so people happily oversubscribed. \"Bro, we are building a giga factory. We will beat Tesla before it even arrives in India.\" \"Look how many people are pre-booking us.\" On top of that, they created a patriotic tech narrative. Nowadays, in the name of patriotism, people run their businesses, and a very good example of this is Ola.\n\nBut when the truth was revealed, it became clear that \"bro, this is all very hollow inside.\" Because your losses are going above ₹2,000 crore. The cash burn is tremendous. Forget cash burn, the scooters themselves are catching fire, and the ones that aren't burning are sitting in repair shops for months. People are cursing on social media. Battery failure is happening. Recalls are happening. And on top of that, the government is also scolding you because you haven't properly complied with so many of the laws there.\n\nVC devaluation was happening, which is why you did the IPO quickly. You created a liquidity gap, but for how many days will the stock run on slogans? Stocks ultimately run on facts. On the day the stock was listed, it got a pop—a 20% pop. The stock eventually reached ₹91. But then, sliding and sliding, it tumbled to ₹50 and is now trading at less than ₹50. ₹100 crore of market capitalization has been eroded. Think about how many people's money has been sunk by buying Ola scooters and Ola shares.\n\n## The Personal Branding Trap & The Mamaearth Example\n\nSo, warning number one is clear to you.\n\nAs far as the stories of Peyush, Bhavish, or Vijay Shekhar Sharma are concerned, they all used their media, social media, and personal branding. They instilled a sense of authority in people, won their trust, and then monetized it through the IPO, and then broke people's trust as well.\n\nAnother living example of this is Mamaearth and its co-founder Ghazal Alagh. Because with \"toxin-free millennial mom\" branding, they captured social media. On one side, Shark Tank, and on the other side, her Instagram page that goes viral. She was already visible on Shark Tank, but she became quite famous on Instagram for her dancing reels.\n\nAnd another November month, another time of irrational exuberance, when it seemed like anyone could come to the market and collect money. In November 2023, a ₹10,700 crore IPO—the \"next big beauty disruptor.\" \"We will finish the whole market!\" Another IPO landed in the market with ₹10,000 crore, and it was said, \"Look, our revenue is growing by 200%.\" \"We are in the top three awareness rankings on Flipkart.\"\n\nGhazal Alagh's formula was amazing. On one hand, you told such a story that \"bro, it's safe for babies.\" \"It has an ethos.\" Meaning, even children's skin will not be affected by our product. So you can apply it safely. On top of that, people were told, \"Look, 57% revenue growth is happening.\" That's why subscribers, after seeing the dancing and singing and the revenue growth, oversubscribed it 38 times.\n\nWhereas the fact is that there was a lot of air. 2,800 times the profit? The profit is only ₹3.7 crore. But you placed such a good, such a large valuation on it, which was clearly an overreach. The crowded space had already grown. Nykaa was already there. Purplle was already there. The stock performance first climbs—it climbs 45%. But slowly, after August-September 2024, when it had touched 500, then it slowly comes down. Now it's around ₹275 in November 2025.\n\n## The Core Issue: Noise vs. Signal\n\nNow let's come to the main point. I've listed so many examples for you—there are more examples, but if I list them, the whole night will pass.\n\nBasically, the point of telling you all these things is that you should understand business owners like political leaders. They also hype. They will also feed you slogans. They will also do propaganda. They will also run ads. They will also show you dreams of good days.\n\nAnd I'm not saying here that all IPOs are frauds. All IPOs are wrong. In the tech sector, Zomato is an example where IPOs can also do well. But you have to separate the noise from the real signals.\n\nAnd we will stick to our makeup. We are taking a risk by saying this: wherever you see noise in a stock, wherever you see Shark Tank, wherever you see dancing and singing on Instagram, please stay away from that stock because they are trying to distract you from reality.\n\nStocks are profitable. IPOs are profitable. They have given returns from 200% to 900%. But you probably haven't heard the names of those stocks at the time of their IPO.\n\n- **Tega Industries**\n- **IREDA**\n- **Prudent Corporate Advisory Services**\n- **Pradeep Phosphates Limited**\n- **Avenue Supermarts (DMART)**\n- **Inox Green Energy Services Limited**\n- **Global Health Limited (Medanta)**\n\nHad you heard about such stocks or were you as excited when their IPOs were coming? But it's possible that if you follow the stock market, follow the share market, watch the headlines, then you must have heard the names of these people: lots of noise, lots of commotion, lots of excitement—One 97 Communications, which was Paytm, or take Cardekho, or take Delhivery. Now the Lenskart session has come, and the same kind of noise is happening regarding Boat, regarding Physics Wallah.\n\nNow I'm not an expert, and we will never give stock recommendations on Deshbhakt. But if you want to invest in these things, if you want to understand the stock market a little, then read the DRHP—the Draft Red Herring Prospectus. Because the truth has to be written in that. At least our systems force them to write in their draft prospectus. They have to tell. The reality of the company has to be revealed.\n\n- How much is \"Make in India\"?\n- How much is \"Make in China\"?\n- How many IPs are seated in India?\n- How much is registered in Singapore?\n- For how many years has it been profitable?\n- How did it suddenly become profitable in the last few months?\n- What is the actual market share?\n- How much market share has been lost?\n\nFrom all this, you will understand what the intention of your founder is. How many shares is the founder selling?\n\nAman Gupta is a big shark on Shark Tank. You are investing money because of this. Better than this, then just go and throw money in the river. Give money to your friend. There are better ways to lose money.\n\nThis sudden path to profitability happening—all the tech IPOs make their profit just a few months before the IPO. Is this not a red alert?\n\nYou are thinking, \"Mutual funds are buying the IPO, so we will also buy it.\" Bro, mutual funds are putting in their 0.051%. There is also collusion among them, and they can afford to lose even 1%. This is why such good returns are coming from mutual funds in our market.\n\nJust think about this sometime.\n\nAnd amidst all this, what is the regulator doing? The media, to some extent, some people will educate you. They will burn you. But an unfair practice is going on. It's not illegal—I'm not saying it's illegal—but it is certainly unethical.\n\n## The Final Warning: Don't Be Dumb\n\nSo, will you stop this unethical practice? Or tomorrow, even the lassi-wala will say, \"My AI-powered lassi is here. Now I'm bringing it to the stock market. I supply my lassi to tech centers. So I have a tech backend too, and by putting AI in it, I made this lassi.\"\n\nIn the end, you just have to understand one thing. IPOs are profitable. They are profitable for venture capitalists. They are profitable for owners. But if you scrutinize the IPOs of the last five years, especially the IT sector, you will find more losses, very little profit, and in those losses, you will find a clear pattern of noise, of dishonest behavior.\n\nThis is why when Shankar Sharma says that ours is the \"dumbest IPO market,\" it hurts, but it's not a lie. The data is showing in this very way that we are running more after the hype. Just like in politics, so in economics. These people also thought that if people are running after noise, if we can dance and sing, if we can come on Shark Tank and influence people, we can take their money, then we will do it.\n\nThis is why you don't have to be dumb. Please look, understand, read. Only after that, invest your hard-earned money.\n\nNow we don't have hard-earned money. The editor takes all the money like this. He says, \"New computer,\" every time a new computer. And you also have to become a little smart.\n\nLook, 50% of our audience—the majority audience that watches Deshbhakt—does not press the subscribe button. We are not even saying, \"Invest in our IPO.\" But pressing the subscribe button is the right thing to do. Please, please.",
  "category": "BUSINESS",
  "time_to_read": "15 min read",
  "article_link": "https://unhook-production.up.railway.app/article/945392d1-53bb-477d-829c-d97a87c3ba28",
  "article_source": "Teerth",
  "external_id": "6f4ML-9bsx0",
  "youtube_channel": "thedeshbhakt",
  "published_at": "2025-11-10T17:49:04.000Z",
  "cached_at": "2025-11-16T14:38:05.286Z"
}