{
  "id": "99a21397-ea23-4dcb-bd53-99c99f8dad4d",
  "title": "Celebrity Influence in Bihar Politics: A Shift from Caste to Face",
  "content": "**Celebrity Influence in Bihar Politics: A Shift from Caste to Face**\n\nAs the 2025 Bihar elections approach, political parties are leaving no stone unturned in their quest for power. Rallies are being held one after another, manifestos are being drafted, and alliances are being forged. But one of the most striking trends emerging this election season is the strategic entry of local celebrities into the political arena. From singers to social media stars, these figures—with fan bases in the millions—are not just campaigning for parties; many have been handed tickets to contest the elections themselves.\n\nThis raises a critical question: **Is Bihar moving from caste-based politics to face-based politics?**\n\n---\n\n### The Rise of the “Cultural Voter”\n\nIn Bihar, political equations have long been dictated by caste. Extremely Backward Classes (EBCs) make up over 36% of the population, while Other Backward Classes (OBCs) account for around 27%, Scheduled Castes (SCs) about 20%, and General Category around 15%. Combined, marginalized communities constitute nearly 85% of Bihar’s population.\n\nYet, despite caste’s historical dominance, a new voter is emerging—the **“cultural voter.”** This voter transcends caste, religion, and gender. They don’t vote along traditional lines; they vote for their icons.\n\nParties have taken note. Celebrities like:\n- **Ritesh Pandey**\n- **Mithila Thakur**\n- **Kesari Lal Yadav**\n- **Akshara Singh**\n- **Pawan Singh**\n\n…have been fielded not only for their visibility but for their power to attract youth and cultural voters—those who follow their favorite stars blindly, almost religiously.\n\n---\n\n### Why Are Parties Betting on Celebrities?\n\nSeveral factors make celebrities attractive candidates:\n\n1. **Non-Political Background**: They aren’t seen as “usual politicians.” There’s no anti-incumbency baggage.\n2. **Perceived Integrity**: Many believe celebrities enter politics not for money or power—they already have both—but for social service.\n3. **Established Brand Value**: Their face is their currency. Just as brands use celebrities in advertisements, political parties leverage their popularity to reach wider audiences.\n4. **Emotional Connect**: Through parasocial relationships, fans feel deeply connected to these figures, often seeing them as role models or even gods.\n\nAs one observer noted:\n> “In India, there are only two religions: cinema and cricket.”\n\nThis isn’t an exaggeration. When Vijay Thalapathy announced his political entry in Tamil Nadu, the city of Mysore came to a standstill. When Pawan Kalyan held a rally in Hyderabad, the city thronged to see him. That’s the power of fandom—and that’s what political parties are trying to harness.\n\n---\n\n### A Unifying Force or a Threat to Democracy?\n\nCelebrities can act as **cultural unifiers**. Mithila Thakur, for example, is beloved across the Mithila region for her folk songs in Maithili and Bhojpuri. Her fans cut across caste and religion. Similarly, when India wins a cricket match, the entire nation celebrates—irrespective of identity.\n\nThis unifying potential is a powerful tool in a state like Bihar, which suffers from:\n- High multidimensional poverty (affecting 1/3 of the population)\n- Rampant unemployment\n- Poor healthcare and education infrastructure\n- Low per capita income (under ₹60,000, against the national average of nearly ₹1.75 lakh)\n\nMany hope that celebrities, with their mass appeal and perceived sincerity, can bring fresh energy and focus to these unresolved issues.\n\n---\n\n### The Flip Side: Trivializing Democracy?\n\nBut there’s a darker side to celebrity politics:\n\n- **Lack of Political Expertise**: Many celebrities have no understanding of governance, policy-making, or legislative processes.\n- **Poor Performance**: Once elected, some remain more invested in their original careers, leading to absenteeism and poor legislative performance.\n- **Demoralizing Grassroots Workers**: Party workers who’ve toiled for years feel sidelined when an outsider is given a ticket.\n- **Manipulation of Voters**: Emotional appeal can override rational voting. Elections risk turning into a “mass hysteria” rather than a reasoned choice.\n\nAs one critic put it:\n> “When you bring in celebrities, the whole election turns into a kind of circus.”\n\nThis **trivialization of politics** can undermine the very foundations of democratic values.\n\n---\n\n### So, Are We Moving from Caste to Face?\n\nThere’s no denying that a **shift is underway**. Political parties are consciously moving from dynasty-based tickets to face-based ones. The goal is clear: attract youth, increase visibility, and transcend traditional voter blocs.\n\nBut it would be premature to declare the end of caste politics in Bihar. Caste remains a dominant force—especially in rural and semi-urban constituencies. What we’re seeing is an **overlap**, not a replacement.\n\n---\n\n### The Way Forward\n\nUltimately, the responsibility lies not just with political parties, but with the celebrities themselves. If they enter politics, they must be prepared to serve—not just symbolize. They must be accountable, present, and committed to governance.\n\nAs one voice in the debate concluded:\n> “If society has given them fame, money, and power—if we’ve treated them like gods—then it’s their duty to give back to society in return.”\n\nThe 2025 Bihar elections may well be a litmus test for this new political experiment—one that could reshape not just Bihar’s future, but the very idea of democracy in India.",
  "category": "PERSPECTIVES",
  "time_to_read": "5 min read",
  "article_link": "https://unhook-production.up.railway.app/article/99a21397-ea23-4dcb-bd53-99c99f8dad4d",
  "article_source": "Teerth",
  "external_id": "CbJpp5iI6Bg",
  "youtube_channel": "StudyIQEducationLtd",
  "published_at": "2025-11-02T04:00:06.000Z",
  "cached_at": "2025-11-04T04:18:14.775Z"
}