{
  "id": "a2a55538-ed8c-4197-be87-e6385eb98afa",
  "title": "US Tariff Rollback: Impact on Economy and India",
  "content": "# US Tariff Rollback: Impact on Economy and India\n\n## Introduction\n\nThe US administration, particularly under Donald Trump, championed the \"Make America Great Again\" (MAGA) motto, aiming to build economic resilience, improve manufacturing setups, create jobs, and roll out various policies. Among the most prominent policies were **reciprocal tariffs**. The US argued that as a net importer consuming goods from around the world, its trade deficit was growing. It was time to reverse this trend and start selling goods globally. To this end, reciprocal tariffs were implemented on numerous countries, including India, where tariffs of 25%–25%, totaling 50%, were imposed.\n\nThe idea was that these tariffs would bring a major transition and change to the US economy. However, even at that time, many articles pointed out that such tariffs might not deliver the expected growth. There were predictions that a time would come when the US administration would have to **roll back these tariffs**—first rolled out, now rolled back. This rollback appears to have begun, with the US administration removing tariffs on certain food products. This raises the question: **Is the MAGA initiative failing?** Let’s explore why these tariffs were removed and what impact this change could have on India.\n\n---\n\n## The MAGA Initiative and Reciprocal Tariffs\n\n### The Idea Behind the Tariffs\n\nThe core idea of the MAGA initiative was to **protect US farmers and industries** by imposing tariffs on imported goods. The logic was:\n\n- Higher tariffs on imported goods would reduce their consumption.\n- Domestic products would become more competitive.\n- Domestic producers would sell more, expand manufacturing, and create jobs.\n\nThis vision led to the rollout of reciprocal tariffs. However, global banks criticized this approach, warning that such tariff structures could introduce further uncertainty into an already volatile global trade environment, exacerbated by geopolitical conflicts like the Russia-Ukraine war. The **S&P also highlighted** that these tariffs might not boost the US economy and could even contract it in the long run.\n\n### The Reality Check\n\nDespite these warnings, the tariffs were implemented. The US signed agreements with some countries, but relations with India were more complex. Initially, a 25% tariff was imposed, later increased to 50%, citing India’s oil imports from Russia. A trade agreement was discussed, but no significant results were achieved, partly because the US wanted India to fully open its agricultural market—a sensitive issue for Indian farmers.\n\n---\n\n## Historical Parallel: The Smoot-Hawley Tariff Act\n\nThe current reciprocal tariff structure has been compared to the **Smoot-Hawley Tariff Act of 1930**, which also imposed high tariffs to protect US farmers and industries. The consequences then were severe:\n\n- **Global retaliation** began.\n- **World trade collapsed** by 60%–70%.\n- **Prices rose**, job losses followed, and the **Great Depression of the 1930s** was triggered.\n\nWhy was the situation different then? At that time, the US was the main driver of the global economy. Today, while the US still holds a significant position, other players like **China** are also major economic forces. However, the risk remains: a similar tariff structure could lead to inflationary pressures, economic contraction, and job losses.\n\n---\n\n## Impact of Recent Tariffs on the US\n\n### Inflation and Cost of Living\n\nThe tariffs were implemented with confidence, but the **impact of inflation** directly affected public perception and ideology. This wasn’t about luxury items; it was about **food**—the most basic necessity. When people have to spend extra on essentials due to government policies, their ideology may shift away from supporting the government.\n\nIn the US, **multiple elections** saw Republicans losing and Democrats emerging victorious. Surveys, especially in New York, indicated that the **rising cost of living** was a major factor—more significant than immigration policies like H-1 visa changes.\n\n### Economic Contradictions\n\nThe promise of MAGA was:\n\n- Higher foreign prices.\n- Increased domestic competitiveness.\n- Job returns and growth in domestic manufacturing.\n\nBut the reality was different:\n\n- US manufacturers depend on **imported inputs**. If input costs rise, their products also become more expensive.\n- **Retaliation** from trading partners impacted US exporters and farmers. For example, **soybean exports** saw reduced profitability.\n- **Inflationary pressures** emerged, forcing the Fed to consider raising interest rates, which could contract the economy.\n\n### Burden on Consumers and Producers\n\nThe estimated **tariff cost of $1.2 trillion by 2025** is primarily borne by:\n\n- **Consumers**, who pay extra for products.\n- **Producers**, who face higher import costs. For instance, a luxury bedding factory reported an additional $10,000 in monthly spending due to imported inputs.\n\nIf products don’t sell, factories may close, costs must be cut, and jobs are lost. In September alone, **12,000 jobs were cut** in manufacturing due to rising input costs.\n\n---\n\n## The Rollback: Political and Economic Drivers\n\n### Political Outcomes\n\nThe recent rollback of tariffs is closely linked to **political outcomes**. In multiple elections, Republicans faced losses, and voter perception highlighted **rising consumer prices** as a key concern. Voters were less worried about job creation and more about the **economy contracting** and the **cost of living increasing**.\n\n### Economic Realities\n\nThe rollback, though earlier than the expected 3–4 years, indicates a shift. The optimistic estimates suggest that Indian exports could benefit by **$2.5 to $3 billion**. However, limitations exist:\n\n- Major Indian export products like **rice and marine products** are not exempt.\n- High-value segments like **gems, jewelry, and apparel** still face **50% punitive tariffs**.\n- Exempted categories (e.g., tomatoes, citrus fruits, bananas, juices) face strong competition from Latin American countries.\n\n---\n\n## Impact on India\n\n### Current Scenario\n\nIndian exporters have already felt the pressure of rising tariffs. In September, exports **contracted by 12% year-on-year**. In response, the Indian government has initiated efforts to **diversify export markets**. Agreements with the **UK** and ongoing discussions with the **EU** are pivotal.\n\n### Opportunities and Challenges\n\nThe tariff rollback may benefit Indian exports, but there are limitations:\n\n- **No exemptions for major exports** like rice and marine products.\n- **High-value segments still under pressure**.\n- **Competition from Latin America** in exempted categories.\n\n### The Need for Diversification\n\nIndia’s **dependency on the US** as the largest export destination is a concern. To address this, India is:\n\n- **Diversifying export channels**.\n- **Negotiating with multiple nations** (e.g., EU, Oman, New Zealand).\n- **Reducing reliance on the US** by tapping into new markets.\n\n---\n\n## Conclusion\n\nThe rollback of US tariffs is an indication that the **MAGA initiative’s tariff structure may not be sustainable**. The political and economic pressures—rising inflation, cost of living, and voter dissatisfaction—have prompted this change. For the global economy, reducing such uncertainties is crucial, especially amid ongoing geopolitical conflicts.\n\nFor India, while the rollback offers some relief, the focus must remain on **diversifying export markets** and reducing dependency on any single nation. The ongoing negotiations and agreements with other countries will play a vital role in ensuring resilient and sustainable growth for Indian exporters.\n\n---\n*This analysis highlights the interconnectedness of trade policies, political outcomes, and economic realities. The rollback of tariffs marks a significant shift, but its long-term impact will depend on how nations adapt and diversify in an increasingly uncertain global landscape.*",
  "category": "BUSINESS",
  "time_to_read": "6 min read",
  "article_link": "https://unhook-production.up.railway.app/article/a2a55538-ed8c-4197-be87-e6385eb98afa",
  "article_source": "Teerth",
  "external_id": "hg5CMYkxhmA",
  "youtube_channel": "StudyIQEducationLtd",
  "published_at": "2025-11-17T16:00:06.000Z",
  "cached_at": "2025-11-19T15:32:52.083Z"
}