{
  "id": "a380271a-dc02-4400-86cf-39982e3d5f9d",
  "title": "Was Sikkim's Queen Hope Cooke a CIA Agent?",
  "content": "# Was Sikkim's Queen Hope Cooke a CIA Agent? An Investigation into History's Great Spy Mystery\n\n## Prologue: A Himalayan Enigma\n\nNestled in the lap of the Himalayas lay the beautiful, tiny kingdom of Sikkim. For centuries, since 1642, it was ruled by the Namgyal dynasty. Over time, its sovereignty saw influence from Tibet, then became a British protectorate, and finally, after India's independence, it became an Indian protectorate in 1950. This meant India handled its defense, foreign affairs, and communications, while internal affairs remained with Sikkim's monarchy.\n\nBy the 1960s, this strategically vital state for India became a simmering pot of ethnic tensions and, allegedly, the target of foreign powers seeking to establish a foothold. It was into this delicate geopolitical landscape that a young American woman named Hope Cooke arrived, setting in motion one of independent India's most intriguing political and espionage mysteries.\n\n## The Prince and the Prodigy: An Unlikely Meeting\n\n### Palden Thondup Namgyal: The Lonely Monarch\nThe central figure in Sikkim's royal house was Crown Prince Palden Thondup Namgyal. Born on May 23, 1923, he was educated in India, spoke impeccable English, and was considered modern, yet deeply followed Sikkimese and Buddhist traditions. An honorary officer in the Gorkha regiment, he married Sangey Deki in 1950 and had three children. Tragedy struck in 1957 when his wife passed away, leaving the prince profoundly lonely. Despite the luxury of royal life, he was described as shy and withdrawn, often retreating to the Windamere Hotel in Darjeeling for long, solitary stays.\n\n### Hope Cooke: The Orphaned Heiress\nAcross the world, a young girl's life was marked by equal tragedy. Hope Cooke was born on June 24, 1940, in San Francisco. Her mother, a pilot, died in a plane crash when Hope was just 18 months old. Her father, a flight instructor, drifted away after new relationships, leaving Hope and her sister to be raised by their grandparents in New York. When her grandfather—a president of a large company—died, followed by her grandmother three years later, the sisters were sent to live with their uncle in Iran.\n\nThis is where the first whispers of a CIA connection emerge. Her uncle was **Sheldon Chapin, the US Ambassador to Iran.** Hope completed her schooling in Tehran. In 1959, at 19, she enrolled at the prestigious Sarah Lawrence College in the US to study Asian Studies. It was well-known among her circle that she was fascinated by India and the Himalayas, dreaming of visiting Tibet.\n\n## The Fateful Encounter: Darjeeling, 1959\n\nIn the summer of 1959, Hope Cooke, fulfilling her dream, visited India for the first time. She stayed at the Windamere Hotel in Darjeeling—the very same hotel frequented by the lonely Prince of Sikkim. Coincidence or a pre-planned mission?\n\nOne evening, as Hope sat reading in the lounge, Prince Palden Thondup Namgyal entered. He noticed the young woman engrossed in her book. Inquiries revealed she was an American student on summer vacation, deeply fascinated by Asia and India. He approached her. A conversation began, and a connection was forged.\n\nBoth were souls marked by loss and isolation. The prince was navigating profound loneliness, while Hope's childhood had been a series of abandonments. Their shared fascination with Sikkim and the Himalayas created a unique bond. After her trip ended, Hope returned to Iran and her studies, but the two began a correspondence. A relationship blossomed through letters, despite their age difference—Hope was about 20, the Prince nearly 38.\n\n## A Fairytale Wedding with Ominous Undertones\n\nHope returned to India in 1961, staying again at the Windamere. The Prince rushed to meet her. At a dance at the Gymkhana Club that evening, he proposed. By the end of the year, they were engaged. After a two-year delay advised by royal astrologers, a grand Buddhist wedding was held on March 20, 1963, at the palace monastery in Gangtok.\n\nThe wedding was a global spectacle. Fourteen lamas conducted the rites. The guest list included prominent American figures, such as US Ambassador John Kenneth Galbraith, several generals, and Indian royalty. Notably, Hope Cooke renounced her US citizenship shortly after, ostensibly to avoid the impression of an American meddling in Himalayan affairs.\n\nInternational media like *National Geographic*, *The New Yorker*, *Time*, and *Vogue* swooned over the \"American Queen in a Tiny Himalayan Town,\" painting an exotic fairytale. *Time* magazine's 1969 feature, \"Sikkim: A Queen Revisited,\" detailed her luxurious daily life. However, the palace reality was starkly different.\n\n## Queen of Sikkim: The Fractured Fairytale\n\nA personal and political crisis was brewing beneath the glamorous surface. The old Sikkimese elite and the Prince's inner circle never trusted this foreign queen. The Prince's sister, Princess Coocoola (Pema), was locked in a continuous power struggle with Hope. The Prince himself was battling alcoholism.\n\nThen, on December 2, 1963, the King of Sikkim died. Prince Palden Thondup Namgyal became the 12th and final Chogyal (King) of Sikkim. At just 23, Hope Cooke was now the *Gyalmo* (Queen) of Sikkim.\n\n## The Mask Slips: The \"Spy Queen\" Emerges\n\nWith her new status, Hope Cooke's influence on Sikkim's policies grew—and so did suspicions about her loyalties. Indian intelligence began to notice a concerning pattern: while she presented herself as pro-India to Indian officials, her actions behind the scenes seemed designed to undermine New Delhi's influence.\n\nThe first major public alarm sounded in 1966. Hope wrote an article for the Namgyal Institute journal titled **\"Sikkim: Theory of Land Holding and the Darjeeling Grant.\"** In it, she argued that Darjeeling—leased to the British East India Company in 1835—should be returned to Sikkim. For a newly minted American queen to make such a contentious territorial claim against India sent shockwaves through the Indian establishment.\n\nThe issue reached Parliament. When confronted, Prime Minister Indira Gandhi dismissed it as coming from \"irresponsible quarters,\" a veiled reference to Hope Cooke herself, and advised against giving it attention.\n\nBut Hope's activities continued. She joined study groups involving foreign journalists, whom she cultivated, promoting an image of Sikkim as a \"distinct nation\" separate from India. India's external intelligence agency, the Research and Analysis Wing (RAW), concluded that a Western propaganda campaign against India was underway, with **Hope Cooke as the CIA's pawn.** In Delhi's corridors of power, she earned a new title: the \"Spy Queen.\"\n\n## India's Counter-Move: The Doval Operation\n\nBy the early 1970s, Indian agencies were fully alert. The task of countering this perceived CIA plot in Sikkim was given to a rising star in the Intelligence Bureau (IB): **Ajit Kumar Doval.**\n\nDoval was chosen for his proven track record in counter-insurgency in Mizoram and Punjab, and his role in resolving numerous airline hijackings. Operating undercover in local disguise, he built rapport with pro-democracy leaders in Sikkim, bypassed the monarchy, and established a direct line between Sikkim's political forces and the central government in Delhi.\n\nAs political protests against the Chogyal's rule grew in 1973, the King asked India for help to maintain law and order. Seeing the game was up, **Hope Cooke abruptly left Sikkim—and India—in August 1973.** Reports say she fled directly to New York. As she departed from the palace helipad, she told BSD Das, an important figure in the palace, **\"Mr. Das, look after my husband. I am leaving. My role here is complete.\"**\n\nWhat role was she referring to?\n\n## The Final Act: Sikkim Merges with India\n\nWith Hope gone, the political process accelerated. In 1974, elections were held. Kazi Lhendup Dorji of the Sikkim National Congress won 31 of 32 seats, a new constitution was drafted, and he became Chief Minister, though the Chogyal remained a figurehead.\n\nIn April 1975, protests erupted again. Palace guards opened fire. Kazi Lhendup Dorji formally requested Indian intervention. On April 9, the Indian Army surrounded the palace. After a phone call from Indian General J.S. Khullar, the Chogyal ordered his 243 guards to surrender.\n\nOn April 10, the Sikkim Assembly abolished the monarchy. A referendum on April 14 showed **97.55% of the populace voting to merge with India.** The bill was passed by the Indian Parliament on April 26, and on **May 16, 1975, Sikkim officially became the 22nd state of the Indian Union.**\n\n## Epilogue: Unanswered Questions\n\nThe principal characters faded away. The last Chogyal, Palden Thondup Namgyal, died of cancer in New York in 1982. Hope Cooke, who had divorced him in 1980, had her US citizenship restored in 1976. She later married historian Michael Bellesiles (a marriage that also ended in divorce) and wrote books about her time in Sikkim.\n\nThe sequence of events—an American woman with ties to the US diplomatic corps marrying into a strategic Himalayan monarchy, advocating for its separation from India, and then leaving just as Indian intelligence closed in—fuels the persistent theory.\n\n**Was Hope Cooke a CIA agent?** The official files remain closed. The evidence is circumstantial but compelling: her background, her sudden entry and exit, her political advocacy, and the geopolitical context of the Cold War, where the CIA was actively curbing Indian influence in the region.\n\nHer story remains a captivating chapter in history—a blend of royal romance, high-stakes espionage, and the complex integration of a kingdom into the world's largest democracy. It is a question that continues to intrigue historians and spy enthusiasts alike: Was the Queen of Sikkim a real-life Trojan Horse? The mystery endures.",
  "category": "PERSPECTIVES",
  "time_to_read": "8 min read",
  "article_link": "https://unhook-production.up.railway.app/article/a380271a-dc02-4400-86cf-39982e3d5f9d",
  "article_source": "Teerth",
  "external_id": "lFB6uEZy3bQ",
  "youtube_channel": "StudyIQEducationLtd",
  "published_at": "2025-12-09T16:30:07.000Z",
  "cached_at": "2025-12-12T16:42:04.786Z"
}