{
  "id": "a6b9b8db-da6c-4ae8-97b6-170593ddbf1b",
  "title": "The Lonely Survivor: PTSD After the Air India Crash",
  "content": "**The Lonely Survivor: PTSD After the Air India Crash**\n\n---\n\n### A Miraculous Escape, A Shattered Life\n\nOn June 12, an Air India flight bound for London crashed shortly after takeoff from Ahmedabad. The scene was catastrophic—the plane had slammed into a hostel mess, and thick black smoke billowed from the wreckage. Of the 242 passengers on board—169 Indian nationals, 53 British citizens, one Canadian, and seven Portuguese—only one man survived.\n\nHis name is Vishwas Kumar Ramesh, the “lonely survivor” of Air India Flight AI171.\n\nNow 39, Vishwas was seated in 11A, right beside the emergency exit. Dressed in a white t-shirt and grey trousers, he was the sole person seen fleeing the burning fuselage, shouting, “The plane has exploded!” in a state of sheer terror. While he physically escaped, his younger brother, Ajay Kumar, seated nearby in 11J, did not survive.\n\n---\n\n### Life After the Crash: A Portrait of Trauma\n\nToday, Vishwas lives in Leicester, UK, with his wife Hiral and their four-year-old son, Devang. But the man who emerged from the wreckage is a shadow of his former self.\n\nJournalists who met him describe him as “a broken man.” Emotionally, he remains trapped in the moment of the crash—physically safe, but mentally imprisoned.\n\n> “I stay locked in my room. I don’t talk to anyone,” Vishwas reveals. “I still haven’t received the help I need—not from the airline, not from the UK government.”\n\nHe no longer drives. He barely walks. His left side—shoulder, back, knee—still burns with pain. The psychological scars run even deeper.\n\n---\n\n### The Invisible Wound: Understanding PTSD\n\nVishwas suffers from **Post-Traumatic Stress Disorder (PTSD)**, a severe mental health condition triggered by experiencing or witnessing a traumatic event.\n\nIn his own words:\n\n> “Mentally, I’ve gone mad… My son doesn’t talk to me. My wife doesn’t talk to me. I just sit alone in my room. The tragedy was so severe that I get flashbacks.”\n\nEven his four-year-old son has grown distant, unable to comprehend the invisible storm raging inside his father.\n\n---\n\n### A Family and Business in Ruins\n\nBefore the crash, Vishwas and his brother Ajay ran a successful fishing business together. They were close—both personally and professionally. But with Ajay gone, the business has collapsed.\n\n> “Our family income is disappearing. We are relying on limited welfare support.”\n\nVishwas’s wife, Hiral, had been receiving UK Universal Credit benefits, but these were halted when she traveled to India to be with him after the crash. The family’s financial strain has only intensified their emotional distress.\n\nAir India provided an interim payment of ₹25 lakh, but a final compensation has not yet been settled.\n\n---\n\n### A Glimmer of Community Support\n\nIn the absence of institutional aid, help has come from the local community. Vishwas currently stays with Sanjeev Patel, a retired lawyer and crisis management specialist in Leicester, who has stepped in to support the family when no one else would.\n\n---\n\n### A Message to Those Struggling\n\nVishwas’s story is a stark reminder of the long-term impact of trauma. But it also carries a message for anyone facing PTSD or severe stress:\n\n> “Always remember—it’s essential to seek help. PTSD is a menace. If you don’t come out of it, it’s like a deep well… and you keep sinking deeper.”\n\nHe emphasizes the power of mindset and acceptance:\n\n> “Whenever you’re troubled, remember this sentence: **‘I will decide how I feel.’** It’s difficult, but slowly, those negative emotions will start to align with you. You decide how you want to feel.”\n\n---\n\n### The Road Ahead\n\nVishwas’s life before the crash was “going very smooth.” Now, everything has changed.\n\n> “The situation is very, very desperate.”\n\nYet, in his struggle lies a universal truth: life is unpredictable. Tragedy can strike anyone. But with acceptance, spiritual strength, and the right support, recovery—however difficult—is possible.\n\nFor now, Vishwas remains a survivor in more ways than one: he survived a plane crash, and now he fights to survive its aftermath.\n\n---\n\n*If you or someone you know is struggling with trauma or PTSD, remember: seeking help is not a sign of weakness. It is the first step toward reclaiming your life.*",
  "category": "HEALTH",
  "time_to_read": "4 min read",
  "article_link": "https://unhook-production.up.railway.app/article/a6b9b8db-da6c-4ae8-97b6-170593ddbf1b",
  "article_source": "Teerth",
  "external_id": "RWNgQWoLaTc",
  "youtube_channel": "StudyGlows",
  "published_at": "2025-11-10T10:30:15.000Z",
  "cached_at": "2025-11-11T15:13:44.561Z"
}