{
  "id": "d9754eea-38dc-44d9-9a71-799853e9bcfe",
  "title": "Rahul Gandhi Alleges 25 Lakh Fake Votes in Haryana Election",
  "content": "# Rahul Gandhi Alleges 25 Lakh Fake Votes in Haryana Election, Calls It \"Operation Government Theft\"\n\nIn a dramatic press conference held recently, Congress leader and Leader of Opposition Rahul Gandhi unveiled what he termed the \"H-File\"—a dossier alleging systematic and large-scale electoral fraud in the Haryana state elections. Gandhi claimed that **25 lakh (2.5 million) fake votes** were used to manipulate the election outcome, converting what should have been a \"Congress landslide victory\" into a loss.\n\n---\n\n## 🔍 The Core Allegations\n\nRahul Gandhi presented a detailed PowerPoint presentation during the press conference, outlining the following key claims:\n\n- **5,21,000 duplicate voters** registered across multiple polling booths.\n- **93,000 voters** registered with invalid addresses.\n- **Over 19 lakh (1.9 million) bulk voters**—individuals deliberately added multiple times to voter rolls.\n- Misuse of **Form 6 and Form 7**—used for addition and deletion of names from voter lists—allegedly to benefit the BJP.\n- A so-called **\"Brazilian Model\" case**, where a Brazilian model’s photo was allegedly used 22 times in the Haryana voter list under different names like Seema, Sweety, and Saraswati.\n\nGandhi emphasized that these were not random errors but part of a **\"systemic, centrally coordinated operation\"** aimed at undermining Indian democracy.\n\n---\n\n## 📊 By the Numbers\n\n- Total voters in Haryana: ~2 crore (20 million)\n- Alleged fake votes: 25 lakh (2.5 million)\n- **That’s 1 in every 8 votes**—or roughly **12.5% of the total voter base**—being invalid or fraudulent, according to Gandhi.\n\nHe also gave a striking example: one individual allegedly appeared **223 times across two polling booths**.\n\n---\n\n## 🗳️ Postal Ballot Irregularities\n\nGandhi pointed to the postal ballot results as further evidence of manipulation. Historically in Haryana, the party leading in postal ballots has gone on to win the overall election. This time:\n\n- Congress won postal ballots in **73 seats**\n- BJP won in **17 seats**\n\nYet, when the final results came in, the BJP swept the election—a result Gandhi called \"shocking\" and inconsistent with the postal ballot trend.\n\n---\n\n## 🧩 Broader Pattern of Electoral Fraud?\n\nRahul Gandhi linked the Haryana case to a larger national pattern, alleging similar \"vote theft\" operations in states like **Maharashtra, Karnataka, and Bihar**. He also raised concerns about the ongoing **Special Intensive Revision (SIR)** of voter lists, suggesting it was being misused to delete names of minority and backward caste voters—traditional Congress supporters.\n\n---\n\n## 📢 Demands and Appeals\n\nGandhi made two primary demands:\n\n1. **A forensic audit** of Haryana’s voter rolls by the Election Commission of India (ECI).\n2. **Release of public data** on voter additions and deletions for transparency.\n\nHe also appealed directly to India’s youth, invoking the recent \"JJ\" (JNU student) protests, urging them to stand up for the \"future of democracy.\" He stressed the need for peaceful but firm public action to protect democratic institutions.\n\n---\n\n## ⚖️ Legal and Institutional Response\n\nWhile Gandhi has not yet announced plans to move court, legal experts note that election results can be challenged in the High Court within 45 days of declaration. If evidence is strong, the matter could also be taken to the Supreme Court.\n\nThe Election Commission has previously defended the integrity of the electoral process, calling it \"tamper-proof and verifiable.\" Fact-checking organizations have also countered some of Gandhi’s past allegations—such as the \"Minta Devi\" case, where a woman’s age was wrongly shown as 125 years.\n\n---\n\n## 🧠 What’s Next?\n\nThe BJP is expected to issue a counter-statement, and the ECI may also respond formally. Meanwhile, political analysts are watching to see if the Congress will pursue legal routes or rely on public mobilization.\n\n---\n\n## 💬 Your Thoughts?\n\nWhat do you make of these allegations? Do they point to a deeper institutional crisis, or are they part of political post-election rhetoric? Let us know in the comments.\n\n---\n*This is a developing story. Follow for updates.*",
  "category": "NEWS",
  "time_to_read": "4 min read",
  "article_link": "https://unhook-production.up.railway.app/article/d9754eea-38dc-44d9-9a71-799853e9bcfe",
  "article_source": "Teerth",
  "external_id": "TR_J4S7LVf0",
  "youtube_channel": "StudyIQEducationLtd",
  "published_at": "2025-11-05T08:58:14.000Z",
  "cached_at": "2025-11-05T15:52:42.140Z"
}