{
  "id": "eaafe8f2-25cc-474a-8fe1-b5f041ae178f",
  "title": "Election Commission Reverts EVM Vote Counting Process to Pre-2019 Rules",
  "content": "# Election Commission Reverts EVM Vote Counting Process to Pre-2019 Rules\n\nIn a significant move, the Election Commission of India (ECI) has announced a major change in the vote counting process for Electronic Voting Machines (EVMs), reverting to the procedure that was in place before the 2019 general elections. This decision comes after sustained demands from opposition parties, who argued that the 2019 changes compromised transparency and credibility.\n\n## Background: How Votes Are Cast in India\n\nIn India, voters can cast their ballots through two primary methods:\n\n1. **Electronic Voting Machines (EVMs):** On election day, voters visit polling booths and press the button next to their chosen candidate on the EVM. A Voter Verifiable Paper Audit Trail (VVPAT) slip is printed, visible to the voter for about seven seconds, before it drops into a sealed box.\n\n2. **Postal Ballots:** Certain categories of voters who cannot physically visit polling stations are eligible to vote via postal ballots. This includes:\n   - Armed forces personnel\n   - Paramilitary forces\n   - Diplomats stationed abroad\n   - Persons with disabilities\n   - Senior citizens (above 80 years)\n   - Government staff on election duty\n\n## The Evolution of Vote Counting Procedures\n\n### The Pre-2019 Process\n\nUnder the Conduct of Election Rules, 1961 (specifically Rules 54A and 56), the counting procedure followed this sequence:\n\n1. **Postal ballots were counted first** - each paper ballot was opened and tallied\n2. **EVMs were counted afterward** - results from all EVMs were compiled\n3. **Results were combined** - votes from both sources were added together to determine the winner\n\nThis ensured that postal ballots were fully counted before any EVM results were declared.\n\n### The 2019 Changes\n\nIn 2019, the ECI decoupled the counting processes:\n\n- **Simultaneous counting:** EVM and postal ballot counting could proceed separately\n- **No sequencing requirement:** EVM counting could finish much faster than postal ballot counting\n- **Early declarations possible:** Media could declare winners based on EVM results before postal ballots were fully counted\n\nThe rationale was that since postal ballots represent a small percentage of total votes and take longer to count (each paper must be manually verified), there was no need to delay EVM result declarations.\n\n## The 2025 Reversion: What's Changing Now\n\nThe Election Commission has now restored the pre-2019 counting procedure with a crucial modification:\n\n### The \"Penultimate Round\" Rule\n\n- EVM counting will proceed through multiple rounds (as is standard practice)\n- **After the penultimate (second-to-last) round,** counting will pause\n- The pause will continue **until all postal ballots in that constituency are fully counted**\n- Only after postal ballot counting is complete will the **final round of EVM counting proceed**\n\n### Practical Example\n\nConsider a constituency with:\n- 10 rounds of EVM counting needed\n- 15,000 postal ballots to count\n\nUnder the new rules:\n- Rounds 1-8 of EVM counting proceed normally\n- **After round 8,** officials check if all postal ballots are counted\n- If postal ballots aren't fully counted, rounds 9-10 of EVM counting **will not proceed** until postal ballot counting is complete\n- This ensures both EVM and postal ballot results are available simultaneously before final declaration\n\n## Why This Change Matters\n\n### 1. Enhanced Transparency and Credibility\n\nOpposition parties had raised concerns that the 2019 procedure allowed for potential manipulation. When EVM results are declared early, there's a risk that postal ballots (which are paper-based and manually counted) could be subject to tampering if the outcome appears already decided.\n\n### 2. Increased Significance of Postal Ballots\n\nThe value of postal ballots has grown substantially because:\n- Eligibility has expanded to include senior citizens and persons with disabilities\n- In closely contested constituencies, postal ballots can be decisive\n- The number of postal voters has increased significantly\n\n### 3. Uniform Application Nationwide\n\nThe restored procedure will apply uniformly across all constituencies, eliminating variations in counting processes.\n\n### 4. Alignment with Democratic Spirit\n\nThe reversion aligns with the original intent of the 1961 election rules, which emphasized comprehensive vote counting before result declaration.\n\n## Potential Challenges\n\n### 1. Longer Result Declaration Times\n\nPostal ballot counting is time-consuming because each paper must be manually verified. This could delay final result declarations compared to recent elections.\n\n### 2. Resource Requirements\n\nThe Election Commission may need to deploy additional staff and set up more counting tables to expedite postal ballot counting.\n\n### 3. Coordination Complexity\n\nIn Lok Sabha constituencies comprising multiple assembly segments, coordination becomes more challenging as different segments may complete postal ballot counting at different times.\n\n## Broader Electoral Reforms\n\nThis counting procedure change is part of the Election Commission's 30th electoral reform initiative. Other accompanying measures include:\n\n- Technological integration to improve election conduct\n- Enhanced facilities for persons with disabilities and senior citizens\n- Steps to reduce counting delays through better processes\n\n## Conclusion\n\nThe reversion to pre-2019 counting procedures represents a significant step toward enhancing electoral transparency and addressing long-standing concerns about the integrity of result declarations. While it may slow down result announcements, it ensures that every vote—whether cast electronically or via postal ballot—receives equal consideration before any winner is declared.\n\nThis move demonstrates the Election Commission's responsiveness to stakeholder concerns and its commitment to maintaining the credibility of India's democratic processes. As postal voting becomes more prevalent, this procedural safeguard ensures that all votes count equally in determining electoral outcomes.",
  "category": "NEWS",
  "time_to_read": "5 min read",
  "article_link": "https://unhook-production.up.railway.app/article/eaafe8f2-25cc-474a-8fe1-b5f041ae178f",
  "article_source": "Teerth",
  "external_id": "QtpPsLyzngc",
  "youtube_channel": "StudyIQEducationLtd",
  "published_at": "2025-09-29T06:03:03.000Z",
  "cached_at": "2025-09-30T17:11:10.710Z"
}