{
  "id": "fbc70fb0-d0e9-435f-98e3-bea69b514b6d",
  "title": "IRS Officer Arrested in Bribery Sting Operation",
  "content": "**# Senior IRS Officer Arrested in Elaborate Bribery Sting Operation**\n\nIn a dramatic anti-corruption operation, the Central Bureau of Investigation (CBI) has arrested a senior Indian Revenue Service (IRS) officer, Dr. Amit Kumar Singhal, on charges of demanding and accepting a bribe. The case, which unfolded across multiple cities, reveals a brazen attempt to extort money under the threat of severe financial penalties.\n\n## The Complaint That Started It All\n\nThe sequence of events began with a complaint filed at the CBI's Chandigarh office. A businessman, Sanam Kapoor, alleged that a senior IRS officer had demanded a bribe of ₹45 lakh. The demand was reportedly made during a meeting in Delhi a month prior. The officer, later identified as Dr. Singhal, allegedly threatened Mr. Kapoor with a \"heavy penalty\" if the bribe was not paid.\n\nThe CBI was reportedly taken aback, not because a bribe was demanded, but because the complaint was not against a politician, as is often the case, but against a senior IRS officer posted in Delhi.\n\n## The Trap is Set\n\nBefore acting, the CBI needed to verify the allegations. They instructed the complainant to meet the officer again and record the entire conversation. Following these instructions, Mr. Kapoor first met an associate of the IRS officer and then the officer himself, secretly recording the discussions where he pretended to be willing to pay the bribe.\n\nThe final handover was scheduled for June 4th at the associate's residence in Mohali, Punjab.\n\n## The Sting Operation\n\nOn the appointed day, the complainant arrived in Mohali with ₹25 lakh in cash. He was not alone; a team of CBI officials was covertly positioned nearby. The moment the associate accepted the cash, the CBI team moved in and arrested him.\n\nSimultaneously, in a coordinated raid nearly 300 kilometers away, Dr. Amit Kumar Singhal was arrested from his home in the Vasant Kunj area of Delhi. A search of his premises yielded staggering results: **3.5 kg of gold, 2 kg of silver, and ₹1 crore in cash** were recovered.\n\n## A Story of Business Gone Sour\n\nThe roots of this case trace back to 2019 in Mumbai. At the time, Dr. Singhal was a Joint Commissioner in the Customs Department. He met Sanam Kapoor, the director of Copenhagen Hospitality Private Limited and owner of the popular \"Lapino's Pizza\" chain.\n\nDr. Singhal proposed a business partnership to open three new franchise outlets. A contract was signed between Mr. Kapoor, Dr. Singhal, and an associate of the officer. Initially, the partnership worked, but by 2024, problems began. Mr. Kapoor decided to cancel the contract, bought out the three outlets, and severed all business ties with the IRS officer.\n\nTwo months later, on February 18th, Mr. Kapoor's chartered accountant received a notice from the Income Tax Department. Shocked, Mr. Kapoor interpreted this as retaliation for ending the business relationship. His CA was allegedly told at the tax office that the notice was sent due to \"pressure from the top\" and that non-compliance would result in a massive penalty.\n\nMr. Kapoor then called Dr. Singhal, who asked him to meet in Delhi. During a meeting in April, the officer allegedly reiterated his demand for ₹45 lakh to \"settle the matter,\" threatening a heavy penalty if he refused. Unwilling to pay the bribe, Mr. Kapoor approached the CBI.\n\n## The Wider Problem: \"Harassment Bribes\"\n\nThe case of Dr. Singhal is, unfortunately, not an isolated incident. It highlights the pervasive issue of what economists call **\"harassment bribes.\"**\n\nThis concept, popularized by economist Kaushik Basu, refers to situations where citizens are forced to pay bribes to government officials simply to access services or rights that are legally theirs. A common example is an official demanding a bribe to process a land registration, electricity connection, or ration card that the citizen is already entitled to.\n\nThe tragic irony of the current legal framework, under the **Prevention of Corruption Act, 1988**, is that it makes both the bribe-giver and the bribe-taker guilty partners in crime. This leaves citizens with a terrible choice:\n*   Pay the bribe, get your work done, and become a criminal.\n*   Refuse to pay, and be denied your legal right.\n\n## A Controversial Solution: Legalizing Bribe-Giving?\n\nIn 2011, while serving as the Chief Economic Adviser to the Government of India, Kaushik Basu proposed a radical solution in a working paper. He suggested that the act of giving a bribe in such harassment cases should be legalized.\n\n**His proposal was based on game theory:**\n*   **Current Law (Symmetric Liability):** Both giver and taker are criminals. Once the bribe is paid, both have a strong incentive to stay silent to avoid jail. This creates a \"silent partnership\" in crime.\n*   **Basu's Proposal (Asymmetric Liability):** Only the bribe-taker is punished. The bribe-giver is not treated as a criminal. In fact, if a court finds that an official demanded a bribe, the official would have to return the entire amount to the citizen.\n\nBasu argued that this would shatter the silent partnership. The citizen, having no reason to stay silent, would be incentivized to report the bribery to get their money back. This, in turn, would make corrupt officials think twice before demanding a bribe, leading to a dramatic drop in harassment bribes.\n\n## The Debate and the Experiment\n\nBasu's idea sparked a national controversy. It was lauded by some, including industrialist Narayana Murthy, but heavily criticized by others, including politicians from the Communist Party of India, who demanded it be withdrawn.\n\nEconomist John Dreze pointed out potential flaws. He argued that in the real world, if bribe-giving were legal, many might see it as the *easiest* way to get work done, potentially *increasing* bribery. Furthermore, citizens might still not report due to:\n*   Lack of trust that they would get their money back.\n*   Fear of harassment from other officials.\n*   Concern that their work would never be completed.\n\nTo test the theory, researchers at the University of Hyderabad conducted an experiment with 360 students role-playing as citizens and officials.\n\n*   **Under the current law (Symmetric Liability):** Participants behaved exactly as Basu predicted—bribes were paid, and no one reported them.\n*   **Under Basu's law (Asymmetric Liability):** Citizens began reporting bribes, just as Basu's model predicted.\n\nHowever, when researchers introduced real-world complexities—like no guarantee of a refund or the risk of post-complaint harassment—the rate of reporting dropped significantly, validating Dreze's criticisms.\n\n## The Way Forward: Enforcement and Protection\n\nThe research concluded that people will only report corruption when two conditions are met:\n1.  **Punishment for the Corrupt:** There is a genuine and visible enforcement mechanism that punishes the corrupt official.\n2.  **Protection for the Complainant:** The identity of the complainant is protected through robust whistleblower policies, and they are shielded from retaliation.\n\nThe example of **Singapore** is instructive. In the 1960s, corruption was rampant at every level. Today, it is one of the least corrupt nations, thanks to its strong anti-corruption body, the Corrupt Practices Investigation Bureau (CPIB), which impartially investigates every complaint.\n\nCloser to home, the Indore Municipal Corporation's success in fining thousands of people for littering shows that consistent on-the-spot enforcement delivers results.\n\nThe arrest of Dr. Amit Kumar Singhal is a significant action. But for every such case that makes headlines, countless harassment bribes are paid in silence. The ultimate solution lies not just in high-profile stings, but in building a system where enforcement is certain, investigation is impartial, and the common citizen feels safe enough to say \"no\" without fear of losing their legal rights.",
  "category": "NEWS",
  "time_to_read": "7 min read",
  "article_link": "https://unhook-production.up.railway.app/article/fbc70fb0-d0e9-435f-98e3-bea69b514b6d",
  "article_source": "Teerth",
  "external_id": "GMGNMXAoEvs",
  "youtube_channel": "mohak_mangal",
  "published_at": "2025-10-27T14:30:58.000Z",
  "cached_at": "2025-10-28T17:00:50.669Z"
}