{
  "id": "c524bcdd-f48b-42db-baa3-3f04eaed1419",
  "external_id": "K1itLsGmWv0",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-08-23T09:30:23+00:00",
  "created_at": "2025-08-23T06:30:03.826294+00:00",
  "updated_at": "2025-08-23T06:42:53.324123+00:00",
  "reading_time_seconds": 678,
  "category": {
    "category": "EDUCATION",
    "shelf_life": "PERMANENT",
    "geography": "IN"
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "How India Measures Inflation: WPI, CPI, and GDP Deflator Explained"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "This video explains how inflation is measured in India, focusing on key indices like the Wholesale Price Index (WPI) and Consumer Price Index (CPI). WPI tracks price changes at the wholesale level and is released monthly by the Ministry of Commerce, using a basket of goods divided into primary articles, manufactured products, and fuel & power, each with specific weightages. CPI measures retail-level price changes, directly reflecting the cost of living, and includes both goods and services. It is categorized for rural laborers, agricultural laborers, and industrial workers. The GDP deflator offers a comprehensive measure by comparing nominal and real GDP but is released quarterly. The video also touches on limitations like outdated baskets and the shift of RBI’s policy focus from WPI to CPI. Inflation targeting in India aims to keep inflation within a 2–6% range."
    },
    "LONG": {
      "markdown_string": "# How India Measures Inflation: WPI, CPI, and GDP Deflator Explained\n\nWelcome back to the **Easy Economy Series**, where we break down complex economic concepts into simple, everyday language. In this second installment on inflation, we dive deep into the mechanics of how inflation is actually measured in India—covering key terms like **Wholesale Price Index (WPI)**, **Consumer Price Index (CPI)**, and the **GDP Deflator**. Whether you're a student preparing for competitive exams or just curious about how the economy works, this guide will give you a clear, structured understanding of these essential indicators.\n\n---\n\n## What Is Inflation, Again?\n\nIn simple terms, **inflation is the rate of change in the price level** of goods and services in an economy over a specific period. When prices rise consistently across a range of products—from everyday items like vegetables and fuel to bigger purchases like cars and electronics—we say the economy is experiencing inflation.\n\nBut how do we actually calculate something as broad as “price rise” across an entire country? That’s where measurement tools come in.\n\n---\n\n## Two Main Methods of Measuring Inflation\n\nThere are two primary methods used to measure inflation:\n\n1. **Price Index Method** – which includes WPI and CPI  \n2. **GDP Deflator**\n\nLet’s start with the more commonly referenced one: the Price Index Method.\n\n---\n\n## The Price Index Method: Not Every Product Is Counted\n\nThink about it: India produces lakhs of different goods and services. Tracking the price of every single item—every pen, every vegetable, every car—is practically impossible. So economists use a smarter approach: they create a **“basket of goods”**—a selected group of items that represent the broader economy.\n\nThis basket isn’t just a random collection. Each item is given a **weightage** based on its importance in the economy. For example, fuel and electricity have a larger impact on people’s lives and production costs than, say, toys or decorative items. So they carry more weight in inflation calculations.\n\nThere are two major types of price indices you need to know:\n\n- **Wholesale Price Index (WPI)**\n- **Consumer Price Index (CPI)**\n\nTo measure change, we also need a **base year**—a reference point against which we compare current prices. For instance, if the base year is set at an index value of 100, and the current index rises to 110, that indicates a 10% inflation rate. If it reaches 150, inflation is 50%.\n\n---\n\n## Wholesale Price Index (WPI) – Measuring Inflation at the Wholesale Level\n\nThe **Wholesale Price Index (WPI)** tracks price changes of goods at the **wholesale level**—that is, before products reach retail consumers.\n\n### How the Supply Chain Works:\n\nManufacturer → Wholesaler → Retailer → Consumer\n\nWPI measures the price changes between manufacturers and wholesalers. This is important because **increases at the wholesale level often get passed down** to retailers and eventually to consumers. So, if WPI rises, retail prices (and CPI) are likely to follow.\n\n### Who Releases WPI Data?\n\nIn India, the **Office of the Economic Advisor**, under the **Department for Promotion of Industry and Internal Trade (DPIIT)**, Ministry of Commerce and Industry, releases WPI data every month.\n\n### What’s Inside the WPI Basket?\n\nThe W basket is divided into three categories:\n\n1. **Primary Articles** (22.62% weight)  \n   - Includes food items, non-food articles, and minerals.  \n   - 117 items in total.\n\n2. **Fuel & Power** (13.15% weight)  \n   - Includes electricity, coal, mineral oils, LPG, etc.  \n   - 16 items.\n\n3. **Manufactured Products** (64.23% weight)  \n   - Includes textiles, chemicals, machinery, tools, etc.  \n   - 564 items.\n\nThe current base year for WPI is **2011–12**. Earlier, it was 2004–05. The number of items and their weightages are periodically revised to reflect changes in the economy.\n\n### Why Is WPI Important?\n\n- It helps monitor **price trends at the wholesale level**.\n- It serves as an **early indicator** of retail inflation.\n- It aids in **policy formulation**—though the Reserve Bank of India (RBI) now uses CPI as its primary gauge for monetary policy.\n\n---\n\n*This is the first part of a detailed guide on inflation measurement in India. In the next section, we’ll break down the Consumer Price Index (CPI), how it differs from WPI, and why it matters more to the common person. Stay tuned!*\n## Limitations of WPI and the Shift to CPI\n\nWhile the Wholesale Price Index (WPI) remains a vital tool for understanding inflation trends at the producer and wholesale levels, it comes with significant limitations that affect its accuracy and relevance in today’s economy.\n\n### Key Limitations of WPI\n\n1. **Exclusion of Services**:  \n   One of the most glaring gaps in WPI is its omission of the services sector. The index covers goods like food, fuel, and manufactured products but ignores services—which form a substantial and growing part of India’s economy. This means WPI fails to reflect price changes in sectors like healthcare, education, IT services, banking, and transportation. In contrast, the Consumer Price Index (CPI) includes services, making it a more comprehensive measure of cost-of-living changes.\n\n2. **No Direct Reflection of Consumer Prices**:  \n   Since WPI tracks prices at the wholesale level, it doesn’t directly capture what consumers actually pay. There’s often a lag and a markup between wholesale and retail prices due to distribution costs, taxes, and retailer margins. As a result, WPI may not accurately represent the inflation experienced by households.\n\n3. **Data Lags and Outdated Basket**:  \n   The basket of goods used in WPI is updated infrequently. The current base year is 2011–12—over a decade old. Consumption patterns have evolved significantly since then, with new products entering the market and old ones fading out. An outdated basket means WPI may not fully capture contemporary consumption trends, reducing its relevance.\n\n4. **High Volatility**:  \n   WPI is highly sensitive to price swings in a few volatile categories, such as fuel and primary articles. Even though these categories have relatively low weightages (e.g., Fuel & Power has a weight of just 13%), sharp price increases here can disproportionately inflate the overall index. In contrast, categories with more items but stable prices (like Manufactured Products) may not offset these spikes effectively.\n\n### Introducing the Consumer Price Index (CPI)\n\nGiven these limitations, it’s no surprise that the Reserve Bank of India (RBI) and policymakers now rely more heavily on the **Consumer Price Index (CPI)** for monetary policy decisions. Unlike WPI, CPI measures the average change over time in the prices paid by urban and rural consumers for a basket of goods and services.\n\n#### How CPI Is Calculated\n\nCPI is computed using the formula:\n\n\\[\n\\text{CPI} = \\left( \\frac{\\text{Cost of Basket in Current Year}}{\\text{Cost of Basket in Base Year}} \\right) \\times 100\n\\]\n\nFor example:\n- If the basket cost ₹80 in the base year (say, 2011–12) and ₹100 in the current year,  \n- CPI = (100 / 80) × 100 = 125\n\nThis indicates a 25% increase in the price level compared to the base year—meaning inflation of 25%.\n\n#### Composition and Weightage of CPI\n\nThe CPI basket is carefully designed to reflect typical household consumption. Major categories and their approximate weightages are:\n\n- **Food and Beverages**: 45.9%  \n- **Miscellaneous**: 28.4% (includes services like health, education, transport)  \n- **Housing**: 10.1%  \n- **Fuel and Light**: 6.8%  \n- **Clothing and Footwear**: 6.5%  \n- **Pan, Tobacco, and Intoxicants**: 2.4%\n\nThese weightages reveal why food price inflation has such a strong impact on overall CPI. A sharp rise in vegetable or grain prices can push the index upward significantly, even if other categories remain stable.\n\n#### Types of CPI in India\n\nIndia uses multiple CPI indices to capture inflation experiences across different population segments:\n\n- **CPI for Rural Labourers (CPI-RL)**: Tracks inflation for rural workers; includes 260 items.\n- **CPI for Agricultural Labourers (CPI-AL)**: Specifically for those employed in agriculture.\n- **CPI for Industrial Workers (CPI-IW)**: Covers urban industrial workers and government employees; includes 370 items. This index is especially important as it influences **Dearness Allowance (DA)** adjustments for government staff.\n\nThe **National Statistical Office (NSO)** releases the general CPI, while the **Labour Bureau** publishes the sector-specific indices (CPI-RL, CPI-AL, CPI-IW).\n\n### Why CPI Matters More Today\n\nThe RBI formally adopted CPI as its primary inflation gauge in 2014, moving away from WPI. This shift was driven by CPI’s better alignment with:\n- Cost of living\n- Household purchasing power\n- Service-sector inflation\n\nThe RBI’s inflation target is now centered around **4% CPI inflation**, with a tolerance band of 2–6%. This makes CPI not just a statistical measure, but a cornerstone of India’s monetary policy.\n\n---\n\n## Up Next: Producer Price Index and GDP Deflator\n\nWhile WPI and CPI are the most widely cited inflation measures, two other indicators—the **Producer Price Index (PPI)** and the **GDP Deflator**—offer additional perspectives on price changes. In the final section, we’ll explore how these are calculated, their uses, and how they complete India’s inflation-measurement framework.\n## The GDP Deflator: A Comprehensive but Lagging Measure\n\nWhile WPI and CPI focus on specific baskets of goods (and in CPI’s case, services), the **GDP deflator** offers the broadest possible view of inflation across the entire economy. Also known as the **implicit price deflator**, it doesn’t track individual items. Instead, it reflects price changes for all goods and services produced within the country—making it the most comprehensive inflation measure available.\n\nThe formula is straightforward:\n\n**GDP Deflator = (Nominal GDP ÷ Real GDP) × 100**\n\nHere’s what that means in practice:\n- **Nominal GDP** is the value of all goods and services produced in a year, measured at current market prices.\n- **Real GDP** is that same output, but valued using the prices of a base year (to strip out the effect of inflation).\n\nFor example:\n- Suppose nominal GDP this year is ₹1,000.\n- Real GDP (calculated using last year’s prices) is ₹800.\n- Then, GDP Deflator = (1000 ÷ 800) × 100 = 125.\n\nThis implies that the overall price level in the economy has increased by 25% compared to the base year.\n\n### Advantages and Limitations\n\n**Advantages:**\n- **Comprehensiveness**: Captures price changes across all sectors—agriculture, industry, and services—not just a fixed basket.\n- **Dynamic Basket**: Automatically updates with changes in consumption and production patterns, unlike WPI or CPI, which use fixed weightages revised only periodically.\n\n**Limitations:**\n- **Low Frequency**: GDP data—and by extension, the deflator—is released quarterly, not monthly. There’s also a significant time lag. For instance, Q1 (April–June) GDP figures are typically published by the end of August.\n- **Not for Short-Term Analysis**: Due to its lag, the GDP deflator is more useful for long-term economic analysis rather than monthly inflation tracking.\n\n---\n\n## Other Important Inflation Measures\n\n### Services Price Index\n\nThis would track changes in prices charged by service providers—similar to how WPI tracks goods at the producer level. Sectors like transport, hotels, real estate, IT, and communications would be included. Surprisingly, **India does not yet officially release a Services Price Index**, despite services contributing nearly 60% to GDP. This is a major gap in India’s economic data infrastructure.\n\n### Housing Price Index\n\nLaunched in July 2007 by the National Housing Bank (NHB), this index tracks quarterly changes in residential property prices across major Indian cities. It brings transparency to the real estate market and assists policymakers in understanding housing inflation trends—a critical component of household financial health.\n\n---\n\n## Inflation Targeting: The RBI’s Framework\n\nA pivotal reform in India’s monetary policy was the introduction of **inflation targeting** in 2016. This framework mandates the Reserve Bank of India (RBI) to maintain inflation within a specific target range.\n\n### How It Works:\n- The target is set every five years in consultation with the government. The current target (since 2016, extended to 2026) is **4% inflation, with a tolerance band of ±2%**—meaning inflation should ideally remain between 2% and 6%.\n- A six-member **Monetary Policy Committee (MPC)** decides key policy rates (like the repo rate) to achieve this target. The committee includes three RBI representatives and three external members appointed by the government.\n- Decisions are made by majority vote. In case of a tie, the RBI Governor holds the casting vote.\n- If inflation remains outside the target band for **three consecutive quarters**, the RBI must submit a formal report to the government explaining the reasons and outlining corrective measures.\n\n### Why It Matters:\nInflation targeting:\n- Enhances policy transparency and predictability.\n- Reduces speculative behavior in markets.\n- Anchors public expectations, making long-term financial planning more stable.\n- Prevents extreme scenarios, like the double-digit inflation India experienced during the 2008–10 global financial crisis.\n\n---\n\n## Conclusion: A Multi-Dimensional View\n\nUnderstanding inflation in India requires looking through multiple lenses—each with its own purpose and limitations. The **WPI** reflects producer-side price pressures, the **CPI** captures what consumers actually experience, and the **GDP deflator** offers a macro view of the entire economy. While useful, these are supplemented by specialized indices like the Housing Price Index—and hampered by the absence of a Services Price Index.\n\nMost importantly, since 2016, India’s approach to inflation has been guided by a clear, rule-based framework. Inflation targeting has brought discipline, transparency, and stability to monetary policy—helping avoid the volatile price swings of the past.\n\nFor investors, policymakers, and everyday citizens, these measures aren’t just statistical concepts—they’re tools that shape economic expectations, influence interest rates, and affect everything from mortgage repayments to national growth strategies. Keeping an eye on these indicators helps decode the story of India’s economy—one number at a time.\n\n---\n*This article is part of a series on key economic concepts. For more explainers on GDP, fiscal policy, and monetary terms, check out our dedicated economics playlist. Interested in structured learning for competitive exams? Explore our courses designed for long-term success.*",
      "string": "# How India Measures Inflation: WPI, CPI, and GDP Deflator Explained\n\nWelcome back to the **Easy Economy Series**, where we break down complex economic concepts into simple, everyday language. In this second installment on inflation, we dive deep into the mechanics of how inflation is actually measured in India—covering key terms like **Wholesale Price Index (WPI)**, **Consumer Price Index (CPI)**, and the **GDP Deflator**. Whether you're a student preparing for competitive exams or just curious about how the economy works, this guide will give you a clear, structured understanding of these essential indicators.\n\n---\n\n## What Is Inflation, Again?\n\nIn simple terms, **inflation is the rate of change in the price level** of goods and services in an economy over a specific period. When prices rise consistently across a range of products—from everyday items like vegetables and fuel to bigger purchases like cars and electronics—we say the economy is experiencing inflation.\n\nBut how do we actually calculate something as broad as “price rise” across an entire country? That’s where measurement tools come in.\n\n---\n\n## Two Main Methods of Measuring Inflation\n\nThere are two primary methods used to measure inflation:\n\n1. **Price Index Method** – which includes WPI and CPI  \n2. **GDP Deflator**\n\nLet’s start with the more commonly referenced one: the Price Index Method.\n\n---\n\n## The Price Index Method: Not Every Product Is Counted\n\nThink about it: India produces lakhs of different goods and services. Tracking the price of every single item—every pen, every vegetable, every car—is practically impossible. So economists use a smarter approach: they create a **“basket of goods”**—a selected group of items that represent the broader economy.\n\nThis basket isn’t just a random collection. Each item is given a **weightage** based on its importance in the economy. For example, fuel and electricity have a larger impact on people’s lives and production costs than, say, toys or decorative items. So they carry more weight in inflation calculations.\n\nThere are two major types of price indices you need to know:\n\n- **Wholesale Price Index (WPI)**\n- **Consumer Price Index (CPI)**\n\nTo measure change, we also need a **base year**—a reference point against which we compare current prices. For instance, if the base year is set at an index value of 100, and the current index rises to 110, that indicates a 10% inflation rate. If it reaches 150, inflation is 50%.\n\n---\n\n## Wholesale Price Index (WPI) – Measuring Inflation at the Wholesale Level\n\nThe **Wholesale Price Index (WPI)** tracks price changes of goods at the **wholesale level**—that is, before products reach retail consumers.\n\n### How the Supply Chain Works:\n\nManufacturer → Wholesaler → Retailer → Consumer\n\nWPI measures the price changes between manufacturers and wholesalers. This is important because **increases at the wholesale level often get passed down** to retailers and eventually to consumers. So, if WPI rises, retail prices (and CPI) are likely to follow.\n\n### Who Releases WPI Data?\n\nIn India, the **Office of the Economic Advisor**, under the **Department for Promotion of Industry and Internal Trade (DPIIT)**, Ministry of Commerce and Industry, releases WPI data every month.\n\n### What’s Inside the WPI Basket?\n\nThe W basket is divided into three categories:\n\n1. **Primary Articles** (22.62% weight)  \n   - Includes food items, non-food articles, and minerals.  \n   - 117 items in total.\n\n2. **Fuel & Power** (13.15% weight)  \n   - Includes electricity, coal, mineral oils, LPG, etc.  \n   - 16 items.\n\n3. **Manufactured Products** (64.23% weight)  \n   - Includes textiles, chemicals, machinery, tools, etc.  \n   - 564 items.\n\nThe current base year for WPI is **2011–12**. Earlier, it was 2004–05. The number of items and their weightages are periodically revised to reflect changes in the economy.\n\n### Why Is WPI Important?\n\n- It helps monitor **price trends at the wholesale level**.\n- It serves as an **early indicator** of retail inflation.\n- It aids in **policy formulation**—though the Reserve Bank of India (RBI) now uses CPI as its primary gauge for monetary policy.\n\n---\n\n*This is the first part of a detailed guide on inflation measurement in India. In the next section, we’ll break down the Consumer Price Index (CPI), how it differs from WPI, and why it matters more to the common person. Stay tuned!*\n## Limitations of WPI and the Shift to CPI\n\nWhile the Wholesale Price Index (WPI) remains a vital tool for understanding inflation trends at the producer and wholesale levels, it comes with significant limitations that affect its accuracy and relevance in today’s economy.\n\n### Key Limitations of WPI\n\n1. **Exclusion of Services**:  \n   One of the most glaring gaps in WPI is its omission of the services sector. The index covers goods like food, fuel, and manufactured products but ignores services—which form a substantial and growing part of India’s economy. This means WPI fails to reflect price changes in sectors like healthcare, education, IT services, banking, and transportation. In contrast, the Consumer Price Index (CPI) includes services, making it a more comprehensive measure of cost-of-living changes.\n\n2. **No Direct Reflection of Consumer Prices**:  \n   Since WPI tracks prices at the wholesale level, it doesn’t directly capture what consumers actually pay. There’s often a lag and a markup between wholesale and retail prices due to distribution costs, taxes, and retailer margins. As a result, WPI may not accurately represent the inflation experienced by households.\n\n3. **Data Lags and Outdated Basket**:  \n   The basket of goods used in WPI is updated infrequently. The current base year is 2011–12—over a decade old. Consumption patterns have evolved significantly since then, with new products entering the market and old ones fading out. An outdated basket means WPI may not fully capture contemporary consumption trends, reducing its relevance.\n\n4. **High Volatility**:  \n   WPI is highly sensitive to price swings in a few volatile categories, such as fuel and primary articles. Even though these categories have relatively low weightages (e.g., Fuel & Power has a weight of just 13%), sharp price increases here can disproportionately inflate the overall index. In contrast, categories with more items but stable prices (like Manufactured Products) may not offset these spikes effectively.\n\n### Introducing the Consumer Price Index (CPI)\n\nGiven these limitations, it’s no surprise that the Reserve Bank of India (RBI) and policymakers now rely more heavily on the **Consumer Price Index (CPI)** for monetary policy decisions. Unlike WPI, CPI measures the average change over time in the prices paid by urban and rural consumers for a basket of goods and services.\n\n#### How CPI Is Calculated\n\nCPI is computed using the formula:\n\n\\[\n\\text{CPI} = \\left( \\frac{\\text{Cost of Basket in Current Year}}{\\text{Cost of Basket in Base Year}} \\right) \\times 100\n\\]\n\nFor example:\n- If the basket cost ₹80 in the base year (say, 2011–12) and ₹100 in the current year,  \n- CPI = (100 / 80) × 100 = 125\n\nThis indicates a 25% increase in the price level compared to the base year—meaning inflation of 25%.\n\n#### Composition and Weightage of CPI\n\nThe CPI basket is carefully designed to reflect typical household consumption. Major categories and their approximate weightages are:\n\n- **Food and Beverages**: 45.9%  \n- **Miscellaneous**: 28.4% (includes services like health, education, transport)  \n- **Housing**: 10.1%  \n- **Fuel and Light**: 6.8%  \n- **Clothing and Footwear**: 6.5%  \n- **Pan, Tobacco, and Intoxicants**: 2.4%\n\nThese weightages reveal why food price inflation has such a strong impact on overall CPI. A sharp rise in vegetable or grain prices can push the index upward significantly, even if other categories remain stable.\n\n#### Types of CPI in India\n\nIndia uses multiple CPI indices to capture inflation experiences across different population segments:\n\n- **CPI for Rural Labourers (CPI-RL)**: Tracks inflation for rural workers; includes 260 items.\n- **CPI for Agricultural Labourers (CPI-AL)**: Specifically for those employed in agriculture.\n- **CPI for Industrial Workers (CPI-IW)**: Covers urban industrial workers and government employees; includes 370 items. This index is especially important as it influences **Dearness Allowance (DA)** adjustments for government staff.\n\nThe **National Statistical Office (NSO)** releases the general CPI, while the **Labour Bureau** publishes the sector-specific indices (CPI-RL, CPI-AL, CPI-IW).\n\n### Why CPI Matters More Today\n\nThe RBI formally adopted CPI as its primary inflation gauge in 2014, moving away from WPI. This shift was driven by CPI’s better alignment with:\n- Cost of living\n- Household purchasing power\n- Service-sector inflation\n\nThe RBI’s inflation target is now centered around **4% CPI inflation**, with a tolerance band of 2–6%. This makes CPI not just a statistical measure, but a cornerstone of India’s monetary policy.\n\n---\n\n## Up Next: Producer Price Index and GDP Deflator\n\nWhile WPI and CPI are the most widely cited inflation measures, two other indicators—the **Producer Price Index (PPI)** and the **GDP Deflator**—offer additional perspectives on price changes. In the final section, we’ll explore how these are calculated, their uses, and how they complete India’s inflation-measurement framework.\n## The GDP Deflator: A Comprehensive but Lagging Measure\n\nWhile WPI and CPI focus on specific baskets of goods (and in CPI’s case, services), the **GDP deflator** offers the broadest possible view of inflation across the entire economy. Also known as the **implicit price deflator**, it doesn’t track individual items. Instead, it reflects price changes for all goods and services produced within the country—making it the most comprehensive inflation measure available.\n\nThe formula is straightforward:\n\n**GDP Deflator = (Nominal GDP ÷ Real GDP) × 100**\n\nHere’s what that means in practice:\n- **Nominal GDP** is the value of all goods and services produced in a year, measured at current market prices.\n- **Real GDP** is that same output, but valued using the prices of a base year (to strip out the effect of inflation).\n\nFor example:\n- Suppose nominal GDP this year is ₹1,000.\n- Real GDP (calculated using last year’s prices) is ₹800.\n- Then, GDP Deflator = (1000 ÷ 800) × 100 = 125.\n\nThis implies that the overall price level in the economy has increased by 25% compared to the base year.\n\n### Advantages and Limitations\n\n**Advantages:**\n- **Comprehensiveness**: Captures price changes across all sectors—agriculture, industry, and services—not just a fixed basket.\n- **Dynamic Basket**: Automatically updates with changes in consumption and production patterns, unlike WPI or CPI, which use fixed weightages revised only periodically.\n\n**Limitations:**\n- **Low Frequency**: GDP data—and by extension, the deflator—is released quarterly, not monthly. There’s also a significant time lag. For instance, Q1 (April–June) GDP figures are typically published by the end of August.\n- **Not for Short-Term Analysis**: Due to its lag, the GDP deflator is more useful for long-term economic analysis rather than monthly inflation tracking.\n\n---\n\n## Other Important Inflation Measures\n\n### Services Price Index\n\nThis would track changes in prices charged by service providers—similar to how WPI tracks goods at the producer level. Sectors like transport, hotels, real estate, IT, and communications would be included. Surprisingly, **India does not yet officially release a Services Price Index**, despite services contributing nearly 60% to GDP. This is a major gap in India’s economic data infrastructure.\n\n### Housing Price Index\n\nLaunched in July 2007 by the National Housing Bank (NHB), this index tracks quarterly changes in residential property prices across major Indian cities. It brings transparency to the real estate market and assists policymakers in understanding housing inflation trends—a critical component of household financial health.\n\n---\n\n## Inflation Targeting: The RBI’s Framework\n\nA pivotal reform in India’s monetary policy was the introduction of **inflation targeting** in 2016. This framework mandates the Reserve Bank of India (RBI) to maintain inflation within a specific target range.\n\n### How It Works:\n- The target is set every five years in consultation with the government. The current target (since 2016, extended to 2026) is **4% inflation, with a tolerance band of ±2%**—meaning inflation should ideally remain between 2% and 6%.\n- A six-member **Monetary Policy Committee (MPC)** decides key policy rates (like the repo rate) to achieve this target. The committee includes three RBI representatives and three external members appointed by the government.\n- Decisions are made by majority vote. In case of a tie, the RBI Governor holds the casting vote.\n- If inflation remains outside the target band for **three consecutive quarters**, the RBI must submit a formal report to the government explaining the reasons and outlining corrective measures.\n\n### Why It Matters:\nInflation targeting:\n- Enhances policy transparency and predictability.\n- Reduces speculative behavior in markets.\n- Anchors public expectations, making long-term financial planning more stable.\n- Prevents extreme scenarios, like the double-digit inflation India experienced during the 2008–10 global financial crisis.\n\n---\n\n## Conclusion: A Multi-Dimensional View\n\nUnderstanding inflation in India requires looking through multiple lenses—each with its own purpose and limitations. The **WPI** reflects producer-side price pressures, the **CPI** captures what consumers actually experience, and the **GDP deflator** offers a macro view of the entire economy. While useful, these are supplemented by specialized indices like the Housing Price Index—and hampered by the absence of a Services Price Index.\n\nMost importantly, since 2016, India’s approach to inflation has been guided by a clear, rule-based framework. Inflation targeting has brought discipline, transparency, and stability to monetary policy—helping avoid the volatile price swings of the past.\n\nFor investors, policymakers, and everyday citizens, these measures aren’t just statistical concepts—they’re tools that shape economic expectations, influence interest rates, and affect everything from mortgage repayments to national growth strategies. Keeping an eye on these indicators helps decode the story of India’s economy—one number at a time.\n\n---\n*This article is part of a series on key economic concepts. For more explainers on GDP, fiscal policy, and monetary terms, check out our dedicated economics playlist. Interested in structured learning for competitive exams? Explore our courses designed for long-term success.*"
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-08-23T06:30:03.826235+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-08-23T06:32:26.788289+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-08-23T06:42:53.324099+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}