{
  "id": "855b55ed-a09e-424e-812c-4dc3053e782d",
  "external_id": "G2WOWqW5w6I",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-11-28T16:00:06+00:00",
  "created_at": "2025-11-29T06:04:30.566560+00:00",
  "updated_at": "2025-11-29T06:12:09.154148+00:00",
  "reading_time_seconds": 603,
  "category": {
    "category": "NEWS",
    "shelf_life": "PERMANENT",
    "geography": "IN"
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "The Hunt and Death of India's Most Wanted Naxalite Madvi Hidma"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "Madvi Hidma, known as the 'Ghost of Bastar,' was India's most wanted Naxalite leader responsible for over 26 attacks, 260 security personnel deaths, and 81 civilian killings. Recruited at age 10 by Maoists, he rose through ranks to lead Battalion No. 1, the deadliest strike unit. Key attacks include the 2010 Tadmetla ambush (76 CRPF deaths) and the 2013 Jhiram Valley attack (27-31 Congress leaders killed). Despite 50+ operations and 12 direct encounters, he evaded capture using jungle expertise, local support, and tactical innovations. A strategic shift by security forces, including establishing jungle bases and cutting his support lines, led to his final encounter. On November 18, 2025, Hidma was killed in a 4-hour gunfight in Andhra Pradesh's Mudreli forests, ending his decades-long insurgency."
    },
    "LONG": {
      "markdown_string": "# The Hunt and Death of India's Most Wanted Naxalite Madvi Hidma\n\n## The Ghost of Bastar\n\n**26+ attacks. 260 security personnel martyred. Over 81 civilians killed. A ₹1 crore bounty. NIA's most wanted. India's most dangerous Maoist.** This was Madvi Hidma—the man they called \"Bastar's Ghost.\" For years, he moved through dense jungles like a phantom, surviving 12 direct encounters with security forces and evading 50+ operations. How did this elusive insurgent meet his end? What new strategy finally cornered him? The answers begin in 1981, in a remote tribal village, with a boy named Deva.\n\n## From Tribal Boy to Child Soldier\n\nIn the thick forests bordering Bijapur and Sukma districts lay the village of Puverti—home to the Muria tribal community. Here, in 1981, a boy named Deva was born to Madvi Punji, who dreamed of giving her son an ordinary life. But the jungles surrounding Puverti held a different destiny.\n\nBy age 10, Hidma had only completed education up to Class 5. Resources were scarce, and the landscape was increasingly infiltrated by Maoist organizations expanding their reach. In 1991, the Maoists established *Bal Sangam*—a recruitment wing targeting children for indoctrination and training.\n\nIt was here that Deputy Commander Ramesh Pujari (alias Badanna) spotted the lean, sharp-eyed boy. Recognizing unusual potential, he recruited Hidma into Bal Sangam, handing him his first weapon and transforming him into a child soldier. Pujari later recalled in an interview: **\"His mustache hadn’t even grown yet, but he was exceptionally combative. You could see the raw potential in him.\"**\n\n## Training in the Jungle\n\nInside Bal Sangam, Hidma underwent rigorous training. He learned revolutionary songs, played traditional instruments, administered first aid, and prepared herbal medicines. But his most critical education came from the forest itself. **He learned to read the jungle like a sacred text**—every inch, every bird call, every hiding spot. Like Veerappan, he mastered guerrilla survival: where to hide, how to move, how to mimic animal sounds.\n\nRumors suggest he was even sent to the Philippines for advanced guerrilla warfare training—though officially unconfirmed, security forces noted his tactics were unusually sophisticated. \"Somewhere, he received very advanced training,\" one officer observed, \"the kind ordinary cadres don’t get.\"\n\n## Rise Through the Ranks\n\nBy 1997, Hidma was 16. Leaving Bal Sangam, he was formally inducted into the Maoist organization. His name was changed from Madvi Deva to **Madvi Hidma**. Fluent in Gondi, Halbi, Hindi, and Telugu—with some Marathi learned during postings in Gadchiroli—he was a communicator as much as a fighter.\n\nIn the early 2000s, he joined the **People's Liberation Guerrilla Army (PLGA)**—the Maoists’ elite armed wing. Only 150 carefully selected cadres, intimately familiar with the jungle, were admitted. Hidma fit the profile perfectly.\n\nHis first major appearance in security forces’ records came in 2007, following a large-scale attack in Dantewada’s Uripalmeta area. **23–24 CRPF personnel were martyred**, and Hidma—then Company 3 Commander in Bastar—was identified as the planner. This attack marked his violent entry into the national security landscape.\n\n## Personal Life and Strategic Marriage\n\nIn 2008, Hidma met Motakam Raje (alias Razakka), a female Maoist cadre, during a zonal committee meeting. He proposed immediately, but strict organizational regulations led to initial rejection. For two years, he persisted.\n\nBy 2009, his relentless operational success earned him promotion to **Deputy Commander of Battalion 1**—and soon after, its **Head**. This was an extraordinary rise: a Naxal in his mid-20s leading the CPI-Maoist’s most dangerous strike unit.\n\nBattalion 1 was composed of 150+ carefully chosen armed cadres, equipped with sophisticated weaponry: AK-47s, INSAS rifles, mortars, under-barrel grenade launchers, and locally assembled firearms. They operated in the dense forests of Sukma, Bijapur, and Dantewada—the heart of Dandakaranya.\n\nIn 2010, Razakka finally accepted his proposal. Following Maoist protocol for senior cadres, Hidma underwent sterilization before their quiet, internal wedding. Telangana and Andhra Maoists attended. Razakka became his constant companion in operations—dressed in black, armed, always by his side.\n\n## The Tadmetla Massacre: A Turning Point\n\nSix weeks after his marriage, on **April 6, 2010**, Hidma orchestrated one of the deadliest attacks in CRPF history.\n\nIn Tadmetla, between Chintalnar and Tadmetla villages, CRPF’s 62nd Battalion was conducting an area domination exercise. Hidma’s forces had already laid IEDs and landmines along the road, blowing up a small bridge to force troops into their trap.\n\nAt 5:55 AM, a CRPF vehicle carrying 70–80 personnel triggered the explosives. **A massive blast was followed by relentless firing from surrounding hills**—a trademark Hidma tactic. Despite a fierce retaliation that killed 8 Naxalites, the CRPF suffered devastating losses: **76 personnel were martyred**.\n\nInvestigations confirmed Hidma’s planning and execution. The Tadmetla attack made him infamous—a name now discussed in Maoist central committees.\n\n## The Jhiram Valley Ambush: Political Assassination\n\nOn **May 25, 2013**, Congress leaders in Chhattisgarh were conducting the *Parivartan Yatra*—a political rally traveling from Sukma to Kisanoor. As their 25-vehicle convoy entered Jhiram Valley, **250+ Maoists emerged from the jungle**.\n\nIn a meticulously planned ambush, IEDs exploded and gunfire erupted from all sides. The firing continued for 90 minutes. When security personnel ran out of ammunition, they were forced to surrender.\n\nThe aftermath was brutal:\n- **Mahendra Karma**, founder of Salwa Judum, was stabbed **78 times**—reportedly by female Naxalites—and beaten with rifle butts.\n- **Nand Kumar Patel**, senior Congress leader, was executed.\n- **V.C. Shukla**, senior Congress leader, succumbed to injuries.\n- **Dinesh Patel** was struck in the head with an axe.\n\nIn total, **27–31 people were killed**. Leaflets distributed at the scene declared the attack as \"punishment for Salwa Judum.\"\n\nThis operation—planned and overseen by Hidma—earned him promotion to the **Maoist Central Committee**. He was the **first and only member from Bastar** to achieve this—a rare feat in a committee dominated by Telangana cadres.\n\n## The Great Escape\n\nIn 2016, CRPF personnel detained seven suspects during a security check in Dantewada’s Kistaram market. One was released after interrogation failed to identify him. Later, a captured Maoist confessed: **the released man was Hidma**.\n\nIndia’s most wanted had been in custody—and slipped away. A major security lapse, it demonstrated his cunning and the challenge of identifying a man who moved like a shadow.\n\n## Back-to-Back Deadly Attacks\n\nFrom 2017 onward, Hidma intensified his assaults:\n- **March 10–12, 2017**: In Bheji, an IED blast followed by firing killed **12 CRPF personnel** during road-opening duty.\n- **April 24, 2017**: In Burkapal, Sukma, another attack on CRPF’s 74th Battalion left multiple casualties.\n\nHidma’s tactics remained consistent: IEDs, ambushes, and high-ground firing. Each operation reinforced his reputation as India’s most formidable insurgent.\n\n---\n*This is Part 1 of a two-part series. In the next installment, we explore the new strategy that finally led to Hidma’s downfall, the intelligence breakthroughs, and the final encounter that ended the reign of Bastar’s Ghost.*\n## The Final Hunt: A Ghost Cornered\n\nThe relentless pressure from the new security grid strategy began to yield results. The establishment of forward operating bases deep within the jungle, right in Hidma’s core area, had severed his vital support line—the village-level sympathizers who acted as his early-warning system. By January 2024, security forces had three direct clashes with Hidma’s Battalion No. 1. While three security personnel were martyred, a critical pattern emerged: the Maoist cadres were forced to retreat each time. The noose was tightening.\n\nThe beginning of the end was **Operation Black Forest**, launched on April 21, 2025. It was India's largest anti-Naxal operation to date. Intelligence indicated that Hidma, along with several other top Maoist leaders, was holed up in the Kargatta hills along the Chhattisgarh-Telangana border. Over 25,000 security personnel from the CRPF, DRG, COBRA, and STF were deployed. The Indian Air Force provided support with helicopter reconnaissance and drones.\n\nFor 21 grueling days, the operation unfolded. Security forces scaled hills using ropes, remained in hidden positions for days on end, and neutralized hidden IEDs and mines. The operation was a massive blow to the Maoist infrastructure:\n*   **31 top Maoist leaders and senior commanders were killed.**\n*   **450 IEDs were recovered and defused.**\n*   **35 weapons were seized.**\n*   **Four Maoist arm factories were completely busted.**\n*   For the first time, a **Mega Gauss Sniper Rifle** was recovered from the insurgents.\n\nYet, in a testament to his legendary elusiveness, Hidma managed to escape even this dragnet. Local support in the Kargatta hills was credited with his getaway. But it was clear he was running out of space and options.\n\n### The Psychological Gambit and the Final Intelligence Break\n\nIn a bold and risky move in November 2025, Chhattisgarh's Deputy CM and Home Minister, Vijay Sharma, traveled by motorcycle to Hidma's native village, Puverti. Flouting high-security risks, he met directly with Hidma’s mother, Madvi Punji. He urged her to make a public appeal for her son to surrender. In a poignant plea, she said, \"**Where are you, son? I am calling you. We will earn and eat at home. Come back to your people, to your village.**\" Similar appeals were made by the mother of Hidma’s close associate, Madvi Deva. The government offered assurances of a safe pathway for surrender.\n\nHidma did not respond. A local journalist who had been in contact with him revealed that Hidma had begun expressing a change of heart, reportedly saying, \"**If the top leadership agrees, if my group gives consent, I will also surrender. I have understood that we cannot force our ideology on people at gunpoint.**\"\n\nSimultaneously, another intelligence stream suggested his own comrades in Telangana were blocking his entry, leaving him isolated and exposed. The fear of being cornered was palpable. On November 16, intelligence confirmed that after the Sukma encounter, Hidma had fled towards Andhra Pradesh.\n\nThis time, the intelligence was different. It was precise and actionable, coming from local sources who were now cooperating with the security forces, not Hidma. The tide had definitively turned.\n\n### The Last Stand in the Mudreli Forests\n\nActing on this golden tip, security forces launched a secret, hot-operation. Abandoning the massive battalion deployments of the past that would alert any remaining sympathizers, they relied on a highly mobile strike unit. For **34 hours**, they continuously tracked Hidma’s movements in the Andhra Pradesh belt.\n\nFinally, at 2:00 AM, a precise operation began in the dense Mudreli forests. Multiple security cordons were positioned to block all possible escape routes. A small, highly mobile unit of Andhra Pradesh's Grey Horn Commandos moved in for the strike.\n\nThe encounter lasted four hours. As the smoke cleared around 6:00-7:00 AM, it was over. India's most wanted Maoist, **Madvi Hidma, lay dead on the ground.** His wife, Razakka, and four of his associates were also killed in the final firefight.\n\nThe recovery from the site was telling of his operational life: two AK-47 rifles, a pistol, a revolver, a short gun, wires, detonators, a camera, a flashlight, and crucially, **a diary**. This diary provided further intelligence that led to more arrests.\n\nThe operation was completed on November 18, 2025—a full 12 days before the deadline set by Union Home Minister Amit Shah, who had explicitly directed security officials to eliminate Hidma by November 30.\n\n### The Aftermath and a Violent Legacy\n\nHidma's death triggered a wave of surrenders. At the time of this reporting, 15 Maoists, most from his own Battalion No. 1 and some with bounties of up to ₹48 lakh on their heads, had laid down their arms. His successor as commander, Barsa Deva—a longtime associate—was now the primary target.\n\nThe final tally of Madvi Hidma's brutal career is staggering:\n*   **260+ security personnel martyred.**\n*   **81 civilians killed.**\n*   **26+ major attacks carried out.**\n\nHis reign of terror, built on a deep knowledge of the jungle, ruthless tactics, and a network of local support, was finally over. His end was not the result of one lucky shot, but a sustained, strategic campaign that adapted, isolated, and relentlessly pursued the \"Ghost of Bastar\" until he had nowhere left to run. The hunt for India's most dangerous Naxalite demonstrated that even the most elusive insurgency can be countered with patience, intelligence, and an unwavering commitment to reclaim the land, inch by bloody inch.",
      "string": "# The Hunt and Death of India's Most Wanted Naxalite Madvi Hidma\n\n## The Ghost of Bastar\n\n**26+ attacks. 260 security personnel martyred. Over 81 civilians killed. A ₹1 crore bounty. NIA's most wanted. India's most dangerous Maoist.** This was Madvi Hidma—the man they called \"Bastar's Ghost.\" For years, he moved through dense jungles like a phantom, surviving 12 direct encounters with security forces and evading 50+ operations. How did this elusive insurgent meet his end? What new strategy finally cornered him? The answers begin in 1981, in a remote tribal village, with a boy named Deva.\n\n## From Tribal Boy to Child Soldier\n\nIn the thick forests bordering Bijapur and Sukma districts lay the village of Puverti—home to the Muria tribal community. Here, in 1981, a boy named Deva was born to Madvi Punji, who dreamed of giving her son an ordinary life. But the jungles surrounding Puverti held a different destiny.\n\nBy age 10, Hidma had only completed education up to Class 5. Resources were scarce, and the landscape was increasingly infiltrated by Maoist organizations expanding their reach. In 1991, the Maoists established *Bal Sangam*—a recruitment wing targeting children for indoctrination and training.\n\nIt was here that Deputy Commander Ramesh Pujari (alias Badanna) spotted the lean, sharp-eyed boy. Recognizing unusual potential, he recruited Hidma into Bal Sangam, handing him his first weapon and transforming him into a child soldier. Pujari later recalled in an interview: **\"His mustache hadn’t even grown yet, but he was exceptionally combative. You could see the raw potential in him.\"**\n\n## Training in the Jungle\n\nInside Bal Sangam, Hidma underwent rigorous training. He learned revolutionary songs, played traditional instruments, administered first aid, and prepared herbal medicines. But his most critical education came from the forest itself. **He learned to read the jungle like a sacred text**—every inch, every bird call, every hiding spot. Like Veerappan, he mastered guerrilla survival: where to hide, how to move, how to mimic animal sounds.\n\nRumors suggest he was even sent to the Philippines for advanced guerrilla warfare training—though officially unconfirmed, security forces noted his tactics were unusually sophisticated. \"Somewhere, he received very advanced training,\" one officer observed, \"the kind ordinary cadres don’t get.\"\n\n## Rise Through the Ranks\n\nBy 1997, Hidma was 16. Leaving Bal Sangam, he was formally inducted into the Maoist organization. His name was changed from Madvi Deva to **Madvi Hidma**. Fluent in Gondi, Halbi, Hindi, and Telugu—with some Marathi learned during postings in Gadchiroli—he was a communicator as much as a fighter.\n\nIn the early 2000s, he joined the **People's Liberation Guerrilla Army (PLGA)**—the Maoists’ elite armed wing. Only 150 carefully selected cadres, intimately familiar with the jungle, were admitted. Hidma fit the profile perfectly.\n\nHis first major appearance in security forces’ records came in 2007, following a large-scale attack in Dantewada’s Uripalmeta area. **23–24 CRPF personnel were martyred**, and Hidma—then Company 3 Commander in Bastar—was identified as the planner. This attack marked his violent entry into the national security landscape.\n\n## Personal Life and Strategic Marriage\n\nIn 2008, Hidma met Motakam Raje (alias Razakka), a female Maoist cadre, during a zonal committee meeting. He proposed immediately, but strict organizational regulations led to initial rejection. For two years, he persisted.\n\nBy 2009, his relentless operational success earned him promotion to **Deputy Commander of Battalion 1**—and soon after, its **Head**. This was an extraordinary rise: a Naxal in his mid-20s leading the CPI-Maoist’s most dangerous strike unit.\n\nBattalion 1 was composed of 150+ carefully chosen armed cadres, equipped with sophisticated weaponry: AK-47s, INSAS rifles, mortars, under-barrel grenade launchers, and locally assembled firearms. They operated in the dense forests of Sukma, Bijapur, and Dantewada—the heart of Dandakaranya.\n\nIn 2010, Razakka finally accepted his proposal. Following Maoist protocol for senior cadres, Hidma underwent sterilization before their quiet, internal wedding. Telangana and Andhra Maoists attended. Razakka became his constant companion in operations—dressed in black, armed, always by his side.\n\n## The Tadmetla Massacre: A Turning Point\n\nSix weeks after his marriage, on **April 6, 2010**, Hidma orchestrated one of the deadliest attacks in CRPF history.\n\nIn Tadmetla, between Chintalnar and Tadmetla villages, CRPF’s 62nd Battalion was conducting an area domination exercise. Hidma’s forces had already laid IEDs and landmines along the road, blowing up a small bridge to force troops into their trap.\n\nAt 5:55 AM, a CRPF vehicle carrying 70–80 personnel triggered the explosives. **A massive blast was followed by relentless firing from surrounding hills**—a trademark Hidma tactic. Despite a fierce retaliation that killed 8 Naxalites, the CRPF suffered devastating losses: **76 personnel were martyred**.\n\nInvestigations confirmed Hidma’s planning and execution. The Tadmetla attack made him infamous—a name now discussed in Maoist central committees.\n\n## The Jhiram Valley Ambush: Political Assassination\n\nOn **May 25, 2013**, Congress leaders in Chhattisgarh were conducting the *Parivartan Yatra*—a political rally traveling from Sukma to Kisanoor. As their 25-vehicle convoy entered Jhiram Valley, **250+ Maoists emerged from the jungle**.\n\nIn a meticulously planned ambush, IEDs exploded and gunfire erupted from all sides. The firing continued for 90 minutes. When security personnel ran out of ammunition, they were forced to surrender.\n\nThe aftermath was brutal:\n- **Mahendra Karma**, founder of Salwa Judum, was stabbed **78 times**—reportedly by female Naxalites—and beaten with rifle butts.\n- **Nand Kumar Patel**, senior Congress leader, was executed.\n- **V.C. Shukla**, senior Congress leader, succumbed to injuries.\n- **Dinesh Patel** was struck in the head with an axe.\n\nIn total, **27–31 people were killed**. Leaflets distributed at the scene declared the attack as \"punishment for Salwa Judum.\"\n\nThis operation—planned and overseen by Hidma—earned him promotion to the **Maoist Central Committee**. He was the **first and only member from Bastar** to achieve this—a rare feat in a committee dominated by Telangana cadres.\n\n## The Great Escape\n\nIn 2016, CRPF personnel detained seven suspects during a security check in Dantewada’s Kistaram market. One was released after interrogation failed to identify him. Later, a captured Maoist confessed: **the released man was Hidma**.\n\nIndia’s most wanted had been in custody—and slipped away. A major security lapse, it demonstrated his cunning and the challenge of identifying a man who moved like a shadow.\n\n## Back-to-Back Deadly Attacks\n\nFrom 2017 onward, Hidma intensified his assaults:\n- **March 10–12, 2017**: In Bheji, an IED blast followed by firing killed **12 CRPF personnel** during road-opening duty.\n- **April 24, 2017**: In Burkapal, Sukma, another attack on CRPF’s 74th Battalion left multiple casualties.\n\nHidma’s tactics remained consistent: IEDs, ambushes, and high-ground firing. Each operation reinforced his reputation as India’s most formidable insurgent.\n\n---\n*This is Part 1 of a two-part series. In the next installment, we explore the new strategy that finally led to Hidma’s downfall, the intelligence breakthroughs, and the final encounter that ended the reign of Bastar’s Ghost.*\n## The Final Hunt: A Ghost Cornered\n\nThe relentless pressure from the new security grid strategy began to yield results. The establishment of forward operating bases deep within the jungle, right in Hidma’s core area, had severed his vital support line—the village-level sympathizers who acted as his early-warning system. By January 2024, security forces had three direct clashes with Hidma’s Battalion No. 1. While three security personnel were martyred, a critical pattern emerged: the Maoist cadres were forced to retreat each time. The noose was tightening.\n\nThe beginning of the end was **Operation Black Forest**, launched on April 21, 2025. It was India's largest anti-Naxal operation to date. Intelligence indicated that Hidma, along with several other top Maoist leaders, was holed up in the Kargatta hills along the Chhattisgarh-Telangana border. Over 25,000 security personnel from the CRPF, DRG, COBRA, and STF were deployed. The Indian Air Force provided support with helicopter reconnaissance and drones.\n\nFor 21 grueling days, the operation unfolded. Security forces scaled hills using ropes, remained in hidden positions for days on end, and neutralized hidden IEDs and mines. The operation was a massive blow to the Maoist infrastructure:\n*   **31 top Maoist leaders and senior commanders were killed.**\n*   **450 IEDs were recovered and defused.**\n*   **35 weapons were seized.**\n*   **Four Maoist arm factories were completely busted.**\n*   For the first time, a **Mega Gauss Sniper Rifle** was recovered from the insurgents.\n\nYet, in a testament to his legendary elusiveness, Hidma managed to escape even this dragnet. Local support in the Kargatta hills was credited with his getaway. But it was clear he was running out of space and options.\n\n### The Psychological Gambit and the Final Intelligence Break\n\nIn a bold and risky move in November 2025, Chhattisgarh's Deputy CM and Home Minister, Vijay Sharma, traveled by motorcycle to Hidma's native village, Puverti. Flouting high-security risks, he met directly with Hidma’s mother, Madvi Punji. He urged her to make a public appeal for her son to surrender. In a poignant plea, she said, \"**Where are you, son? I am calling you. We will earn and eat at home. Come back to your people, to your village.**\" Similar appeals were made by the mother of Hidma’s close associate, Madvi Deva. The government offered assurances of a safe pathway for surrender.\n\nHidma did not respond. A local journalist who had been in contact with him revealed that Hidma had begun expressing a change of heart, reportedly saying, \"**If the top leadership agrees, if my group gives consent, I will also surrender. I have understood that we cannot force our ideology on people at gunpoint.**\"\n\nSimultaneously, another intelligence stream suggested his own comrades in Telangana were blocking his entry, leaving him isolated and exposed. The fear of being cornered was palpable. On November 16, intelligence confirmed that after the Sukma encounter, Hidma had fled towards Andhra Pradesh.\n\nThis time, the intelligence was different. It was precise and actionable, coming from local sources who were now cooperating with the security forces, not Hidma. The tide had definitively turned.\n\n### The Last Stand in the Mudreli Forests\n\nActing on this golden tip, security forces launched a secret, hot-operation. Abandoning the massive battalion deployments of the past that would alert any remaining sympathizers, they relied on a highly mobile strike unit. For **34 hours**, they continuously tracked Hidma’s movements in the Andhra Pradesh belt.\n\nFinally, at 2:00 AM, a precise operation began in the dense Mudreli forests. Multiple security cordons were positioned to block all possible escape routes. A small, highly mobile unit of Andhra Pradesh's Grey Horn Commandos moved in for the strike.\n\nThe encounter lasted four hours. As the smoke cleared around 6:00-7:00 AM, it was over. India's most wanted Maoist, **Madvi Hidma, lay dead on the ground.** His wife, Razakka, and four of his associates were also killed in the final firefight.\n\nThe recovery from the site was telling of his operational life: two AK-47 rifles, a pistol, a revolver, a short gun, wires, detonators, a camera, a flashlight, and crucially, **a diary**. This diary provided further intelligence that led to more arrests.\n\nThe operation was completed on November 18, 2025—a full 12 days before the deadline set by Union Home Minister Amit Shah, who had explicitly directed security officials to eliminate Hidma by November 30.\n\n### The Aftermath and a Violent Legacy\n\nHidma's death triggered a wave of surrenders. At the time of this reporting, 15 Maoists, most from his own Battalion No. 1 and some with bounties of up to ₹48 lakh on their heads, had laid down their arms. His successor as commander, Barsa Deva—a longtime associate—was now the primary target.\n\nThe final tally of Madvi Hidma's brutal career is staggering:\n*   **260+ security personnel martyred.**\n*   **81 civilians killed.**\n*   **26+ major attacks carried out.**\n\nHis reign of terror, built on a deep knowledge of the jungle, ruthless tactics, and a network of local support, was finally over. His end was not the result of one lucky shot, but a sustained, strategic campaign that adapted, isolated, and relentlessly pursued the \"Ghost of Bastar\" until he had nowhere left to run. The hunt for India's most dangerous Naxalite demonstrated that even the most elusive insurgency can be countered with patience, intelligence, and an unwavering commitment to reclaim the land, inch by bloody inch."
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-11-29T06:04:30.566547+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-11-29T06:07:28.972931+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-11-29T06:12:09.154143+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}