{
  "id": "1f306431-253d-4025-99db-318b564a39e5",
  "external_id": "9sp4pP6bB08",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-10-16T17:18:20+00:00",
  "created_at": "2025-10-17T05:49:52.331419+00:00",
  "updated_at": "2025-10-17T05:57:19.018361+00:00",
  "reading_time_seconds": 987,
  "category": {
    "category": "SCIENCE",
    "shelf_life": "PERMANENT",
    "geography": null
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "The Science and Legal Mystery of Sleepwalking Crimes"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "This video explores the phenomenon of sleepwalking, or somnambulism, through the case of Kenneth Parks, who in 1987 drove to his in-laws' house and committed violent acts while allegedly asleep. It explains the neurological basis of sleepwalking, which occurs during deep non-REM sleep when parts of the brain are awake but consciousness is not. The video discusses how sleepwalking can lead to complex behaviors, from painting to driving, and examines the legal challenges of using sleepwalking as a defense in court, citing landmark cases. It also covers risk factors, safety measures, and debunks myths, emphasizing that sleepwalking is a biological, not supernatural, occurrence."
    },
    "MEDIUM": {
      "markdown_string": "# The Science and Legal Mystery of Sleepwalking Crimes\n\n## A Midnight Murder in Canada\n\nOn May 24, 1987, in Canada, 23-year-old Kenneth Parks was asleep on his sofa. He had lost all his money in horse racing, was deeply in debt, and had recently lost his job. He had fallen asleep after watching *Saturday Night Live* on television. His plan for the next morning was to visit his in-laws to ask for financial help. But before morning arrived, around 1:30 AM, he suddenly got up from his sofa and got into his car.\n\nIn the middle of the night, he drove approximately 22 kilometers on the highway to his in-laws' house. He had a key to their home, which he used to unlock the gate and enter directly inside.\n\nThere, he killed his mother-in-law and severely injured his father-in-law. Then, covered in blood and in a confused state, he drove to the police station and directly told the officers, \"I think I have killed two people.\" His hands had deep wounds, but he felt no pain. On the way to the hospital in an ambulance, he even revealed where he had left the murder weapon—a knife.\n\nThe strangest thing about this story was that Kenneth Parks had no apparent motive to kill his in-laws.\n\nDuring the trial, his lawyers presented an argument that left everyone shocked. They claimed that Kenneth Parks had committed this crime while asleep. He was not conscious. Therefore, he should not receive any punishment because Kenneth Parks was sleepwalking.\n\nWas Kenneth Parks really sleepwalking? Is it even possible for someone to do such things while asleep? If someone commits an act like this while sleepwalking, are they held responsible for it? And the biggest question of all: how do some people behave this way in their sleep? What is the science behind it? Let's understand the mystery of sleepwalking.\n\n## What is Sleepwalking?\n\nSleepwalking, known in medical terms as somnambulism, is a type of sleep disorder that occurs during non-REM sleep.\n\nHumans' sleep is broadly divided into two parts:\n- **Rapid Eye Movement (REM) Sleep**\n- **Non-Rapid Eye Movement (NREM) Sleep**\n\nAs the names suggest, during REM sleep, our eyes move rapidly beneath closed eyelids, while this does not happen in NREM sleep.\n\nWhen we go to sleep at night, we first enter NREM sleep. NREM sleep itself has three distinct stages:\n1. **Stage N1**: Light sleep begins, and the ability to react to sounds or external activities decreases.\n2. **Stage N2**: Sleep gradually deepens.\n3. **Stage N3**: The deepest stage of sleep. Waking someone from this stage is quite difficult, and if awakened, the person feels confused and disoriented.\n\nAfter these three NREM stages, a person enters REM sleep. Dreams occur during this stage. Here, our heart rate increases, and the brain becomes relatively more active. The brain works to consolidate memories and process emotions, which is why we dream.\n\nHowever, sleepwalking does not occur during the REM stage. Sleepwalking happens during the deepest sleep—**Stage N3 of NREM sleep**.\n\nA person who starts walking in their sleep may have their eyes open and might react to events around them. Observing this, some people might think the person is awake and conscious. But in reality, all their sensory perceptions are almost shut down. Their eyes may be open, but they cannot see, smell, or hear properly. Due to habit and by bumping into things lightly, they might avoid objects in their path, but in reality, they are not thinking or understanding anything.\n\nTypically, sleepwalkers' eyes are turned upward and inward, and they have a blank expression on their faces. Most importantly, events that occur during a sleepwalking episode are not remembered after waking up. If a person is awakened during sleepwalking, they remain confused and disoriented for some time—the same thing that happens when you wake someone from Stage N3 NREM sleep.\n\n## The Human Sleep Cycle\n\nHumans sleep in sleep cycles. In one sleep cycle, these four sleep stages occur one after another: N1, N2, N3, REM sleep, and then N1 again. One sleep cycle lasts between 90 to 110 minutes.\n\nWhen you go to sleep, in the first half of the night, the N3 portion is relatively larger within a sleep cycle. As morning approaches, the REM sleep portion of the cycle increases. Waking up is most comfortable when you arise during the N1 stage. If you wake up during N1, you feel quite fresh and energetic. But if you wake up during N3, you feel very sleepy and drowsy.\n\nThis is why you often see advice on social media: if you sleep at night, either sleep for 7.5 hours or 9 hours, because these times likely correspond to the end of a sleep cycle (assuming a 90-minute cycle). However, in reality, this varies from person to person. You need to observe how many hours of sleep leave you feeling fresh to estimate whether you're waking up in N1 sleep or another sleep stage.\n\n## The Spectrum of Sleepwalking Behaviors\n\nSleepwalking episodes can last from a few minutes to several hours. The frequency also varies—some people experience an episode once a month, while others have several episodes per week.\n\nThe most astonishing thing is what some people can do while sleepwalking. Consider the example of British-Australian artist Lee Hadwin. This gentleman can paint while sleepwalking. This is not a joke—it's a true story. When he was 15 years old, while sleepwalking, he created three paintings of famous Hollywood actresses. The strangest part is that he cannot paint while conscious—only in his sleep.\n\nAs one expert expressed: \"He is expressing this by creating artwork. It's just a really nice manifestation of what the emotional system is doing when it's not inhibited by the frontal areas.\"\n\nSimilarly, in Scotland, a case was observed of Robert Wood, who would get up at night and start cooking. While asleep, he prepares dishes ranging from omelets to pasta, earning him the nickname \"The Sleepwalking Chef.\"\n\nLooking at famous Indian examples, cricketer Sachin Tendulkar also had a habit of sleepwalking early in his career. Sourav Ganguly mentioned in an interview that in 1990, when they were roommates in England, Sachin would get up at 1:30 AM, wander aimlessly around the room, and then sit on a chair.\n\nGanguly recalled: \"We were roommates in England. So one night I saw this guy walking in the room. He would wander around and around and then sit on a chair. When Ganguly asked Sachin why he did this, he replied that he had a habit of walking in his sleep.\"\n\n\"So I told him the next day, 'Man, you're scaring me. What are you doing at night?' 'Yeah, no, no, I walk in my sleep.' So, he had this habit of walking in his sleep at night.\"\n\nUnfortunately, not everyone engages in such creative or harmless activities during sleepwalking. Sometimes people become violent and commit crimes, as in the case of Kenneth Parks in Canada. We'll discuss this further in the video, but first, let's understand why sleepwalking occurs.\n\n## Why Does Sleepwalking Happen? The Science Behind It\n\nIn India, many rumors are spread about sleepwalking. Some associate it with ghosts and spirits, while others say it's related to past life memories. But the reality is that it has no connection with ghosts, past lives, or spirits. Sleepwalking is a purely neurological phenomenon.\n\nIt occurs due to the brain's incomplete awakening—meaning part of the human brain remains asleep while another part wakes up.\n\nWhy does this happen? The exact reasoning isn't entirely clear, but according to the latest scientific research, when the body is preparing to enter deep sleep (Stage N3), something goes wrong with this transition. The processes of deep sleep and waking overlap.\n\nWhen someone sleepwalks, the part of their brain controlling movement wakes up, but the part responsible for consciousness remains asleep. This is why motor activities are possible during sleepwalking. People can walk, sit, stand, and some can even drive cars, cook food, and paint.\n\nThis is possible because even without the involvement of higher neural structures, parts like the brainstem and cerebellum can control complex emotional and motor behaviors.\n\nYou might have learned about the autonomic nervous system in school. Without our conscious will, without our desire, it keeps us breathing and controls physiological functions like heart rate and digestion. Our body doesn't need to think to perform these tasks.\n\nThis autonomic nervous system has two branches:\n- **Sympathetic Branch**: Handles fight-or-flight responses—controls responses during dangerous situations.\n- **Parasympathetic Branch**: Controls rest-and-digest responses.\n\nIn 2021, an interesting discovery was made regarding this autonomic nervous system in sleepwalkers. This research found that during N3 sleep, sleepwalkers have decreased activity in the sympathetic branch and elevated activity in the parasympathetic branch. This means rest-and-digest responses become more activated, and fight-or-flight responses decrease significantly.\n\nThis was a surprising discovery because until then, it was believed that sleepwalkers would have decreased rest-and-digest responses and increased fight-or-flight responses during deep sleep, and that's why they would sleepwalk. But the latest research revealed the exact opposite.\n\nAccording to some recent studies, in older adults, sleepwalking could be a sign of neurodegenerative diseases like dementia or Parkinson's disease, or cognitive decline.\n\nHere's another common myth: people who sleepwalk walk with their arms outstretched like zombies. But in reality, this isn't true.\n\nAdditionally, another misconception people have is that if sleepwalkers are awakened from sleep, they could have a heart attack or go into a coma. This is also not true, but as mentioned earlier, it's better not to wake them because they will feel confused and very disoriented.\n\n## How Common is Sleepwalking?\n\nAccording to this meta-analysis, 6.9% of people will sleepwalk at least once in their lifetime. Sleepwalking is most common in children. Sleepwalking episodes are most frequently observed in males aged 7 to 15 years. Fortunately, in most cases, these episodes stop as they grow older.\n\nWhen children sleepwalk, they generally appear more quiet or sluggish. But in adults, sleepwalkers make quick movements—as if they're in a hurry. They start walking quickly or sit down somewhere. Sometimes very strange movements are observed that might seem scary to some people.\n\nExactly why we see such differences between children and adults is still unknown. Scientists are still trying to find the reason.\n\n## The Role of Genetics\n\nGenetics plays a very significant role in whether you will sleepwalk or not. According to a study published in *JAMA Pediatrics*:\n- Children with one parent who has a history of sleepwalking have a 47.4% chance of sleepwalking.\n- If both parents have a history of sleepwalking, the chances increase to 61.5%.\n- Children whose parents have no history of sleepwalking have only a 22.5% chance of sleepwalking.\n\nResearchers have identified a genetic locus on chromosome 20q12–13.12 that may play a role in inheriting sleepwalking disorder from parents to children.\n\n## Triggers for Sleepwalking Episodes\n\nBesides genetics, several other factors can trigger sleepwalking episodes in susceptible people:\n\n1. **Sleep Deprivation**: The body needs sufficient slow-wave sleep to wake up properly. When sleep isn't completed adequately, the chances of partial awakening and sleepwalking increase. The brain remains stuck in deep sleep for longer to complete its sleep, and smooth transition to the next stage doesn't occur.\n\n2. **Stress**: Stress can also cause sleepwalking episodes.\n\n3. **Obstructive Sleep Apnea**: This is another important factor. It's a breathing disorder where breathing can stop for short periods during sleep. If someone has severe obstructive sleep apnea, their chances of sleepwalking increase further.\n\n4. **Medications**: Sedatives, antidepressants, and antipsychotics—often given to treat heart diseases and anxiety—also increase the risk of sleepwalking.\n\nOn the other hand, in children, common triggers can be fever or illness. More cases of sleepwalking are observed in children suffering from asthma. Due to asthma, sleep isn't completed, which triggers sleepwalking in children.\n\n## The Legal Conundrum: Criminal Responsibility\n\nNow, back to the first story of our video: if a person commits a crime while sleepwalking, will they be considered guilty? This entire issue is a huge legal mind field.\n\nIn criminal law, two things are important:\n1. The crime that was committed\n2. Intent (guilty mind)\n\nTo be convicted for a crime, it's not only necessary for a person to have committed the crime, but the intent must also be proven—why did that person want to do this? What was the reason behind committing this crime?\n\nIn the case of sleepwalkers, the body is committing the crime, but their brain isn't involved. Meaning the crime has occurred, but there's no intent.\n\nIn Kenneth Parks' case, his lawyers presented this same argument in court: Kenneth cannot be held responsible for the crime because he didn't do it willingly. His body committed the crime, but his mind is not guilty.\n\nMedical experts also testified that Kenneth was sleepwalking at the time of the crime, and because of this, the jury acquitted Parks. He was not found guilty. This case became a landmark case worldwide for the sleepwalking defense.\n\nHowever, it's also important to mention here that the sleepwalking defense is not always successful. Otherwise, anyone could show a history of sleepwalking, commit a crime, and get away with it anytime.\n\nIn such cases, everything depends on how much the judge and jury believe the sleepwalker's stories. Usually, courts remain quite skeptical about the sleepwalking defense because they know many criminals will try to use this excuse to save themselves.\n\nOne judge once even called it a \"quagmire of law.\" For this reason, the sleepwalking defense has been highly controversial in courts.\n\n## Case Study: Scott Falater\n\nIn 1997, in the USA, a man named Scott Falater killed his wife at home. In his defense, he said he was sleepwalking.\n\nThe defense tried to say this was manslaughter. Two experts also testified that Scott was sleepwalking. But after hearing all the arguments in court, the jury didn't believe his story.\n\nThe murder weapon was a hunting-style knife, found in his car's spare tire storage area. This suggested he had tried to hide his murder weapon. After this incident, Scott had taken off his clothes, put them in a plastic bag, hidden them, and even put on pajamas.\n\nHis neighbor Greg also told the court that he had worn gloves before drowning his wife in the pool.\n\nAdditionally, throughout this story, it was observed that for a sleepwalker, doing so much in just one episode is very unusual. His actions were quite lengthy and purposeful.\n\nBecause of this, the jury didn't believe he was sleepwalking, and he was sentenced to life imprisonment.\n\n## The Indian Legal Precedent: Papathi Ammal Case\n\nThe oldest and most important case regarding sleepwalking in India's legal history is Papathi Ammal. She was a young mother who had given birth to a child just a few days earlier. But on the night of October 28, 1957, she jumped into a well with her child. She was saved, but her child drowned.\n\nThe police charged Papathi with murder, but her lawyers said she had a habit of sleepwalking and had jumped into the well with the child in her sleep. Since she didn't know what she was doing, she shouldn't be punished.\n\nBut when this argument was presented before the Sessions Court, the court rejected it and sentenced Papathi to life imprisonment. The court said that sleepwalking is not considered unsoundness of mind under Section 84 of the Indian Penal Code.\n\nIn response, Papathi's lawyers appealed in the Madras High Court, which did not overturn her conviction because there was no expert examination in this case, but a revolutionary decision did emerge.\n\nThe Madras High Court said that if it is proven that a person was truly sleepwalking, then it will be considered unsoundness of mind under Section 84. This became a landmark case in India's legal history because after this, it was established that sleepwalking could be a valid legal defense.\n\nBut here too, the same point applies: everything depends on how much the judge believes your story.\n\n## Risks to the Sleepwalker Themselves\n\nHurting others is one thing, but besides that, sleepwalkers can also injure themselves. While sleepwalking, people often bump into walls. They can sustain serious injuries by colliding with furniture or large objects. The biggest danger is falling from stairs or balconies, especially if safety grills aren't installed.\n\nIn June 2024, such a case occurred in Mumbai. A 19-year-old boy, Mustafa Ibrahim Chunawala, living on the sixth floor of a high-rise building, reached the balcony while sleepwalking. This balcony had no safety grill, and he fell to his death.\n\nThe next biggest danger is when people go outside into traffic or start driving during sleepwalking. Things become even more dangerous for women. If you know someone who often goes outside the house at night while sleepwalking, this should not be taken lightly at all.\n\n## Safety Measures for Sleepwalkers\n\nSecuring the environment is the most important thing:\n- There should be no sharp or dangerous objects easily reachable.\n- Safety gates should be installed on stairs.\n- Balconies should have safety grills.\n- Windows and doors should not only be locked but also have child-proof latches installed to make them harder to open.\n\nThe best thing is for people who sleepwalk to try to sleep on the ground floor. Use door alarms or motion sensors for alerts, and keep medicines and other dangerous items locked in a safe place.\n\n## Statistics and Prevalence\n\nLooking at the data here, worldwide, about 7% of people experience sleepwalking at least once in their lifetime. In adults, sleepwalking is common in about 3-4% of people—meaning they do it regularly. In children, this number is higher—going up to 15%. That means 15% of children worldwide sleepwalk at least once during their childhood.\n\nThe good news here is that occasional sleepwalking isn't such a big problem, and this problem usually goes away as most children grow up.\n\n## Advice for Parents\n\nIf you're a parent and have ever seen your child sleepwalking, the first task here is also to secure the environment:\n- Ensure there are no sharp objects in the bedroom where the child sleeps.\n- There should be nothing on the floor that they could trip over.\n- Always lock doors and windows.\n- If children are small, you can also buy guard rails for the sides of the bed. This is a very simple safety net that can be installed on three sides of the bed under the mattress. You can find this online in many places.\n\nSecond, if you see your child sleepwalking at night, there's no need to wake them. Gently lead them back to bed and lay them down. If necessary, speak to them in a very calm, quiet voice to help them go back to sleep. But the effort should be to avoid waking them.\n\nThird, if you notice that your child sleepwalks every night at a certain time, then gently wake the child about 15 minutes before this time. Doing this a few times can break this cycle.\n\n## Advice for Adults\n\nIf you're an adult who suffers from sleepwalking, focus on the risk factors that trigger sleepwalking. You'll need to make changes in your lifestyle:\n- Improve your sleep hygiene.\n- Maintaining a consistent sleep schedule is very important.\n- Go to sleep at the same time every night.\n- Wake up at the same time every morning.\n- Try to reduce the stress you feel in your daily life. You can also take therapy for this.\n\nFinally, remember: sleepwalking is not a supernatural phenomenon. It shows a fascinating aspect of the human brain. Even if science hasn't been able to explain it completely, like other mysteries, this too is a scientific and biological phenomenon.",
      "string": "# The Science and Legal Mystery of Sleepwalking Crimes\n\n## A Midnight Murder in Canada\n\nOn May 24, 1987, in Canada, 23-year-old Kenneth Parks was asleep on his sofa. He had lost all his money in horse racing, was deeply in debt, and had recently lost his job. He had fallen asleep after watching *Saturday Night Live* on television. His plan for the next morning was to visit his in-laws to ask for financial help. But before morning arrived, around 1:30 AM, he suddenly got up from his sofa and got into his car.\n\nIn the middle of the night, he drove approximately 22 kilometers on the highway to his in-laws' house. He had a key to their home, which he used to unlock the gate and enter directly inside.\n\nThere, he killed his mother-in-law and severely injured his father-in-law. Then, covered in blood and in a confused state, he drove to the police station and directly told the officers, \"I think I have killed two people.\" His hands had deep wounds, but he felt no pain. On the way to the hospital in an ambulance, he even revealed where he had left the murder weapon—a knife.\n\nThe strangest thing about this story was that Kenneth Parks had no apparent motive to kill his in-laws.\n\nDuring the trial, his lawyers presented an argument that left everyone shocked. They claimed that Kenneth Parks had committed this crime while asleep. He was not conscious. Therefore, he should not receive any punishment because Kenneth Parks was sleepwalking.\n\nWas Kenneth Parks really sleepwalking? Is it even possible for someone to do such things while asleep? If someone commits an act like this while sleepwalking, are they held responsible for it? And the biggest question of all: how do some people behave this way in their sleep? What is the science behind it? Let's understand the mystery of sleepwalking.\n\n## What is Sleepwalking?\n\nSleepwalking, known in medical terms as somnambulism, is a type of sleep disorder that occurs during non-REM sleep.\n\nHumans' sleep is broadly divided into two parts:\n- **Rapid Eye Movement (REM) Sleep**\n- **Non-Rapid Eye Movement (NREM) Sleep**\n\nAs the names suggest, during REM sleep, our eyes move rapidly beneath closed eyelids, while this does not happen in NREM sleep.\n\nWhen we go to sleep at night, we first enter NREM sleep. NREM sleep itself has three distinct stages:\n1. **Stage N1**: Light sleep begins, and the ability to react to sounds or external activities decreases.\n2. **Stage N2**: Sleep gradually deepens.\n3. **Stage N3**: The deepest stage of sleep. Waking someone from this stage is quite difficult, and if awakened, the person feels confused and disoriented.\n\nAfter these three NREM stages, a person enters REM sleep. Dreams occur during this stage. Here, our heart rate increases, and the brain becomes relatively more active. The brain works to consolidate memories and process emotions, which is why we dream.\n\nHowever, sleepwalking does not occur during the REM stage. Sleepwalking happens during the deepest sleep—**Stage N3 of NREM sleep**.\n\nA person who starts walking in their sleep may have their eyes open and might react to events around them. Observing this, some people might think the person is awake and conscious. But in reality, all their sensory perceptions are almost shut down. Their eyes may be open, but they cannot see, smell, or hear properly. Due to habit and by bumping into things lightly, they might avoid objects in their path, but in reality, they are not thinking or understanding anything.\n\nTypically, sleepwalkers' eyes are turned upward and inward, and they have a blank expression on their faces. Most importantly, events that occur during a sleepwalking episode are not remembered after waking up. If a person is awakened during sleepwalking, they remain confused and disoriented for some time—the same thing that happens when you wake someone from Stage N3 NREM sleep.\n\n## The Human Sleep Cycle\n\nHumans sleep in sleep cycles. In one sleep cycle, these four sleep stages occur one after another: N1, N2, N3, REM sleep, and then N1 again. One sleep cycle lasts between 90 to 110 minutes.\n\nWhen you go to sleep, in the first half of the night, the N3 portion is relatively larger within a sleep cycle. As morning approaches, the REM sleep portion of the cycle increases. Waking up is most comfortable when you arise during the N1 stage. If you wake up during N1, you feel quite fresh and energetic. But if you wake up during N3, you feel very sleepy and drowsy.\n\nThis is why you often see advice on social media: if you sleep at night, either sleep for 7.5 hours or 9 hours, because these times likely correspond to the end of a sleep cycle (assuming a 90-minute cycle). However, in reality, this varies from person to person. You need to observe how many hours of sleep leave you feeling fresh to estimate whether you're waking up in N1 sleep or another sleep stage.\n\n## The Spectrum of Sleepwalking Behaviors\n\nSleepwalking episodes can last from a few minutes to several hours. The frequency also varies—some people experience an episode once a month, while others have several episodes per week.\n\nThe most astonishing thing is what some people can do while sleepwalking. Consider the example of British-Australian artist Lee Hadwin. This gentleman can paint while sleepwalking. This is not a joke—it's a true story. When he was 15 years old, while sleepwalking, he created three paintings of famous Hollywood actresses. The strangest part is that he cannot paint while conscious—only in his sleep.\n\nAs one expert expressed: \"He is expressing this by creating artwork. It's just a really nice manifestation of what the emotional system is doing when it's not inhibited by the frontal areas.\"\n\nSimilarly, in Scotland, a case was observed of Robert Wood, who would get up at night and start cooking. While asleep, he prepares dishes ranging from omelets to pasta, earning him the nickname \"The Sleepwalking Chef.\"\n\nLooking at famous Indian examples, cricketer Sachin Tendulkar also had a habit of sleepwalking early in his career. Sourav Ganguly mentioned in an interview that in 1990, when they were roommates in England, Sachin would get up at 1:30 AM, wander aimlessly around the room, and then sit on a chair.\n\nGanguly recalled: \"We were roommates in England. So one night I saw this guy walking in the room. He would wander around and around and then sit on a chair. When Ganguly asked Sachin why he did this, he replied that he had a habit of walking in his sleep.\"\n\n\"So I told him the next day, 'Man, you're scaring me. What are you doing at night?' 'Yeah, no, no, I walk in my sleep.' So, he had this habit of walking in his sleep at night.\"\n\nUnfortunately, not everyone engages in such creative or harmless activities during sleepwalking. Sometimes people become violent and commit crimes, as in the case of Kenneth Parks in Canada. We'll discuss this further in the video, but first, let's understand why sleepwalking occurs.\n\n## Why Does Sleepwalking Happen? The Science Behind It\n\nIn India, many rumors are spread about sleepwalking. Some associate it with ghosts and spirits, while others say it's related to past life memories. But the reality is that it has no connection with ghosts, past lives, or spirits. Sleepwalking is a purely neurological phenomenon.\n\nIt occurs due to the brain's incomplete awakening—meaning part of the human brain remains asleep while another part wakes up.\n\nWhy does this happen? The exact reasoning isn't entirely clear, but according to the latest scientific research, when the body is preparing to enter deep sleep (Stage N3), something goes wrong with this transition. The processes of deep sleep and waking overlap.\n\nWhen someone sleepwalks, the part of their brain controlling movement wakes up, but the part responsible for consciousness remains asleep. This is why motor activities are possible during sleepwalking. People can walk, sit, stand, and some can even drive cars, cook food, and paint.\n\nThis is possible because even without the involvement of higher neural structures, parts like the brainstem and cerebellum can control complex emotional and motor behaviors.\n\nYou might have learned about the autonomic nervous system in school. Without our conscious will, without our desire, it keeps us breathing and controls physiological functions like heart rate and digestion. Our body doesn't need to think to perform these tasks.\n\nThis autonomic nervous system has two branches:\n- **Sympathetic Branch**: Handles fight-or-flight responses—controls responses during dangerous situations.\n- **Parasympathetic Branch**: Controls rest-and-digest responses.\n\nIn 2021, an interesting discovery was made regarding this autonomic nervous system in sleepwalkers. This research found that during N3 sleep, sleepwalkers have decreased activity in the sympathetic branch and elevated activity in the parasympathetic branch. This means rest-and-digest responses become more activated, and fight-or-flight responses decrease significantly.\n\nThis was a surprising discovery because until then, it was believed that sleepwalkers would have decreased rest-and-digest responses and increased fight-or-flight responses during deep sleep, and that's why they would sleepwalk. But the latest research revealed the exact opposite.\n\nAccording to some recent studies, in older adults, sleepwalking could be a sign of neurodegenerative diseases like dementia or Parkinson's disease, or cognitive decline.\n\nHere's another common myth: people who sleepwalk walk with their arms outstretched like zombies. But in reality, this isn't true.\n\nAdditionally, another misconception people have is that if sleepwalkers are awakened from sleep, they could have a heart attack or go into a coma. This is also not true, but as mentioned earlier, it's better not to wake them because they will feel confused and very disoriented.\n\n## How Common is Sleepwalking?\n\nAccording to this meta-analysis, 6.9% of people will sleepwalk at least once in their lifetime. Sleepwalking is most common in children. Sleepwalking episodes are most frequently observed in males aged 7 to 15 years. Fortunately, in most cases, these episodes stop as they grow older.\n\nWhen children sleepwalk, they generally appear more quiet or sluggish. But in adults, sleepwalkers make quick movements—as if they're in a hurry. They start walking quickly or sit down somewhere. Sometimes very strange movements are observed that might seem scary to some people.\n\nExactly why we see such differences between children and adults is still unknown. Scientists are still trying to find the reason.\n\n## The Role of Genetics\n\nGenetics plays a very significant role in whether you will sleepwalk or not. According to a study published in *JAMA Pediatrics*:\n- Children with one parent who has a history of sleepwalking have a 47.4% chance of sleepwalking.\n- If both parents have a history of sleepwalking, the chances increase to 61.5%.\n- Children whose parents have no history of sleepwalking have only a 22.5% chance of sleepwalking.\n\nResearchers have identified a genetic locus on chromosome 20q12–13.12 that may play a role in inheriting sleepwalking disorder from parents to children.\n\n## Triggers for Sleepwalking Episodes\n\nBesides genetics, several other factors can trigger sleepwalking episodes in susceptible people:\n\n1. **Sleep Deprivation**: The body needs sufficient slow-wave sleep to wake up properly. When sleep isn't completed adequately, the chances of partial awakening and sleepwalking increase. The brain remains stuck in deep sleep for longer to complete its sleep, and smooth transition to the next stage doesn't occur.\n\n2. **Stress**: Stress can also cause sleepwalking episodes.\n\n3. **Obstructive Sleep Apnea**: This is another important factor. It's a breathing disorder where breathing can stop for short periods during sleep. If someone has severe obstructive sleep apnea, their chances of sleepwalking increase further.\n\n4. **Medications**: Sedatives, antidepressants, and antipsychotics—often given to treat heart diseases and anxiety—also increase the risk of sleepwalking.\n\nOn the other hand, in children, common triggers can be fever or illness. More cases of sleepwalking are observed in children suffering from asthma. Due to asthma, sleep isn't completed, which triggers sleepwalking in children.\n\n## The Legal Conundrum: Criminal Responsibility\n\nNow, back to the first story of our video: if a person commits a crime while sleepwalking, will they be considered guilty? This entire issue is a huge legal mind field.\n\nIn criminal law, two things are important:\n1. The crime that was committed\n2. Intent (guilty mind)\n\nTo be convicted for a crime, it's not only necessary for a person to have committed the crime, but the intent must also be proven—why did that person want to do this? What was the reason behind committing this crime?\n\nIn the case of sleepwalkers, the body is committing the crime, but their brain isn't involved. Meaning the crime has occurred, but there's no intent.\n\nIn Kenneth Parks' case, his lawyers presented this same argument in court: Kenneth cannot be held responsible for the crime because he didn't do it willingly. His body committed the crime, but his mind is not guilty.\n\nMedical experts also testified that Kenneth was sleepwalking at the time of the crime, and because of this, the jury acquitted Parks. He was not found guilty. This case became a landmark case worldwide for the sleepwalking defense.\n\nHowever, it's also important to mention here that the sleepwalking defense is not always successful. Otherwise, anyone could show a history of sleepwalking, commit a crime, and get away with it anytime.\n\nIn such cases, everything depends on how much the judge and jury believe the sleepwalker's stories. Usually, courts remain quite skeptical about the sleepwalking defense because they know many criminals will try to use this excuse to save themselves.\n\nOne judge once even called it a \"quagmire of law.\" For this reason, the sleepwalking defense has been highly controversial in courts.\n\n## Case Study: Scott Falater\n\nIn 1997, in the USA, a man named Scott Falater killed his wife at home. In his defense, he said he was sleepwalking.\n\nThe defense tried to say this was manslaughter. Two experts also testified that Scott was sleepwalking. But after hearing all the arguments in court, the jury didn't believe his story.\n\nThe murder weapon was a hunting-style knife, found in his car's spare tire storage area. This suggested he had tried to hide his murder weapon. After this incident, Scott had taken off his clothes, put them in a plastic bag, hidden them, and even put on pajamas.\n\nHis neighbor Greg also told the court that he had worn gloves before drowning his wife in the pool.\n\nAdditionally, throughout this story, it was observed that for a sleepwalker, doing so much in just one episode is very unusual. His actions were quite lengthy and purposeful.\n\nBecause of this, the jury didn't believe he was sleepwalking, and he was sentenced to life imprisonment.\n\n## The Indian Legal Precedent: Papathi Ammal Case\n\nThe oldest and most important case regarding sleepwalking in India's legal history is Papathi Ammal. She was a young mother who had given birth to a child just a few days earlier. But on the night of October 28, 1957, she jumped into a well with her child. She was saved, but her child drowned.\n\nThe police charged Papathi with murder, but her lawyers said she had a habit of sleepwalking and had jumped into the well with the child in her sleep. Since she didn't know what she was doing, she shouldn't be punished.\n\nBut when this argument was presented before the Sessions Court, the court rejected it and sentenced Papathi to life imprisonment. The court said that sleepwalking is not considered unsoundness of mind under Section 84 of the Indian Penal Code.\n\nIn response, Papathi's lawyers appealed in the Madras High Court, which did not overturn her conviction because there was no expert examination in this case, but a revolutionary decision did emerge.\n\nThe Madras High Court said that if it is proven that a person was truly sleepwalking, then it will be considered unsoundness of mind under Section 84. This became a landmark case in India's legal history because after this, it was established that sleepwalking could be a valid legal defense.\n\nBut here too, the same point applies: everything depends on how much the judge believes your story.\n\n## Risks to the Sleepwalker Themselves\n\nHurting others is one thing, but besides that, sleepwalkers can also injure themselves. While sleepwalking, people often bump into walls. They can sustain serious injuries by colliding with furniture or large objects. The biggest danger is falling from stairs or balconies, especially if safety grills aren't installed.\n\nIn June 2024, such a case occurred in Mumbai. A 19-year-old boy, Mustafa Ibrahim Chunawala, living on the sixth floor of a high-rise building, reached the balcony while sleepwalking. This balcony had no safety grill, and he fell to his death.\n\nThe next biggest danger is when people go outside into traffic or start driving during sleepwalking. Things become even more dangerous for women. If you know someone who often goes outside the house at night while sleepwalking, this should not be taken lightly at all.\n\n## Safety Measures for Sleepwalkers\n\nSecuring the environment is the most important thing:\n- There should be no sharp or dangerous objects easily reachable.\n- Safety gates should be installed on stairs.\n- Balconies should have safety grills.\n- Windows and doors should not only be locked but also have child-proof latches installed to make them harder to open.\n\nThe best thing is for people who sleepwalk to try to sleep on the ground floor. Use door alarms or motion sensors for alerts, and keep medicines and other dangerous items locked in a safe place.\n\n## Statistics and Prevalence\n\nLooking at the data here, worldwide, about 7% of people experience sleepwalking at least once in their lifetime. In adults, sleepwalking is common in about 3-4% of people—meaning they do it regularly. In children, this number is higher—going up to 15%. That means 15% of children worldwide sleepwalk at least once during their childhood.\n\nThe good news here is that occasional sleepwalking isn't such a big problem, and this problem usually goes away as most children grow up.\n\n## Advice for Parents\n\nIf you're a parent and have ever seen your child sleepwalking, the first task here is also to secure the environment:\n- Ensure there are no sharp objects in the bedroom where the child sleeps.\n- There should be nothing on the floor that they could trip over.\n- Always lock doors and windows.\n- If children are small, you can also buy guard rails for the sides of the bed. This is a very simple safety net that can be installed on three sides of the bed under the mattress. You can find this online in many places.\n\nSecond, if you see your child sleepwalking at night, there's no need to wake them. Gently lead them back to bed and lay them down. If necessary, speak to them in a very calm, quiet voice to help them go back to sleep. But the effort should be to avoid waking them.\n\nThird, if you notice that your child sleepwalks every night at a certain time, then gently wake the child about 15 minutes before this time. Doing this a few times can break this cycle.\n\n## Advice for Adults\n\nIf you're an adult who suffers from sleepwalking, focus on the risk factors that trigger sleepwalking. You'll need to make changes in your lifestyle:\n- Improve your sleep hygiene.\n- Maintaining a consistent sleep schedule is very important.\n- Go to sleep at the same time every night.\n- Wake up at the same time every morning.\n- Try to reduce the stress you feel in your daily life. You can also take therapy for this.\n\nFinally, remember: sleepwalking is not a supernatural phenomenon. It shows a fascinating aspect of the human brain. Even if science hasn't been able to explain it completely, like other mysteries, this too is a scientific and biological phenomenon."
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-10-17T05:49:52.331410+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-10-17T05:51:54.422541+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-10-17T05:57:19.018357+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}