{
  "id": "578368c5-3079-4712-b302-a9eb4e11ab0f",
  "external_id": "xsjNGcevbT8",
  "content_type": "YOUTUBE_VIDEO",
  "status": "ARTICLE_GENERATED",
  "content_generated_at": "2025-10-29T13:24:15+00:00",
  "created_at": "2025-10-30T05:54:05.494617+00:00",
  "updated_at": "2025-10-30T06:21:06.101282+00:00",
  "reading_time_seconds": 731,
  "category": {
    "category": "HEALTH",
    "shelf_life": "PERMANENT",
    "geography": "IN"
  },
  "generated": {
    "VERY_SHORT": {
      "markdown_string": "",
      "string": "How 15 Lives Were Saved Through Stem Cell Donation"
    },
    "SHORT": {
      "markdown_string": "",
      "string": "Dhruv Rathee explains how 30,000 people registered as stem cell donors after his previous video, leading to 15 successful donations that saved lives. Blood cancer requires stem cell transplants, but finding a matching HLA type is extremely rare (1 in 100,000). DKMS, a nonprofit, maintains a global registry to connect donors with patients. The process involves a simple cheek swab sent to a high-tech lab in Germany for HLA typing. If a match is found, donors can donate stem cells through a painless procedure. With only 800,000 registered donors in India, more registrations are needed to save more lives, aiming for 150 saves next year."
    },
    "MEDIUM": {
      "markdown_string": "# How 15 Lives Were Saved Through Stem Cell Donation\n\nHello, friends. Today, I’ve come to the city of Tübingen in Germany. But I’m not here to sightsee—I’m here to show you how we, together, have saved the lives of 15 cancer patients. I’m not joking. You might be wondering, “When did this happen?” But in reality, you have saved lives.\n\nThis story begins about a year ago, when I made an educational video about cancer. In it, I talked about preventive steps you can take to protect yourself from cancer. But in that same video, I also said that if you could do one small thing for me, we could also save the lives of cancer patients. And you did it. Because 300 of you registered, today we have saved 15 lives. Exactly how did this happen? Behind it is a high-tech lab located right here in Tübingen.\n\nLet’s understand the science behind it in a little more detail and set a target for next year: saving 150 lives. How can you help? Let’s take a look.\n\n## The Challenge of Blood Cancer\n\nThis entire issue, friends, revolves around blood cancer. Blood cancer is a disease that claims 70,000 lives every year in India. Every year, 70,000 people lose their lives. If you get this disease and treatments like chemotherapy and radiation fail, the last remaining option to save your life is a blood stem cell transplantation. You would need to take stem cells from another person’s blood to help your body fight the cancer. This process is quite similar to a blood transfusion when you go to donate blood. But there is one very important difference.\n\nWhen you only need regular blood, there are just eight common blood types—A positive, B positive, O positive, etc. So, finding someone with the same blood type isn’t that difficult. But for stem cell transplantation, your HLA type must match. And there are more than 20,000 different HLA types. Finding a match for a blood stem cell transplant is so difficult that the probability is one in 100,000. That means it’s nearly impossible if you try to find a match on your own for a stem cell transplant.\n\nAnd that’s where DKMS comes in, friends—a non-profit organization that maintains the world’s largest stem cell registry.\n\n## A Life Saved: The Story of Sahili Rane\n\nThis story begins on January 9, 2021, when Sahili Rane, living in Mumbai, was diagnosed with blood cancer.\n\n“Around 4:30, a call came from my lab to my husband. He informed my husband, you know, that this is the case. So the first feeling that came to my heart and mind was that Sahili is leaving me.”\n\nThe doctor first suggested chemotherapy, but it didn’t work well. Then the doctor said a stem cell transplant would be necessary. But no one in Sahili’s family had a matching HLA type, so she had no one to donate stem cells.\n\n“Unfortunately, what happened is that my brother and sisters’ HLA matched, but it didn’t match with me. The financial arrangements had been made, luckily, but we couldn’t find a donor.”\n\nOn the doctor’s advice, they contacted DKMS because DKMS has more than 11 million registered stem cell donors. Because of this, after some time, they found a donor. Satish Reddy from Visakhapatnam—his HLA type matched Sahili Rane’s. Satish donated his stem cells, and today, Sahili is not only alive but living a healthy life.\n\n“You are giving a life to a person—that is the best donation. I think you can do it in your life. Nothing else will be comparable to that.”\n\n## Another Miracle: The Story of Maheer from Ahmedabad\n\nAnother amazing story is that of six-year-old Maheer from Ahmedabad. He had acute leukemia, a type of blood cancer, and his entire life depended on a stem cell donation. Maheer was such a small child that he didn’t even understand what was happening. To find a stem cell donor, his parents contacted DKMS, and through them, Maheer found Dr. Sita Arjuna in Germany. Thousands of kilometers away, they found a person whose HLA type matched his, and with this donation, Maheer recovered. Today, Maheer is an 18-year-old young man, and he says, “The only reason that I am alive right now and in front of you is the blood donation—the blood stem cell donation.”\n\n## How You Can Register—Simple and Free\n\nNow, the process of saving lives in this way is very simple, friends, as I explained in my previous video, and it’s completely free of cost for you because DKMS covers all the expenses.\n\nYou just need to go to this website and fill out an online form. I’ve put the link in the description and pinned comment. In this form, you just fill in your basic details, which will take only 5 minutes. A few days later, a swab kit will arrive at your home, with instructions on how to take a cheek swab. Take the cheek swab as instructed, pack the sample back into the same swab kit along with the signed consent form, and scan the QR code on the return envelope. The swab kit will be picked up from your place—someone will come to collect the envelope.\n\nThis sample that you submit will be used to determine your HLA type, and you will be added to the blood stem cell registry. This entire process takes about 40 days, and then you’ll receive an email from DKMS saying you’ve been added to the world stem cell donor database. After that, if your HLA type matches a blood cancer patient, you’ll receive a call from DKMS. You’ll be offered the chance to donate your stem cells.\n\n## The Science: Inside the High-Tech Lab\n\nExactly how does this process work? Let’s look at the live example later in the video. But first, let’s understand the full scientific process used to determine your HLA type. All of this happens in a large high-tech lab here in Tübingen. This is the DKMS Life Science Lab. All the swab samples sent from around the world come here to be processed.\n\nIn the previous video, when I requested your help, about 30,000 of you sent your swab samples. All those samples come to the lab here first.\n\nThe first step is quite interesting. They use a slicing machine to open your envelopes. This machine only works to open these envelopes.\n\nAs you’ll see further on, this entire process is highly automated. Machines are being used that you may never have heard of. But the second step requires manual work. This step requires the most concentration because it’s the most important step. Here, the sample is being taken out of the envelope and placed into a plate. A plate with 96 spots for samples, and it’s being registered in the computer at this same step. If you look at the computer screen, it shows exactly which spot in this plate the sample was placed in. This work is currently done by humans and requires a lot of concentration because if placed incorrectly, samples can get mixed up.\n\nThen comes the third step: DNA extraction. After that, the panel with the samples is sent into this machine, and this machine performs the DNA extraction—the work of extracting DNA from the swab sample you sent. And this DNA extraction is done using that brown liquid, which is actually magnetic beads that, like a magnet, pull out the DNA.\n\nThen, in this machine, the DNA’s quality is checked. This machine checks whether the DNA concentration in the swab sample you provided is high or low and divides the DNA samples into two. That’s why it’s important to follow the instructions properly when taking the swab sample at home. If your swab sample doesn’t have a sufficient amount of DNA, this entire process is essentially wasted.\n\nThen comes another amazing automated machine called the Hydrocyclone. There are so many automated machines here. This one’s job is to multiply the part of the DNA that is relevant for us—relevant for HLA typing—so that it’s easier to read later. This machine multiplies the DNA and that specific part at the right temperature with enzymes. The interesting thing is that this is the old version of this Hydrocyclone machine. Look at the new version—they made it smaller here, a more modern version of the same machine.\n\nThe next step is labeling the DNA. Some technologies are so amazing that they sound like science fiction. But in reality, it’s possible. This machine is an example of that. Through this machine, each DNA sample is being given a barcode. A barcode is being attached to it so that it can be identified later—which donor that DNA came from. And this barcode is being placed inside the DNA. You can’t see it from the outside. I’m not talking about this barcode; rather, this machine is putting its own barcode inside each sample, inside the liquid.\n\nThis technology is so incredible, friends, that in the future, scientists are looking at how DNA can be used for data storage. The work for which we use USB sticks, hard drives, and large data centers today—that same computer data can be stored in DNA when this DNA barcode process is used because each DNA already has its barcode attached. So we don’t need to store them in separate places. To save space, we can store them all in the same liquid. And that’s what this machine does. It took all the sample liquids and stored them all in this small bottle. In this small bottle, friends, 7,000 DNA samples can be stored, and you can see how much space is saved. All the data storage is happening here in liquid form.\n\nThis room is quite noisy, and the machines placed here are very, very expensive. Each machine costs half a million euros. But this step is very important. It’s actually the most essential step because it’s in these machines that the liquid samples are placed, and the DNA reading work is done. These machines read the DNA, determine the HLA typing, and store all that information in the computer. Here too, there are different versions of the machine. This one, for example, is the older version. This one is a more advanced version. You can tell just by its external look that it’s the new upgraded model—like a Pro Max. And all the data is extracted and finally stored in this server.\n\n## When You Get the Call\n\nNow, all this process, friends, is just for collecting blood stem cell donors and creating a registry. But when DKMS actually finds a patient whose HLA type matches yours, DKMS will call you.\n\nThe call might come in a month, a year, or it might never come because finding a match is very rare. But if you do get the call, after the call, you can decide whether you want to donate your stem cells or not. But if you choose to donate, you can save lives. In the previous video, about 30,000 of you registered. Out of those, 15 people received calls, and 15 people chose the option to donate, and that is the reason, friends, that together we have saved the lives of 15 cancer patients.\n\n## The Donation Process\n\nWhen it’s actually time for the stem cell donation, the people from DKMS will help you get to the nearest collection center. In India, they have tie-ups with hospitals in all metro cities. Delhi, Mumbai, Kolkata, Bangalore—in these places, they will take you to the nearest collection center to donate. But if you live in a remote area, like somewhere in Ladakh, they will pay for your flight, pay for your hotel stay, and you can come to their nearest collection center to donate blood.\n\nBut what happens at a collection center? To find out, we’ve come to a DKMS collection center in Essen. Let’s see how things work here.\n\nSo the machine looks very high-tech. But actually, the process is quite simple. It’s a centrifugal machine. Blood is taken from one arm. This machine separates the blood into three parts: red blood cells, which you can see here in the dark line; plasma, which is present in the white line here; and the third, most important thing—the stem cells—which are present in this yellow line and get collected into this packet.\n\nAfter separating the stem cells, the remaining blood is returned to your body through the other arm. Here you can see the machine open. Inside, it’s basically a centrifugal that spins like this, and there’s a covering here. This entire process takes only two to three hours and is not painful at all. There’s just a little pain when the needle is inserted to draw blood, which also happens in a normal blood donation. But apart from that, during the two to three hours, you can relax. Sit and watch a movie, browse the internet—just like these people are doing. And it’s that simple.\n\nAnd the stem cells taken from your body will be regenerated by your body in no time—just two to three weeks, and they’ll be back.\n\n“So did you feel any pain during the whole process?”  \n“Just first, or so right now, you don’t feel any pain.”  \n“No.”\n\n## The Urgent Need in India\n\nSo, saving someone’s life is that simple, friends. But the unfortunate thing is that in India, every year, more than 100,000 blood cancer cases are seen, and across the entire country, the total number of registered people is only 800,000. So actually, the chance of a blood cancer patient finding a match in our country is quite low because very few people have registered.\n\nTherefore, I’d say, friends, if you’re watching this video, please go and register. Last year we saved 15 lives. This year, let’s set a target of saving 150 lives. For that, 300,000 of you will need to register. So I hope that as many people as possible watching this video will register, and this work is completely free of cost, as I’ve explained. Such a small effort can save someone’s life. While doing this work, friends, just think about this: if someone in your family got blood cancer, how would you feel? Such a small effort can make such a big impact.\n\nLet’s save lives together. If you found this video informative, then please also watch this video, friends, where I’ve talked about cancer in detail—how you can protect yourself from getting cancer, what prevention steps you can take. You can watch it by clicking here. Thank you very much.",
      "string": "# How 15 Lives Were Saved Through Stem Cell Donation\n\nHello, friends. Today, I’ve come to the city of Tübingen in Germany. But I’m not here to sightsee—I’m here to show you how we, together, have saved the lives of 15 cancer patients. I’m not joking. You might be wondering, “When did this happen?” But in reality, you have saved lives.\n\nThis story begins about a year ago, when I made an educational video about cancer. In it, I talked about preventive steps you can take to protect yourself from cancer. But in that same video, I also said that if you could do one small thing for me, we could also save the lives of cancer patients. And you did it. Because 300 of you registered, today we have saved 15 lives. Exactly how did this happen? Behind it is a high-tech lab located right here in Tübingen.\n\nLet’s understand the science behind it in a little more detail and set a target for next year: saving 150 lives. How can you help? Let’s take a look.\n\n## The Challenge of Blood Cancer\n\nThis entire issue, friends, revolves around blood cancer. Blood cancer is a disease that claims 70,000 lives every year in India. Every year, 70,000 people lose their lives. If you get this disease and treatments like chemotherapy and radiation fail, the last remaining option to save your life is a blood stem cell transplantation. You would need to take stem cells from another person’s blood to help your body fight the cancer. This process is quite similar to a blood transfusion when you go to donate blood. But there is one very important difference.\n\nWhen you only need regular blood, there are just eight common blood types—A positive, B positive, O positive, etc. So, finding someone with the same blood type isn’t that difficult. But for stem cell transplantation, your HLA type must match. And there are more than 20,000 different HLA types. Finding a match for a blood stem cell transplant is so difficult that the probability is one in 100,000. That means it’s nearly impossible if you try to find a match on your own for a stem cell transplant.\n\nAnd that’s where DKMS comes in, friends—a non-profit organization that maintains the world’s largest stem cell registry.\n\n## A Life Saved: The Story of Sahili Rane\n\nThis story begins on January 9, 2021, when Sahili Rane, living in Mumbai, was diagnosed with blood cancer.\n\n“Around 4:30, a call came from my lab to my husband. He informed my husband, you know, that this is the case. So the first feeling that came to my heart and mind was that Sahili is leaving me.”\n\nThe doctor first suggested chemotherapy, but it didn’t work well. Then the doctor said a stem cell transplant would be necessary. But no one in Sahili’s family had a matching HLA type, so she had no one to donate stem cells.\n\n“Unfortunately, what happened is that my brother and sisters’ HLA matched, but it didn’t match with me. The financial arrangements had been made, luckily, but we couldn’t find a donor.”\n\nOn the doctor’s advice, they contacted DKMS because DKMS has more than 11 million registered stem cell donors. Because of this, after some time, they found a donor. Satish Reddy from Visakhapatnam—his HLA type matched Sahili Rane’s. Satish donated his stem cells, and today, Sahili is not only alive but living a healthy life.\n\n“You are giving a life to a person—that is the best donation. I think you can do it in your life. Nothing else will be comparable to that.”\n\n## Another Miracle: The Story of Maheer from Ahmedabad\n\nAnother amazing story is that of six-year-old Maheer from Ahmedabad. He had acute leukemia, a type of blood cancer, and his entire life depended on a stem cell donation. Maheer was such a small child that he didn’t even understand what was happening. To find a stem cell donor, his parents contacted DKMS, and through them, Maheer found Dr. Sita Arjuna in Germany. Thousands of kilometers away, they found a person whose HLA type matched his, and with this donation, Maheer recovered. Today, Maheer is an 18-year-old young man, and he says, “The only reason that I am alive right now and in front of you is the blood donation—the blood stem cell donation.”\n\n## How You Can Register—Simple and Free\n\nNow, the process of saving lives in this way is very simple, friends, as I explained in my previous video, and it’s completely free of cost for you because DKMS covers all the expenses.\n\nYou just need to go to this website and fill out an online form. I’ve put the link in the description and pinned comment. In this form, you just fill in your basic details, which will take only 5 minutes. A few days later, a swab kit will arrive at your home, with instructions on how to take a cheek swab. Take the cheek swab as instructed, pack the sample back into the same swab kit along with the signed consent form, and scan the QR code on the return envelope. The swab kit will be picked up from your place—someone will come to collect the envelope.\n\nThis sample that you submit will be used to determine your HLA type, and you will be added to the blood stem cell registry. This entire process takes about 40 days, and then you’ll receive an email from DKMS saying you’ve been added to the world stem cell donor database. After that, if your HLA type matches a blood cancer patient, you’ll receive a call from DKMS. You’ll be offered the chance to donate your stem cells.\n\n## The Science: Inside the High-Tech Lab\n\nExactly how does this process work? Let’s look at the live example later in the video. But first, let’s understand the full scientific process used to determine your HLA type. All of this happens in a large high-tech lab here in Tübingen. This is the DKMS Life Science Lab. All the swab samples sent from around the world come here to be processed.\n\nIn the previous video, when I requested your help, about 30,000 of you sent your swab samples. All those samples come to the lab here first.\n\nThe first step is quite interesting. They use a slicing machine to open your envelopes. This machine only works to open these envelopes.\n\nAs you’ll see further on, this entire process is highly automated. Machines are being used that you may never have heard of. But the second step requires manual work. This step requires the most concentration because it’s the most important step. Here, the sample is being taken out of the envelope and placed into a plate. A plate with 96 spots for samples, and it’s being registered in the computer at this same step. If you look at the computer screen, it shows exactly which spot in this plate the sample was placed in. This work is currently done by humans and requires a lot of concentration because if placed incorrectly, samples can get mixed up.\n\nThen comes the third step: DNA extraction. After that, the panel with the samples is sent into this machine, and this machine performs the DNA extraction—the work of extracting DNA from the swab sample you sent. And this DNA extraction is done using that brown liquid, which is actually magnetic beads that, like a magnet, pull out the DNA.\n\nThen, in this machine, the DNA’s quality is checked. This machine checks whether the DNA concentration in the swab sample you provided is high or low and divides the DNA samples into two. That’s why it’s important to follow the instructions properly when taking the swab sample at home. If your swab sample doesn’t have a sufficient amount of DNA, this entire process is essentially wasted.\n\nThen comes another amazing automated machine called the Hydrocyclone. There are so many automated machines here. This one’s job is to multiply the part of the DNA that is relevant for us—relevant for HLA typing—so that it’s easier to read later. This machine multiplies the DNA and that specific part at the right temperature with enzymes. The interesting thing is that this is the old version of this Hydrocyclone machine. Look at the new version—they made it smaller here, a more modern version of the same machine.\n\nThe next step is labeling the DNA. Some technologies are so amazing that they sound like science fiction. But in reality, it’s possible. This machine is an example of that. Through this machine, each DNA sample is being given a barcode. A barcode is being attached to it so that it can be identified later—which donor that DNA came from. And this barcode is being placed inside the DNA. You can’t see it from the outside. I’m not talking about this barcode; rather, this machine is putting its own barcode inside each sample, inside the liquid.\n\nThis technology is so incredible, friends, that in the future, scientists are looking at how DNA can be used for data storage. The work for which we use USB sticks, hard drives, and large data centers today—that same computer data can be stored in DNA when this DNA barcode process is used because each DNA already has its barcode attached. So we don’t need to store them in separate places. To save space, we can store them all in the same liquid. And that’s what this machine does. It took all the sample liquids and stored them all in this small bottle. In this small bottle, friends, 7,000 DNA samples can be stored, and you can see how much space is saved. All the data storage is happening here in liquid form.\n\nThis room is quite noisy, and the machines placed here are very, very expensive. Each machine costs half a million euros. But this step is very important. It’s actually the most essential step because it’s in these machines that the liquid samples are placed, and the DNA reading work is done. These machines read the DNA, determine the HLA typing, and store all that information in the computer. Here too, there are different versions of the machine. This one, for example, is the older version. This one is a more advanced version. You can tell just by its external look that it’s the new upgraded model—like a Pro Max. And all the data is extracted and finally stored in this server.\n\n## When You Get the Call\n\nNow, all this process, friends, is just for collecting blood stem cell donors and creating a registry. But when DKMS actually finds a patient whose HLA type matches yours, DKMS will call you.\n\nThe call might come in a month, a year, or it might never come because finding a match is very rare. But if you do get the call, after the call, you can decide whether you want to donate your stem cells or not. But if you choose to donate, you can save lives. In the previous video, about 30,000 of you registered. Out of those, 15 people received calls, and 15 people chose the option to donate, and that is the reason, friends, that together we have saved the lives of 15 cancer patients.\n\n## The Donation Process\n\nWhen it’s actually time for the stem cell donation, the people from DKMS will help you get to the nearest collection center. In India, they have tie-ups with hospitals in all metro cities. Delhi, Mumbai, Kolkata, Bangalore—in these places, they will take you to the nearest collection center to donate. But if you live in a remote area, like somewhere in Ladakh, they will pay for your flight, pay for your hotel stay, and you can come to their nearest collection center to donate blood.\n\nBut what happens at a collection center? To find out, we’ve come to a DKMS collection center in Essen. Let’s see how things work here.\n\nSo the machine looks very high-tech. But actually, the process is quite simple. It’s a centrifugal machine. Blood is taken from one arm. This machine separates the blood into three parts: red blood cells, which you can see here in the dark line; plasma, which is present in the white line here; and the third, most important thing—the stem cells—which are present in this yellow line and get collected into this packet.\n\nAfter separating the stem cells, the remaining blood is returned to your body through the other arm. Here you can see the machine open. Inside, it’s basically a centrifugal that spins like this, and there’s a covering here. This entire process takes only two to three hours and is not painful at all. There’s just a little pain when the needle is inserted to draw blood, which also happens in a normal blood donation. But apart from that, during the two to three hours, you can relax. Sit and watch a movie, browse the internet—just like these people are doing. And it’s that simple.\n\nAnd the stem cells taken from your body will be regenerated by your body in no time—just two to three weeks, and they’ll be back.\n\n“So did you feel any pain during the whole process?”  \n“Just first, or so right now, you don’t feel any pain.”  \n“No.”\n\n## The Urgent Need in India\n\nSo, saving someone’s life is that simple, friends. But the unfortunate thing is that in India, every year, more than 100,000 blood cancer cases are seen, and across the entire country, the total number of registered people is only 800,000. So actually, the chance of a blood cancer patient finding a match in our country is quite low because very few people have registered.\n\nTherefore, I’d say, friends, if you’re watching this video, please go and register. Last year we saved 15 lives. This year, let’s set a target of saving 150 lives. For that, 300,000 of you will need to register. So I hope that as many people as possible watching this video will register, and this work is completely free of cost, as I’ve explained. Such a small effort can save someone’s life. While doing this work, friends, just think about this: if someone in your family got blood cancer, how would you feel? Such a small effort can make such a big impact.\n\nLet’s save lives together. If you found this video informative, then please also watch this video, friends, where I’ve talked about cancer in detail—how you can protect yourself from getting cancer, what prevention steps you can take. You can watch it by clicking here. Thank you very much."
    }
  },
  "status_details": [
    {
      "status": "REQUIRED_CONTENT_GENERATED",
      "created_at": "2025-10-30T05:54:05.494610+00:00",
      "reason": "Initial generation."
    },
    {
      "status": "CATEGORIZATION_COMPLETED",
      "created_at": "2025-10-30T05:55:18.616085+00:00",
      "reason": "Categorization Complete."
    },
    {
      "status": "ARTICLE_GENERATED",
      "created_at": "2025-10-30T06:21:06.101279+00:00",
      "reason": "Article Generation Complete."
    }
  ]
}